{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Neo4j Knowledge Graph\n",
    "This notebook creates the COVID-19-Net knowledge graph by ingesting the .csv files in the Neo4j import directory."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import time\n",
    "from pathlib import Path"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "NEO4J_HOME = Path(os.getenv('NEO4J_HOME'))\n",
    "print(NEO4J_HOME)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Start Neo4j database"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Directories in use:\n",
      "  home:         /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-4af96121-2328-4e2f-ba60-6d8b728a26d5/installation-4.0.3\n",
      "  config:       /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-4af96121-2328-4e2f-ba60-6d8b728a26d5/installation-4.0.3/conf\n",
      "  logs:         /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-4af96121-2328-4e2f-ba60-6d8b728a26d5/installation-4.0.3/logs\n",
      "  plugins:      /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-4af96121-2328-4e2f-ba60-6d8b728a26d5/installation-4.0.3/plugins\n",
      "  import:       /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-4af96121-2328-4e2f-ba60-6d8b728a26d5/installation-4.0.3/import\n",
      "  data:         /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-4af96121-2328-4e2f-ba60-6d8b728a26d5/installation-4.0.3/data\n",
      "  certificates: /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-4af96121-2328-4e2f-ba60-6d8b728a26d5/installation-4.0.3/certificates\n",
      "  run:          /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-4af96121-2328-4e2f-ba60-6d8b728a26d5/installation-4.0.3/run\n",
      "Starting Neo4j.\n",
      "Started neo4j (pid 1554). It is available at http://localhost:7474/\n",
      "There may be a short delay until the server is ready.\n",
      "See /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-4af96121-2328-4e2f-ba60-6d8b728a26d5/installation-4.0.3/logs/neo4j.log for current status.\n"
     ]
    }
   ],
   "source": [
    "!\"$NEO4J_HOME\"/bin/neo4j start"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Wait until Neo4j has started up"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['Neo4j is running at pid 1554']\n",
      "['Neo4j is running at pid 1554']\n"
     ]
    }
   ],
   "source": [
    "status = 'unknown'\n",
    "while not 'Neo4j is running' in status:\n",
    "    time.sleep(15)\n",
    "    status = !\"$NEO4J_HOME\"/bin/neo4j status\n",
    "    status = str(status)\n",
    "    print(status)\n",
    "\n",
    "# even when the status is running, sometimes neo4j still needs more time\n",
    "time.sleep(15)\n",
    "print(status)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Run Cypher commands to create Knowledge Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "start = time.time()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Endpoint: bolt://localhost:7687\n",
      "Username: neo4j\n",
      "Password: neo4jbinder\n",
      " \n",
      "----------------------------------------------\n",
      "Running 00a-Init.cypher:\n",
      " \n",
      "// delete all nodes and drop indices\n",
      "MATCH (n) DETACH DELETE n;\n",
      "CALL apoc.schema.assert({},{});\n",
      "\n",
      "// create constraints\n",
      "CREATE CONSTRAINT location_c ON (n:Location) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT continent_c ON (n:Continent) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT country_c ON (n:Contry) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT admin1_c ON (n:Admin1) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT region_c ON (n:Region) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT division_c ON (n:Division) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT admin2_c ON (n:Admin2) ASSERT n.id IS UNIQUE;\n",
      "CREATE INDEX admin2_f FOR (n:Admin2) ON (n.fips, n.stateFips);\n",
      "CREATE CONSTRAINT city_c ON (n:City) ASSERT n.id IS UNIQUE;\n",
      "                                   \n",
      "CREATE CONSTRAINT organism_c ON (n:Organism) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT publication_c ON (n:Publication) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT genome_c ON (n:Genome) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT strain_c ON (n:Strain) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT gene_c ON (n:Gene) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT protein_c ON (n:Protein) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT case_c ON (n:Case) ASSERT n.id IS UNIQUE;\n",
      "CREATE INDEX case_d FOR (n:Case) ON (n.date);\n",
      "\n",
      "// list constraints\n",
      "CALL db.constraints();\n",
      "\n",
      "\n",
      "\n",
      "label, key, keys, unique, action\n",
      "\"Case\", \"date\", [\"date\"], FALSE, \"DROPPED\"\n",
      "\"Admin2\", NULL, [\"fips\", \"stateFips\"], FALSE, \"DROPPED\"\n",
      "\"Continent\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"Organism\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"Strain\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"City\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"Location\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"Contry\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"Region\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"Protein\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"Admin1\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"Division\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"Admin2\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"Publication\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"Genome\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"Gene\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"Case\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "name, description\n",
      "\"admin1_c\", \"CONSTRAINT ON ( admin1:Admin1 ) ASSERT (admin1.id) IS UNIQUE\"\n",
      "\"admin2_c\", \"CONSTRAINT ON ( admin2:Admin2 ) ASSERT (admin2.id) IS UNIQUE\"\n",
      "\"case_c\", \"CONSTRAINT ON ( case:Case ) ASSERT (case.id) IS UNIQUE\"\n",
      "\"city_c\", \"CONSTRAINT ON ( city:City ) ASSERT (city.id) IS UNIQUE\"\n",
      "\"continent_c\", \"CONSTRAINT ON ( continent:Continent ) ASSERT (continent.id) IS UNIQUE\"\n",
      "\"country_c\", \"CONSTRAINT ON ( contry:Contry ) ASSERT (contry.id) IS UNIQUE\"\n",
      "\"division_c\", \"CONSTRAINT ON ( division:Division ) ASSERT (division.id) IS UNIQUE\"\n",
      "\"gene_c\", \"CONSTRAINT ON ( gene:Gene ) ASSERT (gene.id) IS UNIQUE\"\n",
      "\"genome_c\", \"CONSTRAINT ON ( genome:Genome ) ASSERT (genome.id) IS UNIQUE\"\n",
      "\"location_c\", \"CONSTRAINT ON ( location:Location ) ASSERT (location.id) IS UNIQUE\"\n",
      "\"organism_c\", \"CONSTRAINT ON ( organism:Organism ) ASSERT (organism.id) IS UNIQUE\"\n",
      "\"protein_c\", \"CONSTRAINT ON ( protein:Protein ) ASSERT (protein.id) IS UNIQUE\"\n",
      "\"publication_c\", \"CONSTRAINT ON ( publication:Publication ) ASSERT (publication.id) IS UNIQUE\"\n",
      "\"region_c\", \"CONSTRAINT ON ( region:Region ) ASSERT (region.id) IS UNIQUE\"\n",
      "\"strain_c\", \"CONSTRAINT ON ( strain:Strain ) ASSERT (strain.id) IS UNIQUE\"\n",
      " \n",
      "----------------------------------------------\n",
      "Running 00b-Organism.cypher:\n",
      " \n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///Organism.csv' AS row \n",
      "MERGE (o:Organism{id: row.id})\n",
      "SET o.name = row.name, o.scientificName = row.scientificName\n",
      "RETURN count(o) as Organism;\n",
      "Organism\n",
      "9\n",
      " \n",
      "----------------------------------------------\n",
      "Running 00c-Outbreak.cypher:\n",
      " \n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///Outbreak.csv' AS row \n",
      "MERGE (o:Outbreak{id: row.id})\n",
      "SET o.startDate = row.startDate, o.pathogen = row.pathogen\n",
      "RETURN count(o) as Outbreak\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///Outbreak.csv' AS row \n",
      "MATCH (p:Organism{id: row.pathogen})\n",
      "MATCH (o:Outbreak{id: row.id})\n",
      "MERGE(p)-[c:CAUSES]->(o)\n",
      "RETURN count(c) as CAUSES\n",
      ";\n",
      "                    \n",
      "Outbreak\n",
      "3\n",
      "CAUSES\n",
      "3\n",
      " \n",
      "----------------------------------------------\n",
      "Running 00d-Continent.cypher:\n",
      " \n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///Continent.csv' AS row \n",
      "MERGE (c:Continent{id: row.id})\n",
      "SET c.name = row.name\n",
      "RETURN count(c) as Continent;\n",
      "Continent\n",
      "7\n",
      " \n",
      "----------------------------------------------\n",
      "Running 00e-GeoNamesCountry.cypher:\n",
      " \n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00e-GeoNamesCountry.csv' AS row \n",
      "CREATE (c:Country:Location{id: row.id})\n",
      "SET c.name = row.name, c.iso = row.iso, c.iso3 = row.iso3, c.population = row.population, c.areaSqKm = row.areaSqKm\n",
      "RETURN count(c) as Country\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00e-GeoNamesCountry.csv' AS row \n",
      "MATCH (ct:Country{id: row.id})\n",
      "MATCH (c:Continent{id: row.parentId})\n",
      "CREATE (ct)-[i:IN]->(c)\n",
      "RETURN count(i) as IN\n",
      ";\n",
      "Country\n",
      "252\n",
      "IN\n",
      "210\n",
      " \n",
      "----------------------------------------------\n",
      "Running 00f-GeoNamesAdmin1.cypher:\n",
      " \n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00f-GeoNamesAdmin1.csv' AS row \n",
      "CREATE (a:Admin1:Location{id: row.id})\n",
      "SET a.name = row.name, a.code = row.code, a.country = row.parentId\n",
      "RETURN count(a) as Admin1\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00f-GeoNamesAdmin1.csv' AS row \n",
      "MATCH (a:Admin1{id: row.id})\n",
      "MATCH (ct:Country{id: row.parentId})\n",
      "CREATE (a)-[i:IN]->(ct)\n",
      "RETURN count(i) as IN\n",
      ";\n",
      "Admin1\n",
      "3956\n",
      "IN\n",
      "3956\n",
      " \n",
      "----------------------------------------------\n",
      "Running 00g-GeoNamesAdmin2.cypher:\n",
      " \n",
      "USING PERIODIC COMMIT 500\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00g-GeoNamesAdmin2.csv' AS row \n",
      "CREATE (a:Admin2:Location{id: row.id})\n",
      "SET a.name = row.name\n",
      "RETURN count(a) as Admin2\n",
      ";\n",
      "USING PERIODIC COMMIT 500\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00g-GeoNamesAdmin2.csv' AS row \n",
      "MATCH (a2:Admin2{id: row.id})\n",
      "MATCH (a1:Admin1{id: row.parentId})\n",
      "CREATE (a2)-[i:IN]->(a1)\n",
      "RETURN count(i) as IN\n",
      ";\n",
      "Admin2\n",
      "44751\n",
      "IN\n",
      "44723\n",
      " \n",
      "----------------------------------------------\n",
      "Running 00h-GeoNamesCity.cypher:\n",
      " \n",
      "USING PERIODIC COMMIT 500\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00h-GeoNamesCity.csv' AS row \n",
      "CREATE (c:City:Location{id: row.id})\n",
      "SET c.name = row.name, c.population = row.population, c.elevation = row.elevation\n",
      "RETURN count(c) as City\n",
      ";\n",
      "USING PERIODIC COMMIT 500\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00h-GeoNamesCity.csv' AS row \n",
      "MATCH (l:Location{id: row.parentId})\n",
      "MATCH (c:City{id: row.id})\n",
      "CREATE (c)-[i:IN]->(l)\n",
      "RETURN count(i) as IN\n",
      ";\n",
      "City\n",
      "136582\n",
      "IN\n",
      "132633\n",
      " \n",
      "----------------------------------------------\n",
      "Running 00i-USCensusRegionDivisionState2017.cypher:\n",
      " \n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00i-USCensus2017Region.csv' AS row \n",
      "CREATE (r:Region:Location{id: row.id})\n",
      "SET r.name = row.name\n",
      "RETURN count(r) as Region\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00i-USCensus2017Division.csv' AS row \n",
      "CREATE (d:Division:Location{id: row.id})\n",
      "SET d.name = row.name\n",
      "RETURN count(d) as Division\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00i-USCensus2017State.csv' AS row \n",
      "MATCH (a:Admin1:Location{name: row.name, country: 'US'})\n",
      "SET a.fips = row.fips, a.division = row.division\n",
      "RETURN count(a) as FIPS\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00i-USCensus2017Region.csv' AS row \n",
      "MATCH (r:Region{id: row.id})\n",
      "MATCH (c:Country{id: row.parentId})\n",
      "CREATE (r)-[i:IN]->(c)\n",
      "RETURN count(i) as IN\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00i-USCensus2017Division.csv' AS row \n",
      "MATCH (d:Division{id: row.id})\n",
      "MATCH (r:Region{id: row.parentId})\n",
      "CREATE (d)-[i:IN]->(r)\n",
      "RETURN count(i) as IN\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00i-USCensus2017State.csv' AS row \n",
      "MATCH (a:Admin1{name: row.name, country: 'US'})\n",
      "MATCH (d:Division{id: row.parentId})\n",
      "CREATE (a)-[i:IN]->(d)\n",
      "RETURN count(i) as IN\n",
      ";\n",
      "\n",
      "Region\n",
      "4\n",
      "Division\n",
      "9\n",
      "FIPS\n",
      "50\n",
      "IN\n",
      "4\n",
      "IN\n",
      "9\n",
      "IN\n",
      "50\n",
      " \n",
      "----------------------------------------------\n",
      "Running 00j-USCensusCountyCity2017.cypher:\n",
      " \n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00j-USCensus2017County.csv' AS row \n",
      "MERGE (a:Admin2:Location{name: row.name})-[:IN]->(a1:Admin1{fips: row.stateFips})\n",
      "SET a.fips = row.fips, a.stateFips = row.stateFips\n",
      "RETURN count(a) as Admin2\n",
      ";\n",
      "\n",
      "Admin2\n",
      "3220\n",
      " \n",
      "----------------------------------------------\n",
      "Running 01a-NCBIStrain.cypher:\n",
      " \n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01a-NCBIstrain.csv' AS row \n",
      "WITH row WHERE NOT row.id IS null\n",
      "MERGE (s:Genome:Strain{id: row.id})\n",
      "SET s.name = row.name, s.taxonomy = row.taxonomy_id, s.collectionDate = row.collection_date,\n",
      "    s.hostTaxonomyId = row.host_taxonomy_id, s.sex = row.sex, s.age = row.age, \n",
      "    s.isolationSource = row.isolation_source\n",
      "RETURN count(s) as Strain\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01a-NCBIStrain.csv' AS row \n",
      "WITH row WHERE NOT row.taxonomy_id IS null\n",
      "MATCH (o:Organism{id: row.taxonomy_id})\n",
      "MATCH (s:Strain{id: row.id})\n",
      "MERGE (o)-[h:HAS]->(s)\n",
      "RETURN count(h) as HAS\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01a-NCBIStrain.csv' AS row \n",
      "WITH row WHERE NOT row.host_taxonomy_id IS null\n",
      "MATCH (o:Organism{id: row.host_taxonomy_id})\n",
      "MATCH (s:Strain{id: row.id})\n",
      "MERGE (o)-[h:CARRIES]->(s)\n",
      "RETURN count(h) as CARRIES\n",
      ";\n",
      "                \n",
      "Strain\n",
      "690\n",
      "HAS\n",
      "690\n",
      "CARRIES\n",
      "689\n",
      " \n",
      "----------------------------------------------\n",
      "Running 01b-Nextstrain.cypher:\n",
      " \n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01b-Nextstrain.csv' AS row \n",
      "WITH row WHERE NOT row.id IS null\n",
      "CREATE (s:Genome:Strain{id: row.id}) \n",
      "SET s.name = row.name, s.alias = row.alias, s.taxonomy = row.taxonomy_id, s.collectionDate = row.collection_date,\n",
      "    s.hostTaxonomyId = row.host_taxonomy_id, s.sex = row.sex, s.age = row.age, s.clade = row.clade,\n",
      "    s.countryExposure = row.country_exposure, s.admin1Exposure = row.admin1_exposure\n",
      "RETURN count(s) as Strain\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01b-Nextstrain.csv' AS row \n",
      "WITH row WHERE NOT row.clade IS null\n",
      "MERGE (c:Clade{id: row.clade})\n",
      "RETURN count(c) as Clade\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01b-Nextstrain.csv' AS row \n",
      "WITH row WHERE NOT row.taxonomy_id IS null\n",
      "MATCH (o:Organism{id: row.taxonomy_id})\n",
      "MATCH (s:Strain{id: row.id})\n",
      "CREATE (o)-[h:HAS]->(s)\n",
      "RETURN count(h) as HAS_STRAIN\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01b-Nextstrain.csv' AS row \n",
      "WITH row WHERE NOT row.clade IS null\n",
      "MATCH (s:Strain{id: row.id})\n",
      "MATCH (c:Clade{id: row.clade})\n",
      "CREATE (s)-[h:HAS]->(c)\n",
      "RETURN count(h) as HAS_CLADE\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01b-Nextstrain.csv' AS row \n",
      "WITH row WHERE NOT row.host_taxonomy_id IS null\n",
      "MATCH (o:Organism{id: row.host_taxonomy_id})\n",
      "MATCH (s:Strain{id: row.id})\n",
      "CREATE (o)-[h:CARRIES]->(s)\n",
      "RETURN count(h) as CARRIES\n",
      ";\n",
      "Strain\n",
      "12717\n",
      "Clade\n",
      "3401\n",
      "HAS_STRAIN\n",
      "12717\n",
      "HAS_CLADE\n",
      "3401\n",
      "CARRIES\n",
      "12703\n",
      " \n",
      "----------------------------------------------\n",
      "Running 01c-NCBIRefSeq.cypher:\n",
      " \n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01c-NCBIRefSeq.csv' AS row \n",
      "MERGE (g:Gene{id: row.ncbigene_id})\n",
      "SET g.name = row.gene, g.start = row.start, g.end = row.end\n",
      "RETURN count(g) as Gene\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01c-NCBIRefSeq.csv' AS row \n",
      "MATCH (gn:Genome{id: row.genbank_id})\n",
      "MATCH (g:Gene{id: row.ncbigene_id})\n",
      "MERGE(gn)-[h:HAS]->(g)\n",
      "RETURN count(h) as Has\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01c-NCBIRefSeq.csv' AS row \n",
      "MERGE (p:Protein{id: row.ncbiprotein_id})\n",
      "SET p.name = row.product\n",
      "RETURN count(p) as Protein\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01c-NCBIRefSeq.csv' AS row \n",
      "MATCH (g:Gene{id: row.ncbigene_id})\n",
      "MATCH (p:Protein{id: row.ncbiprotein_id})\n",
      "MERGE(g)-[e:ENCODES]->(p)\n",
      "RETURN count(e) as ENCODES\n",
      ";\n",
      "Gene\n",
      "28\n",
      "Has\n",
      "28\n",
      "Protein\n",
      "28\n",
      "ENCODES\n",
      "28\n",
      " \n",
      "----------------------------------------------\n",
      "Running 01d-PMC-Accession.cypher:\n",
      " \n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00c-PMC-Accession.csv' AS row\n",
      "WITH row WHERE NOT row.accession IS null\n",
      "MATCH (s:Strain{id: row.accession})\n",
      "MERGE (p:Publication{id: row.id})\n",
      "MERGE (p)-[m:MENTIONS]->(s)\n",
      "RETURN count(m) as Publication\n",
      ";\n",
      "Publication\n",
      "61\n",
      " \n",
      "----------------------------------------------\n",
      "Running 02a-JHUCases.cypher:\n",
      " \n",
      "USING PERIODIC COMMIT 500\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///02a-JHUCases.csv' AS row \n",
      "MERGE (c:Case{id: 'COVID-19-' + row.date + row.countyFips + row.stateFips})\n",
      "SET c.name = 'COVID-19-' + row.date, c.date = date(row.date), c.cummulativeConfirmed = toInteger(row.cummulativeConfirmed), c.cummulativeDeaths = toInteger(row.cummulativeDeaths)\n",
      "RETURN count(c) as CASE\n",
      ";\n",
      "USING PERIODIC COMMIT 500\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///02a-JHUCases.csv' AS row\n",
      "MATCH (c:Case{id: 'COVID-19-' + row.date + row.countyFips + row.stateFips})\n",
      "MATCH (a:Admin2{fips: row.countyFips, stateFips: row.stateFips})\n",
      "MERGE (c)-[r:REPORTED_IN]->(a)\n",
      "RETURN count(r) as REPORTED_IN\n",
      ";\n",
      "USING PERIODIC COMMIT 500\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///02a-JHUCases.csv' AS row\n",
      "MATCH (c:Case{id: 'COVID-19-' + row.date + row.countyFips + row.stateFips})\n",
      "MATCH (o:Outbreak{id: 'COVID-19'})\n",
      "MERGE (c)-[r:RELATED_TO]->(o)\n",
      "RETURN count(o) as RELATED_TO\n",
      ";\n",
      "CASE\n",
      "105818\n",
      "REPORTED_IN\n",
      "104454\n",
      "RELATED_TO\n",
      "105818\n"
     ]
    }
   ],
   "source": [
    "# TODO create a batch script for Windows\n",
    "!./run_cyphers.sh"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "time: 176.41082215309143\n"
     ]
    }
   ],
   "source": [
    "end = time.time()\n",
    "print('time:', end-start)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Make sure to shutdown Neo4j!"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Stopping Neo4j....... stopped\n"
     ]
    }
   ],
   "source": [
    "!\"$NEO4J_HOME\"/bin/neo4j stop"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
