{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create Neo4j Knowledge Graph\n",
    "This notebook creates the COVID-19-Net knowledge graph by ingesting the .csv files in the Neo4j import directory."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 106,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import time\n",
    "from pathlib import Path"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 107,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "/Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-4af96121-2328-4e2f-ba60-6d8b728a26d5/installation-4.0.3\n"
     ]
    }
   ],
   "source": [
    "NEO4J_HOME = Path(os.getenv('NEO4J_HOME'))\n",
    "print(NEO4J_HOME)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Start Neo4j database if it is not running"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 108,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Directories in use:\n",
      "  home:         /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-4af96121-2328-4e2f-ba60-6d8b728a26d5/installation-4.0.3\n",
      "  config:       /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-4af96121-2328-4e2f-ba60-6d8b728a26d5/installation-4.0.3/conf\n",
      "  logs:         /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-4af96121-2328-4e2f-ba60-6d8b728a26d5/installation-4.0.3/logs\n",
      "  plugins:      /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-4af96121-2328-4e2f-ba60-6d8b728a26d5/installation-4.0.3/plugins\n",
      "  import:       /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-4af96121-2328-4e2f-ba60-6d8b728a26d5/installation-4.0.3/import\n",
      "  data:         /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-4af96121-2328-4e2f-ba60-6d8b728a26d5/installation-4.0.3/data\n",
      "  certificates: /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-4af96121-2328-4e2f-ba60-6d8b728a26d5/installation-4.0.3/certificates\n",
      "  run:          /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-4af96121-2328-4e2f-ba60-6d8b728a26d5/installation-4.0.3/run\n",
      "Starting Neo4j.\n",
      "Started neo4j (pid 6791). It is available at http://localhost:7474/\n",
      "There may be a short delay until the server is ready.\n",
      "See /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-4af96121-2328-4e2f-ba60-6d8b728a26d5/installation-4.0.3/logs/neo4j.log for current status.\n"
     ]
    }
   ],
   "source": [
    "status = !\"$NEO4J_HOME\"/bin/neo4j status\n",
    "status = str(status)\n",
    "if not 'Neo4j is running' in status:\n",
    "   !\"$NEO4J_HOME\"/bin/neo4j start"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Wait until Neo4j has started up"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 109,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['Neo4j is running at pid 6791']\n"
     ]
    }
   ],
   "source": [
    "status = !\"$NEO4J_HOME\"/bin/neo4j status\n",
    "status = str(status)\n",
    "while not 'Neo4j is running' in status:\n",
    "    time.sleep(15)\n",
    "    status = !\"$NEO4J_HOME\"/bin/neo4j status\n",
    "    status = str(status)\n",
    "    print(status)\n",
    "\n",
    "# sometimes neo4j needs more time to be ready\n",
    "time.sleep(15)\n",
    "print(status)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Run Cypher commands to create Knowledge Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 110,
   "metadata": {},
   "outputs": [],
   "source": [
    "start = time.time()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 111,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Endpoint: bolt://localhost:7687\n",
      "Username: neo4j\n",
      "Password: neo4jbinder\n",
      " \n",
      "----------------------------------------------\n",
      "Running 00a-Init.cypher:\n",
      " \n",
      "// delete all nodes and drop indices\n",
      "MATCH (n) DETACH DELETE n;\n",
      "CALL apoc.schema.assert({},{});\n",
      "\n",
      "// create constraints\n",
      "CREATE CONSTRAINT location ON (n:Location) ASSERT n.id IS UNIQUE;\n",
      "CREATE INDEX location_n FOR (n:Location) ON (n.name);\n",
      "CREATE CONSTRAINT unregion ON (n:UNRegion) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT unsubregion ON (n:UNSubRegion) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT unintermediateregion ON (n:UNIntermediateRegion) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT country ON (n:Country) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT admin1 ON (n:Admin1) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT usregion ON (n:USRegion) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT usdivision ON (n:USDivision) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT admin2 ON (n:Admin2) ASSERT n.id IS UNIQUE;\n",
      "CREATE INDEX admin2_f FOR (n:Admin2) ON (n.fips, n.stateFips);\n",
      "CREATE CONSTRAINT city ON (n:City) ASSERT n.id IS UNIQUE;\n",
      "                                   \n",
      "CREATE CONSTRAINT organism ON (n:Organism) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT outbreak ON (n:Outbreak) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT publication ON (n:Publication) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT genome ON (n:Genome) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT strain ON (n:Strain) ASSERT n.id IS UNIQUE;\n",
      "CREATE INDEX strain_n FOR (n:Strain) ON (n.name);\n",
      "CREATE CONSTRAINT variation ON (n:Variation) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT gene ON (n:Gene) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT protein ON (n:Protein) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT cases ON (n:Cases) ASSERT n.id IS UNIQUE;\n",
      "CREATE INDEX cases_d FOR (n:Cases) ON (n.date);\n",
      "\n",
      "// list constraints\n",
      "CALL db.constraints();\n",
      "CALL db.indexes();\n",
      "\n",
      "\n",
      "\n",
      "\u001b[31mUnable to connect to localhost:7687, ensure the database is running and that there is a working network connection to it.\u001b[m\n",
      " \n",
      "----------------------------------------------\n",
      "Running 00b-Organism.cypher:\n",
      " \n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///Organism.csv' AS row \n",
      "MERGE (o:Organism{id: row.id})\n",
      "SET o.name = row.name, o.scientificName = row.scientificName\n",
      "RETURN count(o) as Organism;\n",
      "Organism\n",
      "13\n",
      " \n",
      "----------------------------------------------\n",
      "Running 00c-Outbreak.cypher:\n",
      " \n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///Outbreak.csv' AS row \n",
      "MERGE (o:Outbreak{id: row.id})\n",
      "SET o.name = row.id, o.startDate = row.startDate, o.pathogen = row.pathogen\n",
      "RETURN count(o) as Outbreak\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///Outbreak.csv' AS row \n",
      "MATCH (p:Organism{id: row.pathogen})\n",
      "MATCH (o:Outbreak{id: row.id})\n",
      "MERGE(p)-[c:CAUSES]->(o)\n",
      "RETURN count(c) as CAUSES\n",
      ";\n",
      "                    \n",
      "Outbreak\n",
      "3\n",
      "CAUSES\n",
      "3\n",
      " \n",
      "----------------------------------------------\n",
      "Running 00e-GeoNamesCountry.cypher:\n",
      " \n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00e-GeoNamesCountry.csv' AS row \n",
      "MERGE (c:Country:Location{id: row.id})\n",
      "SET c.name = row.name, c.iso = row.iso, c.iso3 = row.iso3, c.population = row.population, c.areaSqKm = row.areaSqKm\n",
      "RETURN count(c) as Country\n",
      ";\n",
      "Country\n",
      "252\n",
      " \n",
      "----------------------------------------------\n",
      "Running 00f-GeoNamesAdmin1.cypher:\n",
      " \n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00f-GeoNamesAdmin1.csv' AS row \n",
      "MERGE (a:Admin1:Location{id: row.id})\n",
      "SET a.name = row.name, a.code = row.code, a.country = row.parentId\n",
      "RETURN count(a) as Admin1\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00f-GeoNamesAdmin1.csv' AS row \n",
      "MATCH (a:Admin1{id: row.id})\n",
      "MATCH (ct:Country{id: row.parentId})\n",
      "MERGE (a)-[i:IN]->(ct)\n",
      "RETURN count(i) as IN\n",
      ";\n",
      "Admin1\n",
      "3956\n",
      "IN\n",
      "3956\n",
      " \n",
      "----------------------------------------------\n",
      "Running 00g-GeoNamesAdmin2.cypher:\n",
      " \n",
      "USING PERIODIC COMMIT 500\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00g-GeoNamesAdmin2.csv' AS row \n",
      "MERGE (a:Admin2:Location{id: row.id})\n",
      "SET a.name = row.name\n",
      "RETURN count(a) as Admin2\n",
      ";\n",
      "USING PERIODIC COMMIT 500\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00g-GeoNamesAdmin2.csv' AS row \n",
      "MATCH (a2:Admin2{id: row.id})\n",
      "MATCH (a1:Admin1{id: row.parentId})\n",
      "MERGE (a2)-[i:IN]->(a1)\n",
      "RETURN count(i) as IN\n",
      ";\n",
      "Admin2\n",
      "44751\n",
      "IN\n",
      "44723\n",
      " \n",
      "----------------------------------------------\n",
      "Running 00h-GeoNamesCity.cypher:\n",
      " \n",
      "USING PERIODIC COMMIT 500\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00h-GeoNamesCity.csv' AS row \n",
      "MERGE (c:City:Location{id: row.id})\n",
      "SET c.name = row.name, c.population = row.population, c.elevation = row.elevation\n",
      "RETURN count(c) as City\n",
      ";\n",
      "USING PERIODIC COMMIT 500\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00h-GeoNamesCity.csv' AS row \n",
      "MATCH (l:Location{id: row.parentId})\n",
      "MATCH (c:City{id: row.id})\n",
      "MERGE (c)-[i:IN]->(l)\n",
      "RETURN count(i) as IN\n",
      ";\n",
      "City\n",
      "136582\n",
      "IN\n",
      "132633\n",
      " \n",
      "----------------------------------------------\n",
      "Running 00i-USCensusRegionDivisionState2017.cypher:\n",
      " \n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00i-USCensus2017Region.csv' AS row \n",
      "MERGE (r:USRegion:Location{id: row.id})\n",
      "SET r.name = row.name\n",
      "RETURN count(r) as Region\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00i-USCensus2017Division.csv' AS row \n",
      "MERGE (d:USDivision:Location{id: row.id})\n",
      "SET d.name = row.name\n",
      "RETURN count(d) as Division\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00i-USCensus2017State.csv' AS row \n",
      "MATCH (a:Admin1:Location{name: row.name, country: 'US'})\n",
      "SET a.fips = row.fips, a.division = row.division\n",
      "RETURN count(a) as FIPS\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00i-USCensus2017Region.csv' AS row \n",
      "MATCH (r:USRegion{id: row.id})\n",
      "MATCH (c:Country{id: row.parentId})\n",
      "MERGE (r)-[i:IN]->(c)\n",
      "RETURN count(i) as IN\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00i-USCensus2017Division.csv' AS row \n",
      "MATCH (d:USDivision{id: row.id})\n",
      "MATCH (r:USRegion{id: row.parentId})\n",
      "MERGE (d)-[i:IN]->(r)\n",
      "RETURN count(i) as IN\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00i-USCensus2017State.csv' AS row \n",
      "MATCH (a:Admin1{name: row.name, country: 'US'})\n",
      "MATCH (d:USDivision{id: row.parentId})\n",
      "MERGE (a)-[i:IN]->(d)\n",
      "RETURN count(i) as IN\n",
      ";\n",
      "\n",
      "Region\n",
      "4\n",
      "Division\n",
      "9\n",
      "FIPS\n",
      "50\n",
      "IN\n",
      "4\n",
      "IN\n",
      "9\n",
      "IN\n",
      "50\n",
      " \n",
      "----------------------------------------------\n",
      "Running 00j-USCensusCountyCity2017.cypher:\n",
      " \n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00j-USCensus2017County.csv' AS row \n",
      "MERGE (a:Admin2:Location{name: row.name})-[:IN]->(a1:Admin1{fips: row.stateFips})\n",
      "SET a.fips = row.fips, a.stateFips = row.stateFips\n",
      "RETURN count(a) as Admin2\n",
      ";\n",
      "\n",
      "Admin2\n",
      "3220\n",
      " \n",
      "----------------------------------------------\n",
      "Running 00k-UNRegion.cypher:\n",
      " \n",
      "MERGE (w:World:Location{id: \"m49:1\"})\n",
      "SET w.name = \"World\"\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00k-UNAll.csv' AS row\n",
      "MERGE (r:UNRegion:Location{id: row.UNRegionCode})\n",
      "SET r.name = row.UNRegion\n",
      "RETURN count(r) as UNRegion\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00k-UNAll.csv' AS row \n",
      "WITH row WHERE NOT row.UNSubRegion IS null\n",
      "MERGE (s:UNSubRegion:Location{id: row.UNSubRegionCode})\n",
      "SET s.name = row.UNSubRegion\n",
      "RETURN count(s) as UNSubRegion\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00k-UNAll.csv' AS row\n",
      "WITH row WHERE NOT row.UNIntermediateRegion IS null\n",
      "MERGE (n:UNIntermediateRegion:Location{id: row.UNIntermediateRegionCode})\n",
      "SET n.name = row.UNIntermediateRegion\n",
      "RETURN count(n) as UNIntermediateRegion\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00k-UNAll.csv' AS row \n",
      "MATCH (r:UNRegion{id: row.UNRegionCode})\n",
      "MATCH (w:World{id: \"m49:1\"})\n",
      "MERGE (r)-[i:IN]->(w)\n",
      "RETURN count(i) as IN\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00k-UNAll.csv' AS row\n",
      "WITH row WHERE NOT row.UNSubRegion IS null\n",
      "MATCH (s:UNSubRegion{id: row.UNSubRegionCode})\n",
      "MATCH (r:UNRegion{id: row.UNRegionCode})\n",
      "MERGE (s)-[i:IN]->(r)\n",
      "RETURN count(i) as IN\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00k-UNAll.csv' AS row \n",
      "WITH row WHERE NOT row.UNIntermediateRegion IS null\n",
      "MATCH (n:UNIntermediateRegion{id: row.UNIntermediateRegionCode})\n",
      "MATCH (s:UNSubRegion{id: row.UNSubRegionCode})\n",
      "MERGE (n)-[i:IN]->(s)\n",
      "RETURN count(i) as IN\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00k-UNRegion.csv' AS row \n",
      "MATCH (c:Country{iso3: row.iso3})\n",
      "MATCH (r:UNRegion{id: row.UNRegionCode})\n",
      "MERGE (c)-[i:IN]->(r)\n",
      "RETURN count(i) as IN\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00k-UNSubRegion.csv' AS row \n",
      "MATCH (c:Country{iso3: row.iso3})\n",
      "MATCH (s:UNSubRegion{id: row.UNSubRegionCode})\n",
      "MERGE (c)-[i:IN]->(s)\n",
      "RETURN count(i) as IN\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00k-UNIntermediateRegion.csv' AS row \n",
      "MATCH (c:Country{iso3: row.iso3})\n",
      "MATCH (n:UNIntermediateRegion{id: row.UNIntermediateRegionCode})\n",
      "MERGE(c)-[i:IN]->(n)\n",
      "RETURN count(i) as IN\n",
      ";\n",
      "                                        \n",
      "\n",
      "UNRegion\n",
      "255\n",
      "UNSubRegion\n",
      "254\n",
      "UNIntermediateRegion\n",
      "107\n",
      "IN\n",
      "255\n",
      "IN\n",
      "254\n",
      "IN\n",
      "107\n",
      "IN\n",
      "1\n",
      "IN\n",
      "146\n",
      "IN\n",
      "107\n",
      " \n",
      "----------------------------------------------\n",
      "Running 01b-Nextstrain.cypher:\n",
      " \n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01b-Nextstrain.csv' AS row \n",
      "WITH row WHERE NOT row.id IS null\n",
      "MERGE (s:Genome:Strain{id: row.id}) \n",
      "SET s.name = row.name, s.taxonomyId = row.taxonomyId, s.collectionDate = row.collectionDate,\n",
      "    s.hostTaxonomyId = row.hostTaxonomyId, s.sex = row.sex, s.age = row.age, s.clade = row.clade,\n",
      "    s.exposureCountry = row.exposureCountry, s.exposureAdmin1 = row.exposureAdmin1\n",
      "RETURN count(s) as Strain\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01b-Nextstrain.csv' AS row \n",
      "WITH row WHERE NOT row.clade IS null\n",
      "MERGE (c:Clade{id: row.clade})\n",
      "RETURN count(c) as Clade\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01b-Nextstrain.csv' AS row \n",
      "WITH row WHERE NOT row.taxonomyId IS null\n",
      "MATCH (o:Organism{id: row.taxonomyId})\n",
      "MATCH (s:Strain{id: row.id})\n",
      "MERGE (o)-[h:HAS]->(s)\n",
      "RETURN count(h) as HAS_STRAIN\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01b-Nextstrain.csv' AS row \n",
      "WITH row WHERE NOT row.clade IS null\n",
      "MATCH (s:Strain{id: row.id})\n",
      "MATCH (c:Clade{id: row.clade})\n",
      "MERGE (s)-[h:HAS]->(c)\n",
      "RETURN count(h) as HAS_CLADE\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01b-Nextstrain.csv' AS row \n",
      "WITH row WHERE NOT row.hostTaxonomyId IS null\n",
      "MATCH (o:Organism{id: row.hostTaxonomyId})\n",
      "MATCH (s:Strain{id: row.id})\n",
      "MERGE (o)-[h:CARRIES]->(s)\n",
      "RETURN count(h) as CARRIES\n",
      ";\n",
      "Strain\n",
      "4219\n",
      "Clade\n",
      "3596\n",
      "HAS_STRAIN\n",
      "4219\n",
      "HAS_CLADE\n",
      "3596\n",
      "CARRIES\n",
      "4219\n",
      " \n",
      "----------------------------------------------\n",
      "Running 01c-NCBIRefSeq.cypher:\n",
      " \n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01c-NCBIRefSeq.csv' AS row \n",
      "MERGE (g:Gene{id: row.ncbigeneId + row.start + row.end})\n",
      "SET g.name = row.gene, g.start = row.start, g.end = row.end\n",
      "RETURN count(g) as Gene\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01c-NCBIRefSeq.csv' AS row \n",
      "MATCH (gn:Genome:Strain{id: row.genbankId})\n",
      "MATCH (g:Gene{id: row.ncbigeneId + row.start + row.end})\n",
      "MERGE(gn)-[h:HAS]->(g)\n",
      "RETURN count(h) as Has\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01c-NCBIRefSeq.csv' AS row \n",
      "MERGE (p:Protein{id: row.ncbiproteinId})\n",
      "SET p.name = row.product\n",
      "RETURN count(p) as Protein\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01c-NCBIRefSeq.csv' AS row \n",
      "MATCH (g:Gene{id: row.ncbigeneId + row.start + row.end})\n",
      "MATCH (p:Protein{id: row.ncbiproteinId})\n",
      "MERGE(g)-[e:ENCODES]->(p)\n",
      "RETURN count(e) as ENCODES\n",
      ";\n",
      "Gene\n",
      "28\n",
      "Has\n",
      "0\n",
      "Protein\n",
      "28\n",
      "ENCODES\n",
      "28\n",
      " \n",
      "----------------------------------------------\n",
      "Running 01e-CNCBStrain.cypher:\n",
      " \n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01e-CNCBStrain.csv' AS row \n",
      "MERGE (s:Genome:Strain{id: row.id}) \n",
      "SET s.name = row.name, s.alias = row.alias, s.taxonomyId = row.taxonomyId, s.collectionDate = row.collectionDate, s.hostTaxonomyId = row.hostTaxonomyId, s.location = row.location\n",
      "RETURN count(s) as Strain\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01e-CNCBStrain.csv' AS row\n",
      "MATCH (o:Organism{id: row.taxonomyId})\n",
      "MATCH (s:Strain{id: row.id})\n",
      "MERGE (o)-[h:HAS]->(s)\n",
      "RETURN count(h) as HAS_STRAIN\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS\n",
      "FROM 'FILE:///01e-CNCBStrain.csv' AS row\n",
      "WITH row WHERE row.locationLevels='0'\n",
      "MATCH (c:Country{name: row.country})\n",
      "MATCH (s:Strain{id: row.id})\n",
      "MERGE (s)-[h:FOUND_IN]->(c)\n",
      "RETURN count(h) as FOUND_IN_COUNTRY\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS\n",
      "FROM 'FILE:///01e-CNCBStrain.csv' AS row\n",
      "WITH row WHERE row.locationLevels='1'\n",
      "MATCH (c:Country{name: row.country})<-[:IN*1..2]-(l1:Location{name: row.admin1})\n",
      "MATCH (s:Strain{id: row.id})\n",
      "MERGE (s)-[h:FOUND_IN]->(l1)\n",
      "RETURN count(h) as FOUND_IN_1\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS\n",
      "FROM 'FILE:///01e-CNCBStrain.csv' AS row\n",
      "WITH row WHERE row.locationLevels='2'\n",
      "MATCH (c:Country{name: row.country})<-[:IN*1..2]-(l1:Location{name: row.admin1})<-[:IN*]-(l2:Location{name: row.admin2})\n",
      "MATCH (s:Strain{id: row.id})\n",
      "MERGE (s)-[h:FOUND_IN]->(l2)\n",
      "RETURN count(h) as FOUND_IN_2\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS\n",
      "FROM 'FILE:///01e-CNCBStrain.csv' AS row\n",
      "WITH row WHERE row.locationLevels='3'\n",
      "MATCH (c:Country{name: row.country})<-[:IN]-(l1:Location{name: row.admin1})<-[:IN]-(l2:Location{name: row.admin2})<-[:IN]-(l3:Location{name: row.city})\n",
      "MATCH (s:Strain{id: row.id})\n",
      "MERGE (s)-[h:FOUND_IN]->(l3)\n",
      "RETURN count(h) as FOUND_IN_3\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01e-CNCBVariant.csv' AS row\n",
      "MERGE (v:Variant{id: row.referenceGenome + ':' + row.start + '-' + row.end + '-' + row.ref + '-' + row.alt})\n",
      "SET v.name = row.geneVariant, v.geneVariant = row.geneVariant, v.proteinVariant = row.proteinVariant, v.variantType = row.variantType, v.variantConsequence = row.variantConsequence, \n",
      "v.start = row.start, v.end = row.end, v.ref = row.ref, v.alt = row.alt, \n",
      "v.taxonomyId = row.taxonomyId, v.referenceGenome = row.referenceGenome\n",
      "RETURN count(v) as Variant\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01e-CNCBVariant.csv' AS row\n",
      "MATCH (s:Strain{name: row.name})\n",
      "MATCH (v:Variant{id: row.referenceGenome + ':' + row.start + '-' + row.end + '-' + row.ref + '-' + row.alt})\n",
      "MERGE (s)-[h:HAS_VARIANT]->(v)\n",
      "RETURN count(h) as HAS_VARIANT\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01e-CNCBVariant.csv' AS row\n",
      "MATCH (g:Gene) WHERE row.start >= g.start AND row.end <= g.end\n",
      "MATCH (v:Variant{id: row.referenceGenome + ':' + row.start + '-' + row.end + '-' + row.ref + '-' + row.alt})\n",
      "MERGE (g)-[h:HAS_VARIANT]->(v)\n",
      "RETURN count(h) as HAS_VARIANT\n",
      ";\n",
      "                    \n",
      "\n",
      "Strain\n",
      "14766\n",
      "HAS_STRAIN\n",
      "14766\n",
      "FOUND_IN_COUNTRY\n",
      "1416\n",
      "FOUND_IN_1\n",
      "8042\n",
      "FOUND_IN_2\n",
      "2763\n",
      "FOUND_IN_3\n",
      "0\n",
      "Variant\n",
      "883\n",
      "HAS_VARIANT\n",
      "894\n",
      "HAS_VARIANT\n",
      "1218\n",
      " \n",
      "----------------------------------------------\n",
      "Running 01h-PMC-Accession.cypher:\n",
      " \n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01h-PMC-Accession.csv' AS row\n",
      "WITH row WHERE NOT row.accession IS null\n",
      "MERGE (p:Publication{id: row.id})\n",
      "RETURN count(p) as Publication\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01h-PMC-Accession.csv' AS row\n",
      "WITH row WHERE NOT row.accession IS null\n",
      "MATCH (s:Strain{id: row.accession})\n",
      "MATCH (p:Publication{id: row.id})\n",
      "MERGE (p)-[m:MENTIONS]->(s)\n",
      "RETURN count(m) as Publication\n",
      ";\n",
      "Publication\n",
      "282\n",
      "Publication\n",
      "251\n",
      " \n",
      "----------------------------------------------\n",
      "Running 02a-JHUCases.cypher:\n",
      " \n",
      "USING PERIODIC COMMIT 500\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///02a-JHUCases.csv' AS row \n",
      "MERGE (c:Cases{id: 'COVID-19-' + row.date + row.countyFips + row.stateFips})\n",
      "SET c.name = 'COVID-19-' + row.date, c.date = date(row.date), c.cummulativeConfirmed = toInteger(row.cummulativeConfirmed), c.cummulativeDeaths = toInteger(row.cummulativeDeaths)\n",
      "RETURN count(c) as CASE\n",
      ";\n",
      "USING PERIODIC COMMIT 500\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///02a-JHUCases.csv' AS row\n",
      "MATCH (c:Cases{id: 'COVID-19-' + row.date + row.countyFips + row.stateFips})\n",
      "MATCH (a:Admin2{fips: row.countyFips, stateFips: row.stateFips})\n",
      "MERGE (c)-[r:REPORTED_IN]->(a)\n",
      "RETURN count(r) as REPORTED_IN\n",
      ";\n",
      "USING PERIODIC COMMIT 500\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///02a-JHUCases.csv' AS row\n",
      "MATCH (c:Cases{id: 'COVID-19-' + row.date + row.countyFips + row.stateFips})\n",
      "MATCH (o:Outbreak{id: 'COVID-19'})\n",
      "MERGE (c)-[r:RELATED_TO]->(o)\n",
      "RETURN count(o) as RELATED_TO\n",
      ";\n",
      "CASE\n",
      "111535\n",
      "REPORTED_IN\n",
      "110109\n",
      "RELATED_TO\n",
      "111535\n"
     ]
    }
   ],
   "source": [
    "# TODO create a batch script for Windows\n",
    "!./run_cyphers.sh"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 112,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "time: 133.5975968837738\n"
     ]
    }
   ],
   "source": [
    "end = time.time()\n",
    "print('time:', end-start)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Make sure to shutdown Neo4j!"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 113,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Stopping Neo4j....... stopped\n"
     ]
    }
   ],
   "source": [
    "!\"$NEO4J_HOME\"/bin/neo4j stop"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
