{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Example queries on COVID-19 Knowledge Graph\n",
    "[Work in progress]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import time\n",
    "import pandas as pd\n",
    "from py2neo import Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "pd.options.display.max_rows = None  # display all rows\n",
    "pd.options.display.max_columns = None  # display all columsns"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "/Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-4af96121-2328-4e2f-ba60-6d8b728a26d5/installation-4.0.3\n"
     ]
    }
   ],
   "source": [
    "NEO4J_HOME = os.getenv('NEO4J_HOME')\n",
    "print(NEO4J_HOME)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Start neo4j database if it is not already running or restart database to load the latest version of the database."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Directories in use:\n",
      "  home:         /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-4af96121-2328-4e2f-ba60-6d8b728a26d5/installation-4.0.3\n",
      "  config:       /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-4af96121-2328-4e2f-ba60-6d8b728a26d5/installation-4.0.3/conf\n",
      "  logs:         /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-4af96121-2328-4e2f-ba60-6d8b728a26d5/installation-4.0.3/logs\n",
      "  plugins:      /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-4af96121-2328-4e2f-ba60-6d8b728a26d5/installation-4.0.3/plugins\n",
      "  import:       /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-4af96121-2328-4e2f-ba60-6d8b728a26d5/installation-4.0.3/import\n",
      "  data:         /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-4af96121-2328-4e2f-ba60-6d8b728a26d5/installation-4.0.3/data\n",
      "  certificates: /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-4af96121-2328-4e2f-ba60-6d8b728a26d5/installation-4.0.3/certificates\n",
      "  run:          /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-4af96121-2328-4e2f-ba60-6d8b728a26d5/installation-4.0.3/run\n",
      "Starting Neo4j.\n",
      "Started neo4j (pid 946). It is available at http://localhost:7474/\n",
      "There may be a short delay until the server is ready.\n",
      "See /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-4af96121-2328-4e2f-ba60-6d8b728a26d5/installation-4.0.3/logs/neo4j.log for current status.\n"
     ]
    }
   ],
   "source": [
    "!\"$NEO4J_HOME\"/bin/neo4j start"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Wait until database is started up"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "time.sleep(15)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = Graph(\"bolt://localhost:7687/\", password=\"neo4jbinder\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### List Organisms in KG"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>scientificName</th>\n",
       "      <th>taxonomy</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>SARS-CoV-2</td>\n",
       "      <td>Severe acute respiratory syndrome coronavirus 2</td>\n",
       "      <td>taxonomy:2697049</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>MERS-CoV</td>\n",
       "      <td>Middle East respiratory syndrome-related coron...</td>\n",
       "      <td>taxonomy:1335626</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>SARS-CoV</td>\n",
       "      <td>Severe acute respiratory syndrome-related coro...</td>\n",
       "      <td>taxonomy:694009</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>human</td>\n",
       "      <td>Homo sapiens</td>\n",
       "      <td>taxonomy:9606</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>intermediate horseshoe bat</td>\n",
       "      <td>Rhinolophus affinis</td>\n",
       "      <td>taxonomy:59477</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>horseshoe bat</td>\n",
       "      <td>Rhinolophus</td>\n",
       "      <td>taxonomy:49442</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Malayan pangolin</td>\n",
       "      <td>Manis javanica</td>\n",
       "      <td>taxonomy:9974</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>palm civet</td>\n",
       "      <td>Paradoxurus</td>\n",
       "      <td>taxonomy:71116</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>carnivores</td>\n",
       "      <td>Canidae</td>\n",
       "      <td>taxonomy:9608</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                         name  \\\n",
       "0                  SARS-CoV-2   \n",
       "1                    MERS-CoV   \n",
       "2                    SARS-CoV   \n",
       "3                       human   \n",
       "4  intermediate horseshoe bat   \n",
       "5               horseshoe bat   \n",
       "6            Malayan pangolin   \n",
       "7                  palm civet   \n",
       "8                  carnivores   \n",
       "\n",
       "                                      scientificName          taxonomy  \n",
       "0    Severe acute respiratory syndrome coronavirus 2  taxonomy:2697049  \n",
       "1  Middle East respiratory syndrome-related coron...  taxonomy:1335626  \n",
       "2  Severe acute respiratory syndrome-related coro...   taxonomy:694009  \n",
       "3                                       Homo sapiens     taxonomy:9606  \n",
       "4                               Rhinolophus affinis     taxonomy:59477  \n",
       "5                                        Rhinolophus    taxonomy:49442  \n",
       "6                                     Manis javanica     taxonomy:9974  \n",
       "7                                        Paradoxurus    taxonomy:71116  \n",
       "8                                            Canidae     taxonomy:9608  "
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (p:Organism)\n",
    "RETURN p.name as name, p.scientificName as scientificName, p.id as taxonomy\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### List Coronavirus Outbreaks"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>scientificName</th>\n",
       "      <th>taxonomy</th>\n",
       "      <th>outbreak</th>\n",
       "      <th>startDate</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>SARS-CoV-2</td>\n",
       "      <td>Severe acute respiratory syndrome coronavirus 2</td>\n",
       "      <td>taxonomy:2697049</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>2019</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>MERS-CoV</td>\n",
       "      <td>Middle East respiratory syndrome-related coron...</td>\n",
       "      <td>taxonomy:1335626</td>\n",
       "      <td>MERS</td>\n",
       "      <td>2012</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>SARS-CoV</td>\n",
       "      <td>Severe acute respiratory syndrome-related coro...</td>\n",
       "      <td>taxonomy:694009</td>\n",
       "      <td>SARS</td>\n",
       "      <td>2003</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "         name                                     scientificName  \\\n",
       "0  SARS-CoV-2    Severe acute respiratory syndrome coronavirus 2   \n",
       "1    MERS-CoV  Middle East respiratory syndrome-related coron...   \n",
       "2    SARS-CoV  Severe acute respiratory syndrome-related coro...   \n",
       "\n",
       "           taxonomy  outbreak startDate  \n",
       "0  taxonomy:2697049  COVID-19      2019  \n",
       "1  taxonomy:1335626      MERS      2012  \n",
       "2   taxonomy:694009      SARS      2003  "
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (p:Organism)-[:CAUSES]->(o:Outbreak)\n",
    "RETURN p.name as name, p.scientificName as scientificName, p.id as taxonomy, o.id as outbreak, o.startDate as startDate\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### List Strains that are mentions in PubMed Central Articles"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>pmc</th>\n",
       "      <th>name</th>\n",
       "      <th>collectionDate</th>\n",
       "      <th>host</th>\n",
       "      <th>host_id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>pmc:PMC7095418</td>\n",
       "      <td>bat/Yunnan/RaTG13/2013</td>\n",
       "      <td>2013-07-24</td>\n",
       "      <td>intermediate horseshoe bat</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_402131</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>pmc:PMC7106073</td>\n",
       "      <td>bat/Yunnan/RaTG13/2013</td>\n",
       "      <td>2013-07-24</td>\n",
       "      <td>intermediate horseshoe bat</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_402131</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>pmc:PMC7067954</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>human</td>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>pmc:PMC7067954</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>human</td>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>pmc:PMC7102578</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>human</td>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>pmc:PMC7102578</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>human</td>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>pmc:PMC7060195</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>human</td>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>pmc:PMC7060195</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>human</td>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>pmc:PMC7062204</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>human</td>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>pmc:PMC7062204</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>human</td>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>pmc:PMC7089605</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>human</td>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>pmc:PMC7089605</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>human</td>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>pmc:PMC7092824</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>human</td>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>pmc:PMC7092824</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>human</td>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>pmc:PMC7036342</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>human</td>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>pmc:PMC7036342</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>human</td>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>Wuhan/IPBCAMS-WH-01/2019</td>\n",
       "      <td>2019-12-24</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_402123</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>Wuhan/WH01/2019</td>\n",
       "      <td>2019-12-26</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_406798</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>Wuhan/WIV02/2019</td>\n",
       "      <td>2019-12-30</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_402127</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>Wuhan/IPBCAMS-WH-03/2019</td>\n",
       "      <td>2019-12-30</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_403930</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>Wuhan/WIV07/2019</td>\n",
       "      <td>2019-12-30</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_402130</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>Wuhan/WIV05/2019</td>\n",
       "      <td>2019-12-30</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_402128</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>Wuhan/HBCDC-HB-01/2019</td>\n",
       "      <td>2019-12-30</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_402132</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>pmc:PMC7045880</td>\n",
       "      <td>Wuhan/IVDC-HB-01/2019</td>\n",
       "      <td>2019-12-30</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_402119</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>pmc:PMC7095418</td>\n",
       "      <td>Wuhan/WIV02/2019</td>\n",
       "      <td>2019-12-30</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_402127</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>pmc:PMC7095418</td>\n",
       "      <td>Wuhan/WIV04/2019</td>\n",
       "      <td>2019-12-30</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_402124</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>pmc:PMC7102556</td>\n",
       "      <td>Wuhan/WIV04/2019</td>\n",
       "      <td>2019-12-30</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_402124</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>pmc:PMC7048180</td>\n",
       "      <td>Wuhan/WIV04/2019</td>\n",
       "      <td>2019-12-30</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_402124</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>Wuhan/IPBCAMS-WH-05/2020</td>\n",
       "      <td>2020-01-01</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_403928</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>Wuhan/WHU01/2020</td>\n",
       "      <td>2020-01-02</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_406716</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>pmc:PMC7055038</td>\n",
       "      <td>Nonthaburi/61/2020</td>\n",
       "      <td>2020-01-08</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_403962</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>pmc:PMC7067954</td>\n",
       "      <td>Shenzhen/HKU-SZ-005/2020</td>\n",
       "      <td>2020-01-11</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_405839</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>Shenzhen/HKU-SZ-005/2020</td>\n",
       "      <td>2020-01-11</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_405839</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>pmc:PMC7067954</td>\n",
       "      <td>Nepal/61/2020</td>\n",
       "      <td>2020-01-13</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_410301</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>pmc:PMC7055038</td>\n",
       "      <td>Nonthaburi/74/2020</td>\n",
       "      <td>2020-01-13</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_403963</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>Sichuan/IVDC-SC-001/2020</td>\n",
       "      <td>2020-01-15</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_408484</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>Shenzhen/SZTH-003/2020</td>\n",
       "      <td>2020-01-16</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_406594</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>Shenzhen/SZTH-004/2020</td>\n",
       "      <td>2020-01-16</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_406595</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>Yunnan/IVDC-YN-003/2020</td>\n",
       "      <td>2020-01-17</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_408480</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>Guangdong/20SF028/2020</td>\n",
       "      <td>2020-01-17</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_403936</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>Chongqing/IVDC-CQ-001/2020</td>\n",
       "      <td>2020-01-18</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_408481</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>Guangdong/20SF040/2020</td>\n",
       "      <td>2020-01-18</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_403937</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>Shandong/IVDC-SD-001/2020</td>\n",
       "      <td>2020-01-19</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_408482</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>Guangdong/20SF174/2020</td>\n",
       "      <td>2020-01-22</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_406531</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>USA/CA2/2020</td>\n",
       "      <td>2020-01-22</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_406036</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>USA/AZ1/2020</td>\n",
       "      <td>2020-01-22</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_406223</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>Foshan/20SF207/2020</td>\n",
       "      <td>2020-01-22</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_406534</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>Guangzhou/20SF206/2020</td>\n",
       "      <td>2020-01-22</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_406533</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>France/IDF0373/2020</td>\n",
       "      <td>2020-01-23</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_406597</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>France/IDF0372/2020</td>\n",
       "      <td>2020-01-23</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_406596</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>Taiwan/2/2020</td>\n",
       "      <td>2020-01-23</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_406031</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>51</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>USA/CA1/2020</td>\n",
       "      <td>2020-01-23</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_406034</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>52</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>Australia/VIC01/2020</td>\n",
       "      <td>2020-01-25</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_406844</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>53</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>Japan/AI-I-004/2020</td>\n",
       "      <td>2020-01-25</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_407084</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>54</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>Singapore/2/2020</td>\n",
       "      <td>2020-01-25</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_407987</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>55</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>SouthKorea/KCDC03/2020</td>\n",
       "      <td>2020-01-25</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_407193</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>56</th>\n",
       "      <td>pmc:PMC7045880</td>\n",
       "      <td>SouthKorea/KCDC03/2020</td>\n",
       "      <td>2020-01-25</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_407193</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>57</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>Germany/BavPat1/2020</td>\n",
       "      <td>2020-01-28</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_406862</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>58</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>England/01/2020</td>\n",
       "      <td>2020-01-29</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_407071</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>59</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>USA/CA5/2020</td>\n",
       "      <td>2020-01-29</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_408010</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>60</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>England/02/2020</td>\n",
       "      <td>2020-01-29</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_407073</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>61</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>USA/CA3/2020</td>\n",
       "      <td>2020-01-29</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_408008</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>62</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>France/IDF0515/2020</td>\n",
       "      <td>2020-01-29</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_408430</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>63</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>USA/CA4/2020</td>\n",
       "      <td>2020-01-29</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_408009</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>64</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>Japan/TY-WK-012/2020</td>\n",
       "      <td>2020-01-29</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_408665</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>Japan/KY-V-029/2020</td>\n",
       "      <td>2020-01-29</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_408669</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>Australia/QLD02/2020</td>\n",
       "      <td>2020-01-30</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_407896</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>67</th>\n",
       "      <td>pmc:PMC7106203</td>\n",
       "      <td>Singapore/3/2020</td>\n",
       "      <td>2020-02-01</td>\n",
       "      <td>human</td>\n",
       "      <td>https://www.gisaid.org/EPI_ISL_407988</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "               pmc                        name collectionDate  \\\n",
       "0   pmc:PMC7095418      bat/Yunnan/RaTG13/2013     2013-07-24   \n",
       "1   pmc:PMC7106073      bat/Yunnan/RaTG13/2013     2013-07-24   \n",
       "2   pmc:PMC7067954                  Wuhan-Hu-1     2019-12-13   \n",
       "3   pmc:PMC7067954                  Wuhan-Hu-1     2019-12-13   \n",
       "4   pmc:PMC7102578                  Wuhan-Hu-1     2019-12-13   \n",
       "5   pmc:PMC7102578                  Wuhan-Hu-1     2019-12-13   \n",
       "6   pmc:PMC7060195                  Wuhan-Hu-1     2019-12-13   \n",
       "7   pmc:PMC7060195                  Wuhan-Hu-1     2019-12-13   \n",
       "8   pmc:PMC7062204                  Wuhan-Hu-1     2019-12-13   \n",
       "9   pmc:PMC7062204                  Wuhan-Hu-1     2019-12-13   \n",
       "10  pmc:PMC7089605                  Wuhan-Hu-1     2019-12-13   \n",
       "11  pmc:PMC7089605                  Wuhan-Hu-1     2019-12-13   \n",
       "12  pmc:PMC7092824                  Wuhan-Hu-1     2019-12-13   \n",
       "13  pmc:PMC7092824                  Wuhan-Hu-1     2019-12-13   \n",
       "14  pmc:PMC7036342                  Wuhan-Hu-1     2019-12-13   \n",
       "15  pmc:PMC7036342                  Wuhan-Hu-1     2019-12-13   \n",
       "16  pmc:PMC7106203    Wuhan/IPBCAMS-WH-01/2019     2019-12-24   \n",
       "17  pmc:PMC7106203             Wuhan/WH01/2019     2019-12-26   \n",
       "18  pmc:PMC7106203            Wuhan/WIV02/2019     2019-12-30   \n",
       "19  pmc:PMC7106203    Wuhan/IPBCAMS-WH-03/2019     2019-12-30   \n",
       "20  pmc:PMC7106203            Wuhan/WIV07/2019     2019-12-30   \n",
       "21  pmc:PMC7106203            Wuhan/WIV05/2019     2019-12-30   \n",
       "22  pmc:PMC7106203      Wuhan/HBCDC-HB-01/2019     2019-12-30   \n",
       "23  pmc:PMC7045880       Wuhan/IVDC-HB-01/2019     2019-12-30   \n",
       "24  pmc:PMC7095418            Wuhan/WIV02/2019     2019-12-30   \n",
       "25  pmc:PMC7095418            Wuhan/WIV04/2019     2019-12-30   \n",
       "26  pmc:PMC7102556            Wuhan/WIV04/2019     2019-12-30   \n",
       "27  pmc:PMC7048180            Wuhan/WIV04/2019     2019-12-30   \n",
       "28  pmc:PMC7106203    Wuhan/IPBCAMS-WH-05/2020     2020-01-01   \n",
       "29  pmc:PMC7106203            Wuhan/WHU01/2020     2020-01-02   \n",
       "30  pmc:PMC7055038          Nonthaburi/61/2020     2020-01-08   \n",
       "31  pmc:PMC7067954    Shenzhen/HKU-SZ-005/2020     2020-01-11   \n",
       "32  pmc:PMC7106203    Shenzhen/HKU-SZ-005/2020     2020-01-11   \n",
       "33  pmc:PMC7067954               Nepal/61/2020     2020-01-13   \n",
       "34  pmc:PMC7055038          Nonthaburi/74/2020     2020-01-13   \n",
       "35  pmc:PMC7106203    Sichuan/IVDC-SC-001/2020     2020-01-15   \n",
       "36  pmc:PMC7106203      Shenzhen/SZTH-003/2020     2020-01-16   \n",
       "37  pmc:PMC7106203      Shenzhen/SZTH-004/2020     2020-01-16   \n",
       "38  pmc:PMC7106203     Yunnan/IVDC-YN-003/2020     2020-01-17   \n",
       "39  pmc:PMC7106203      Guangdong/20SF028/2020     2020-01-17   \n",
       "40  pmc:PMC7106203  Chongqing/IVDC-CQ-001/2020     2020-01-18   \n",
       "41  pmc:PMC7106203      Guangdong/20SF040/2020     2020-01-18   \n",
       "42  pmc:PMC7106203   Shandong/IVDC-SD-001/2020     2020-01-19   \n",
       "43  pmc:PMC7106203      Guangdong/20SF174/2020     2020-01-22   \n",
       "44  pmc:PMC7106203                USA/CA2/2020     2020-01-22   \n",
       "45  pmc:PMC7106203                USA/AZ1/2020     2020-01-22   \n",
       "46  pmc:PMC7106203         Foshan/20SF207/2020     2020-01-22   \n",
       "47  pmc:PMC7106203      Guangzhou/20SF206/2020     2020-01-22   \n",
       "48  pmc:PMC7106203         France/IDF0373/2020     2020-01-23   \n",
       "49  pmc:PMC7106203         France/IDF0372/2020     2020-01-23   \n",
       "50  pmc:PMC7106203               Taiwan/2/2020     2020-01-23   \n",
       "51  pmc:PMC7106203                USA/CA1/2020     2020-01-23   \n",
       "52  pmc:PMC7106203        Australia/VIC01/2020     2020-01-25   \n",
       "53  pmc:PMC7106203         Japan/AI-I-004/2020     2020-01-25   \n",
       "54  pmc:PMC7106203            Singapore/2/2020     2020-01-25   \n",
       "55  pmc:PMC7106203      SouthKorea/KCDC03/2020     2020-01-25   \n",
       "56  pmc:PMC7045880      SouthKorea/KCDC03/2020     2020-01-25   \n",
       "57  pmc:PMC7106203        Germany/BavPat1/2020     2020-01-28   \n",
       "58  pmc:PMC7106203             England/01/2020     2020-01-29   \n",
       "59  pmc:PMC7106203                USA/CA5/2020     2020-01-29   \n",
       "60  pmc:PMC7106203             England/02/2020     2020-01-29   \n",
       "61  pmc:PMC7106203                USA/CA3/2020     2020-01-29   \n",
       "62  pmc:PMC7106203         France/IDF0515/2020     2020-01-29   \n",
       "63  pmc:PMC7106203                USA/CA4/2020     2020-01-29   \n",
       "64  pmc:PMC7106203        Japan/TY-WK-012/2020     2020-01-29   \n",
       "65  pmc:PMC7106203         Japan/KY-V-029/2020     2020-01-29   \n",
       "66  pmc:PMC7106203        Australia/QLD02/2020     2020-01-30   \n",
       "67  pmc:PMC7106203            Singapore/3/2020     2020-02-01   \n",
       "\n",
       "                          host                                host_id  \n",
       "0   intermediate horseshoe bat  https://www.gisaid.org/EPI_ISL_402131  \n",
       "1   intermediate horseshoe bat  https://www.gisaid.org/EPI_ISL_402131  \n",
       "2                        human                  ncbiprotein:NC_045512  \n",
       "3                        human                  ncbiprotein:NC_045512  \n",
       "4                        human                  ncbiprotein:NC_045512  \n",
       "5                        human                  ncbiprotein:NC_045512  \n",
       "6                        human                  ncbiprotein:NC_045512  \n",
       "7                        human                  ncbiprotein:NC_045512  \n",
       "8                        human                  ncbiprotein:NC_045512  \n",
       "9                        human                  ncbiprotein:NC_045512  \n",
       "10                       human                  ncbiprotein:NC_045512  \n",
       "11                       human                  ncbiprotein:NC_045512  \n",
       "12                       human                  ncbiprotein:NC_045512  \n",
       "13                       human                  ncbiprotein:NC_045512  \n",
       "14                       human                  ncbiprotein:NC_045512  \n",
       "15                       human                  ncbiprotein:NC_045512  \n",
       "16                       human  https://www.gisaid.org/EPI_ISL_402123  \n",
       "17                       human  https://www.gisaid.org/EPI_ISL_406798  \n",
       "18                       human  https://www.gisaid.org/EPI_ISL_402127  \n",
       "19                       human  https://www.gisaid.org/EPI_ISL_403930  \n",
       "20                       human  https://www.gisaid.org/EPI_ISL_402130  \n",
       "21                       human  https://www.gisaid.org/EPI_ISL_402128  \n",
       "22                       human  https://www.gisaid.org/EPI_ISL_402132  \n",
       "23                       human  https://www.gisaid.org/EPI_ISL_402119  \n",
       "24                       human  https://www.gisaid.org/EPI_ISL_402127  \n",
       "25                       human  https://www.gisaid.org/EPI_ISL_402124  \n",
       "26                       human  https://www.gisaid.org/EPI_ISL_402124  \n",
       "27                       human  https://www.gisaid.org/EPI_ISL_402124  \n",
       "28                       human  https://www.gisaid.org/EPI_ISL_403928  \n",
       "29                       human  https://www.gisaid.org/EPI_ISL_406716  \n",
       "30                       human  https://www.gisaid.org/EPI_ISL_403962  \n",
       "31                       human  https://www.gisaid.org/EPI_ISL_405839  \n",
       "32                       human  https://www.gisaid.org/EPI_ISL_405839  \n",
       "33                       human  https://www.gisaid.org/EPI_ISL_410301  \n",
       "34                       human  https://www.gisaid.org/EPI_ISL_403963  \n",
       "35                       human  https://www.gisaid.org/EPI_ISL_408484  \n",
       "36                       human  https://www.gisaid.org/EPI_ISL_406594  \n",
       "37                       human  https://www.gisaid.org/EPI_ISL_406595  \n",
       "38                       human  https://www.gisaid.org/EPI_ISL_408480  \n",
       "39                       human  https://www.gisaid.org/EPI_ISL_403936  \n",
       "40                       human  https://www.gisaid.org/EPI_ISL_408481  \n",
       "41                       human  https://www.gisaid.org/EPI_ISL_403937  \n",
       "42                       human  https://www.gisaid.org/EPI_ISL_408482  \n",
       "43                       human  https://www.gisaid.org/EPI_ISL_406531  \n",
       "44                       human  https://www.gisaid.org/EPI_ISL_406036  \n",
       "45                       human  https://www.gisaid.org/EPI_ISL_406223  \n",
       "46                       human  https://www.gisaid.org/EPI_ISL_406534  \n",
       "47                       human  https://www.gisaid.org/EPI_ISL_406533  \n",
       "48                       human  https://www.gisaid.org/EPI_ISL_406597  \n",
       "49                       human  https://www.gisaid.org/EPI_ISL_406596  \n",
       "50                       human  https://www.gisaid.org/EPI_ISL_406031  \n",
       "51                       human  https://www.gisaid.org/EPI_ISL_406034  \n",
       "52                       human  https://www.gisaid.org/EPI_ISL_406844  \n",
       "53                       human  https://www.gisaid.org/EPI_ISL_407084  \n",
       "54                       human  https://www.gisaid.org/EPI_ISL_407987  \n",
       "55                       human  https://www.gisaid.org/EPI_ISL_407193  \n",
       "56                       human  https://www.gisaid.org/EPI_ISL_407193  \n",
       "57                       human  https://www.gisaid.org/EPI_ISL_406862  \n",
       "58                       human  https://www.gisaid.org/EPI_ISL_407071  \n",
       "59                       human  https://www.gisaid.org/EPI_ISL_408010  \n",
       "60                       human  https://www.gisaid.org/EPI_ISL_407073  \n",
       "61                       human  https://www.gisaid.org/EPI_ISL_408008  \n",
       "62                       human  https://www.gisaid.org/EPI_ISL_408430  \n",
       "63                       human  https://www.gisaid.org/EPI_ISL_408009  \n",
       "64                       human  https://www.gisaid.org/EPI_ISL_408665  \n",
       "65                       human  https://www.gisaid.org/EPI_ISL_408669  \n",
       "66                       human  https://www.gisaid.org/EPI_ISL_407896  \n",
       "67                       human  https://www.gisaid.org/EPI_ISL_407988  "
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (p:Publication)-[:MENTIONS]->(s:Strain)<-[:CARRIES]-(o:Organism)\n",
    "RETURN p.id as pmc, s.name as name, s.collectionDate  as collectionDate, o.name as host, s.id as host_id\n",
    "ORDER by s.collectionDate\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()\n",
    "# TODO where do the 2013 bat strains come from??"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### List Gene and Protein information for Reference Genome"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>referenceGenome</th>\n",
       "      <th>name</th>\n",
       "      <th>collectionDate</th>\n",
       "      <th>gene</th>\n",
       "      <th>geneId</th>\n",
       "      <th>protein</th>\n",
       "      <th>protein_id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>ORF1ab</td>\n",
       "      <td>ncbigene:43740578</td>\n",
       "      <td>nsp11</td>\n",
       "      <td>ncbiprotein:YP_009725312</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>ORF1ab</td>\n",
       "      <td>ncbigene:43740578</td>\n",
       "      <td>nsp4</td>\n",
       "      <td>ncbiprotein:YP_009725300</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>ORF1ab</td>\n",
       "      <td>ncbigene:43740578</td>\n",
       "      <td>nsp2</td>\n",
       "      <td>ncbiprotein:YP_009725298</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>ORF1ab</td>\n",
       "      <td>ncbigene:43740578</td>\n",
       "      <td>helicase</td>\n",
       "      <td>ncbiprotein:YP_009725308</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>ORF1ab</td>\n",
       "      <td>ncbigene:43740578</td>\n",
       "      <td>nsp10</td>\n",
       "      <td>ncbiprotein:YP_009725306</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>ORF1ab</td>\n",
       "      <td>ncbigene:43740578</td>\n",
       "      <td>2'-O-ribose methyltransferase</td>\n",
       "      <td>ncbiprotein:YP_009725311</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>ORF1ab</td>\n",
       "      <td>ncbigene:43740578</td>\n",
       "      <td>nsp7</td>\n",
       "      <td>ncbiprotein:YP_009725303</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>ORF1ab</td>\n",
       "      <td>ncbigene:43740578</td>\n",
       "      <td>endoRNAse</td>\n",
       "      <td>ncbiprotein:YP_009725310</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>ORF1ab</td>\n",
       "      <td>ncbigene:43740578</td>\n",
       "      <td>ORF1a polyprotein</td>\n",
       "      <td>ncbiprotein:YP_009725295</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>ORF1ab</td>\n",
       "      <td>ncbigene:43740578</td>\n",
       "      <td>RNA-dependent RNA polymerase</td>\n",
       "      <td>ncbiprotein:YP_009725307</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>ORF1ab</td>\n",
       "      <td>ncbigene:43740578</td>\n",
       "      <td>ORF1ab polyprotein</td>\n",
       "      <td>ncbiprotein:YP_009724389</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>ORF1ab</td>\n",
       "      <td>ncbigene:43740578</td>\n",
       "      <td>nsp6</td>\n",
       "      <td>ncbiprotein:YP_009725302</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>ORF1ab</td>\n",
       "      <td>ncbigene:43740578</td>\n",
       "      <td>nsp8</td>\n",
       "      <td>ncbiprotein:YP_009725304</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>ORF1ab</td>\n",
       "      <td>ncbigene:43740578</td>\n",
       "      <td>3C-like proteinase</td>\n",
       "      <td>ncbiprotein:YP_009725301</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>ORF1ab</td>\n",
       "      <td>ncbigene:43740578</td>\n",
       "      <td>nsp3</td>\n",
       "      <td>ncbiprotein:YP_009725299</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>ORF1ab</td>\n",
       "      <td>ncbigene:43740578</td>\n",
       "      <td>3'-to-5' exonuclease</td>\n",
       "      <td>ncbiprotein:YP_009725309</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>ORF1ab</td>\n",
       "      <td>ncbigene:43740578</td>\n",
       "      <td>nsp9</td>\n",
       "      <td>ncbiprotein:YP_009725305</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>ORF1ab</td>\n",
       "      <td>ncbigene:43740578</td>\n",
       "      <td>leader protein</td>\n",
       "      <td>ncbiprotein:YP_009725297</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>S</td>\n",
       "      <td>ncbigene:43740568</td>\n",
       "      <td>surface glycoprotein</td>\n",
       "      <td>ncbiprotein:YP_009724390</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>ORF3a</td>\n",
       "      <td>ncbigene:43740569</td>\n",
       "      <td>ORF3a protein</td>\n",
       "      <td>ncbiprotein:YP_009724391</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>E</td>\n",
       "      <td>ncbigene:43740570</td>\n",
       "      <td>envelope protein</td>\n",
       "      <td>ncbiprotein:YP_009724392</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>M</td>\n",
       "      <td>ncbigene:43740571</td>\n",
       "      <td>membrane glycoprotein</td>\n",
       "      <td>ncbiprotein:YP_009724393</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>ORF6</td>\n",
       "      <td>ncbigene:43740572</td>\n",
       "      <td>ORF6 protein</td>\n",
       "      <td>ncbiprotein:YP_009724394</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>ORF7a</td>\n",
       "      <td>ncbigene:43740573</td>\n",
       "      <td>ORF7a protein</td>\n",
       "      <td>ncbiprotein:YP_009724395</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>ORF7b</td>\n",
       "      <td>ncbigene:43740574</td>\n",
       "      <td>ORF7b</td>\n",
       "      <td>ncbiprotein:YP_009725318</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>ORF8</td>\n",
       "      <td>ncbigene:43740577</td>\n",
       "      <td>ORF8 protein</td>\n",
       "      <td>ncbiprotein:YP_009724396</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>N</td>\n",
       "      <td>ncbigene:43740575</td>\n",
       "      <td>nucleocapsid phosphoprotein</td>\n",
       "      <td>ncbiprotein:YP_009724397</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>ncbiprotein:NC_045512</td>\n",
       "      <td>Wuhan-Hu-1</td>\n",
       "      <td>2019-12-13</td>\n",
       "      <td>ORF10</td>\n",
       "      <td>ncbigene:43740576</td>\n",
       "      <td>ORF10 protein</td>\n",
       "      <td>ncbiprotein:YP_009725255</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "          referenceGenome        name collectionDate    gene  \\\n",
       "0   ncbiprotein:NC_045512  Wuhan-Hu-1     2019-12-13  ORF1ab   \n",
       "1   ncbiprotein:NC_045512  Wuhan-Hu-1     2019-12-13  ORF1ab   \n",
       "2   ncbiprotein:NC_045512  Wuhan-Hu-1     2019-12-13  ORF1ab   \n",
       "3   ncbiprotein:NC_045512  Wuhan-Hu-1     2019-12-13  ORF1ab   \n",
       "4   ncbiprotein:NC_045512  Wuhan-Hu-1     2019-12-13  ORF1ab   \n",
       "5   ncbiprotein:NC_045512  Wuhan-Hu-1     2019-12-13  ORF1ab   \n",
       "6   ncbiprotein:NC_045512  Wuhan-Hu-1     2019-12-13  ORF1ab   \n",
       "7   ncbiprotein:NC_045512  Wuhan-Hu-1     2019-12-13  ORF1ab   \n",
       "8   ncbiprotein:NC_045512  Wuhan-Hu-1     2019-12-13  ORF1ab   \n",
       "9   ncbiprotein:NC_045512  Wuhan-Hu-1     2019-12-13  ORF1ab   \n",
       "10  ncbiprotein:NC_045512  Wuhan-Hu-1     2019-12-13  ORF1ab   \n",
       "11  ncbiprotein:NC_045512  Wuhan-Hu-1     2019-12-13  ORF1ab   \n",
       "12  ncbiprotein:NC_045512  Wuhan-Hu-1     2019-12-13  ORF1ab   \n",
       "13  ncbiprotein:NC_045512  Wuhan-Hu-1     2019-12-13  ORF1ab   \n",
       "14  ncbiprotein:NC_045512  Wuhan-Hu-1     2019-12-13  ORF1ab   \n",
       "15  ncbiprotein:NC_045512  Wuhan-Hu-1     2019-12-13  ORF1ab   \n",
       "16  ncbiprotein:NC_045512  Wuhan-Hu-1     2019-12-13  ORF1ab   \n",
       "17  ncbiprotein:NC_045512  Wuhan-Hu-1     2019-12-13  ORF1ab   \n",
       "18  ncbiprotein:NC_045512  Wuhan-Hu-1     2019-12-13       S   \n",
       "19  ncbiprotein:NC_045512  Wuhan-Hu-1     2019-12-13   ORF3a   \n",
       "20  ncbiprotein:NC_045512  Wuhan-Hu-1     2019-12-13       E   \n",
       "21  ncbiprotein:NC_045512  Wuhan-Hu-1     2019-12-13       M   \n",
       "22  ncbiprotein:NC_045512  Wuhan-Hu-1     2019-12-13    ORF6   \n",
       "23  ncbiprotein:NC_045512  Wuhan-Hu-1     2019-12-13   ORF7a   \n",
       "24  ncbiprotein:NC_045512  Wuhan-Hu-1     2019-12-13   ORF7b   \n",
       "25  ncbiprotein:NC_045512  Wuhan-Hu-1     2019-12-13    ORF8   \n",
       "26  ncbiprotein:NC_045512  Wuhan-Hu-1     2019-12-13       N   \n",
       "27  ncbiprotein:NC_045512  Wuhan-Hu-1     2019-12-13   ORF10   \n",
       "\n",
       "               geneId                        protein                protein_id  \n",
       "0   ncbigene:43740578                          nsp11  ncbiprotein:YP_009725312  \n",
       "1   ncbigene:43740578                           nsp4  ncbiprotein:YP_009725300  \n",
       "2   ncbigene:43740578                           nsp2  ncbiprotein:YP_009725298  \n",
       "3   ncbigene:43740578                       helicase  ncbiprotein:YP_009725308  \n",
       "4   ncbigene:43740578                          nsp10  ncbiprotein:YP_009725306  \n",
       "5   ncbigene:43740578  2'-O-ribose methyltransferase  ncbiprotein:YP_009725311  \n",
       "6   ncbigene:43740578                           nsp7  ncbiprotein:YP_009725303  \n",
       "7   ncbigene:43740578                      endoRNAse  ncbiprotein:YP_009725310  \n",
       "8   ncbigene:43740578              ORF1a polyprotein  ncbiprotein:YP_009725295  \n",
       "9   ncbigene:43740578   RNA-dependent RNA polymerase  ncbiprotein:YP_009725307  \n",
       "10  ncbigene:43740578             ORF1ab polyprotein  ncbiprotein:YP_009724389  \n",
       "11  ncbigene:43740578                           nsp6  ncbiprotein:YP_009725302  \n",
       "12  ncbigene:43740578                           nsp8  ncbiprotein:YP_009725304  \n",
       "13  ncbigene:43740578             3C-like proteinase  ncbiprotein:YP_009725301  \n",
       "14  ncbigene:43740578                           nsp3  ncbiprotein:YP_009725299  \n",
       "15  ncbigene:43740578           3'-to-5' exonuclease  ncbiprotein:YP_009725309  \n",
       "16  ncbigene:43740578                           nsp9  ncbiprotein:YP_009725305  \n",
       "17  ncbigene:43740578                 leader protein  ncbiprotein:YP_009725297  \n",
       "18  ncbigene:43740568           surface glycoprotein  ncbiprotein:YP_009724390  \n",
       "19  ncbigene:43740569                  ORF3a protein  ncbiprotein:YP_009724391  \n",
       "20  ncbigene:43740570               envelope protein  ncbiprotein:YP_009724392  \n",
       "21  ncbigene:43740571          membrane glycoprotein  ncbiprotein:YP_009724393  \n",
       "22  ncbigene:43740572                   ORF6 protein  ncbiprotein:YP_009724394  \n",
       "23  ncbigene:43740573                  ORF7a protein  ncbiprotein:YP_009724395  \n",
       "24  ncbigene:43740574                          ORF7b  ncbiprotein:YP_009725318  \n",
       "25  ncbigene:43740577                   ORF8 protein  ncbiprotein:YP_009724396  \n",
       "26  ncbigene:43740575    nucleocapsid phosphoprotein  ncbiprotein:YP_009724397  \n",
       "27  ncbigene:43740576                  ORF10 protein  ncbiprotein:YP_009725255  "
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (s:Strain)-[:HAS]->(g:Gene)-[:ENCODES]->(p:Protein)\n",
    "RETURN s.id as referenceGenome, s.name as name, s.collectionDate  as collectionDate, \n",
    "       g.name as gene, g.id as geneId, p.name as protein, p.id as protein_id \n",
    "ORDER by s.collectionDate\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Stopping Neo4j....... stopped\n"
     ]
    }
   ],
   "source": [
    "!\"$NEO4J_HOME\"/bin/neo4j stop"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Old queries need to be updated"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### List person demographics and strain information for California"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = \"\"\"\n",
    "# MATCH (a:Admin1)<-[:LOCATED_IN]-(p:Person)-[:CARRIES]->(s:Strain)\n",
    "# WHERE a.name = 'California'\n",
    "# RETURN p.age as age, p.sex as sex, p.exposure_location as exposure_location, s.name as strain, s.clade as clade\n",
    "# \"\"\"\n",
    "# graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Same query using parameterized Cypher\n",
    "Parameters to Cypher queries can be passed as key-value arguments. Parameters in Cypher are named and are wrapped in curly braces."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "# admin1 = 'California'\n",
    "\n",
    "# query = \"\"\"\n",
    "# MATCH (a:Admin1{name: {admin1}})<-[:LOCATED_IN]-(p:Person)-[:CARRIES]->(s:Strain)\n",
    "# RETURN p.age as age, p.sex as sex, p.exposure_location as exposure_location, \n",
    "#        s.name as strain, s.clade as clade, s.date as date\n",
    "# ORDER BY s.date\n",
    "# \"\"\"\n",
    "# graph.run(query, admin1=admin1).to_data_frame().head(100)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Where did clade A originate?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "# clade = 'A'\n",
    "\n",
    "# query = \"\"\"\n",
    "# MATCH (s:Strain)--(a:Country)\n",
    "# WHERE s.clade STARTS WITH {clade}\n",
    "# RETURN s.clade as clade, s.name, s.date, a.name\n",
    "# ORDER BY s.date\n",
    "# \"\"\"\n",
    "# graph.run(query, clade=clade).to_data_frame().head(100)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Find persons that imported the virus from another location"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = \"\"\"\n",
    "# MATCH (c:Admin1)<-[:LOCATED_IN]-(p:Person)-[:CARRIES]->(s:Strain)\n",
    "# WHERE c.name <> p.exposure_location\n",
    "# RETURN c.name as `state/province`, p.age as age, p.sex as sex, p.exposure_location as exposure_location, \n",
    "#        s.name as strain, s.clade as clade\n",
    "# ORDER BY p.exposure_location\n",
    "# \"\"\"\n",
    "# graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Strains in Sydney"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "# city = 'Sydney'\n",
    "\n",
    "# query = \"\"\"\n",
    "# MATCH (c:City{name: {city}})<-[:LOCATED_IN]-(p:Person)-[:CARRIES]->(s:Strain)\n",
    "# RETURN c.name as city, s.name as strain, s.clade as clade, p.exposure_location, s.date as date\n",
    "# ORDER BY s.date\n",
    "# \"\"\"\n",
    "# graph.run(query, city=city).to_data_frame()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
