{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Create local Neo4j Knowledge Graph (for testing)\n",
    "This notebook is provided to test creating a knowledge graph using a locally installed version of Neo4j.\n",
    "\n",
    "**Note, make sure that the Neo4j Browser has been shutdown before running this notebook.**\n",
    "\n",
    "The path `NEO4J_HOME` must be set to the Neo4j installation directory path.\n",
    "\n",
    "This notebook creates a local version of the knowledge graph by ingesting the .csv files in the Neo4j import directory `NEO4J_HOME/import`.\n",
    "\n",
    "Note: This notebook works only on Linux and Mac OS.\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import time\n",
    "from pathlib import Path"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "/Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-19636412-9e74-4bac-8a4c-c6c8b49bb9d3/installation-4.1.0\n"
     ]
    }
   ],
   "source": [
    "NEO4J_HOME = Path(os.getenv('NEO4J_HOME'))\n",
    "print(NEO4J_HOME)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Start Neo4j database\n",
    "\n",
    "**Note, make sure that the Neo4j Browser has been shutdown before running this notebook.**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Directories in use:\n",
      "  home:         /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-19636412-9e74-4bac-8a4c-c6c8b49bb9d3/installation-4.1.0\n",
      "  config:       /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-19636412-9e74-4bac-8a4c-c6c8b49bb9d3/installation-4.1.0/conf\n",
      "  logs:         /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-19636412-9e74-4bac-8a4c-c6c8b49bb9d3/installation-4.1.0/logs\n",
      "  plugins:      /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-19636412-9e74-4bac-8a4c-c6c8b49bb9d3/installation-4.1.0/plugins\n",
      "  import:       /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-19636412-9e74-4bac-8a4c-c6c8b49bb9d3/installation-4.1.0/import\n",
      "  data:         /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-19636412-9e74-4bac-8a4c-c6c8b49bb9d3/installation-4.1.0/data\n",
      "  certificates: /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-19636412-9e74-4bac-8a4c-c6c8b49bb9d3/installation-4.1.0/certificates\n",
      "  run:          /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-19636412-9e74-4bac-8a4c-c6c8b49bb9d3/installation-4.1.0/run\n",
      "Starting Neo4j.\n",
      "Started neo4j (pid 4594). It is available at http://localhost:7474/\n",
      "There may be a short delay until the server is ready.\n",
      "See /Users/peter/Library/Application Support/Neo4j Desktop/Application/neo4jDatabases/database-19636412-9e74-4bac-8a4c-c6c8b49bb9d3/installation-4.1.0/logs/neo4j.log for current status.\n",
      "['Neo4j is running at pid 4594']\n"
     ]
    }
   ],
   "source": [
    "status = !\"$NEO4J_HOME\"/bin/neo4j status\n",
    "while not 'Neo4j is running' in status:\n",
    "    !\"$NEO4J_HOME\"/bin/neo4j start\n",
    "    time.sleep(30)\n",
    "    status = !\"$NEO4J_HOME\"/bin/neo4j status\n",
    "    status = str(status)\n",
    "    print(status)\n",
    "\n",
    "# wait until neo4j is ready to receive requests\n",
    "time.sleep(60)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Run Cypher commands to create Knowledge Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "start = time.time()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Endpoint: bolt://localhost:7687\n",
      "Username: neo4j\n",
      "Password: neo4jbinder\n",
      " \n",
      "----------------------------------------------\n",
      "Running 00a-Init.cypher:\n",
      " \n",
      "// delete all nodes\n",
      "MATCH (n) DETACH DELETE n;\n",
      "\n",
      "// delete all constraints and indices\n",
      "CALL db.index.fulltext.drop('locations');\n",
      "CALL db.index.fulltext.drop('bioentities');\n",
      "CALL db.index.fulltext.drop('geoids');\n",
      "CALL apoc.schema.assert({},{}, true);\n",
      "                                                                                            \n",
      "// create constraints and indices\n",
      "CREATE CONSTRAINT location ON (n:Location) ASSERT n.id IS UNIQUE;\n",
      "CREATE INDEX location_n FOR (n:Location) ON (n.name);\n",
      "CREATE INDEX location_l FOR (n:Location) ON (n.location);\n",
      "CREATE CONSTRAINT world ON (n:World) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT unregion ON (n:UNRegion) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT unsubregion ON (n:UNSubRegion) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT unintermediateregion ON (n:UNIntermediateRegion) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT country ON (n:Country) ASSERT n.id IS UNIQUE;\n",
      "CREATE INDEX country_n FOR (n:Country) ON (n.name);\n",
      "CREATE INDEX country_g FOR (n:Country) ON (n.geonameId);\n",
      "CREATE INDEX country_l FOR (n:Country) ON (n.location);\n",
      "CREATE CONSTRAINT admin1 ON (n:Admin1) ASSERT n.id IS UNIQUE;\n",
      "CREATE INDEX admin1_n FOR (n:Admin1) ON (n.name);\n",
      "CREATE INDEX admin1_f FOR (n:Admin1) ON (n.fips);\n",
      "CREATE INDEX admin1_p FOR (n:Admin1) ON (n.parentId);\n",
      "CREATE INDEX admin1_g FOR (n:Admin1) ON (n.geonameId);\n",
      "CREATE INDEX admin1_l FOR (n:Admin1) ON (n.location);\n",
      "CREATE CONSTRAINT usregion ON (n:USRegion) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT usdivision ON (n:USDivision) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT admin2 ON (n:Admin2) ASSERT n.id IS UNIQUE;\n",
      "CREATE INDEX admin2_f FOR (n:Admin2) ON (n.fips);\n",
      "CREATE INDEX admin2_s FOR (n:Admin2) ON (n.stateFips);\n",
      "CREATE INDEX admin2_g FOR (n:Admin2) ON (n.geonameId);\n",
      "CREATE INDEX admin2_n FOR (n:Admin2) ON (n.name);\n",
      "CREATE INDEX admin2_l FOR (n:Admin2) ON (n.location);\n",
      "CREATE CONSTRAINT city ON (n:City) ASSERT n.id IS UNIQUE;\n",
      "CREATE INDEX city_n FOR (n:City) ON (n.name);\n",
      "CREATE INDEX city_l FOR (n:City) ON (n.location);\n",
      "CREATE INDEX city_g FOR (n:City) ON (n.geonameId);\n",
      "CREATE CONSTRAINT postalcode ON (n:PostalCode) ASSERT n.id IS UNIQUE;\n",
      "CREATE INDEX postalcode_n FOR (n:PostalCode) ON (n.name);\n",
      "CREATE INDEX postalcode_p FOR (n:PostalCode) ON (n.placeName);\n",
      "CREATE INDEX postalcode_l FOR (n:PostalCode) ON (n.location);\n",
      "CREATE CONSTRAINT tract ON (n:Tract) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT cruiseship ON (n:CruiseShip) ASSERT n.id IS UNIQUE;\n",
      "                                   \n",
      "CREATE CONSTRAINT organism ON (n:Organism) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT outbreak ON (n:Outbreak) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT publication ON (n:Publication) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT strain ON (n:Strain) ASSERT n.id IS UNIQUE;\n",
      "CREATE INDEX strain_n FOR (n:Strain) ON (n.name);\n",
      "CREATE CONSTRAINT variant ON (n:Variant) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT gene ON (n:Gene) ASSERT n.id IS UNIQUE;\n",
      "CREATE INDEX gene_a FOR (n:Gene) ON (n.genomeAccession);\n",
      "CREATE INDEX gene_s FOR (n:Gene) ON (n.start);\n",
      "CREATE INDEX gene_e FOR (n:Gene) ON (n.end);\n",
      "CREATE CONSTRAINT protein ON (n:Protein) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT proteinname ON (n:ProteinName) ASSERT n.id IS UNIQUE;\n",
      "CREATE INDEX proteinname_n FOR (n:ProteinName) ON (n.name);\n",
      "CREATE INDEX proteinname_a FOR (n:ProteinName) ON (n.accession);\n",
      "CREATE CONSTRAINT cases ON (n:Cases) ASSERT n.id IS UNIQUE;\n",
      "CREATE INDEX cases_d FOR (n:Cases) ON (n.date);\n",
      "CREATE INDEX cases_s FOR (n:Cases) ON (n.source);\n",
      "\n",
      "CREATE CONSTRAINT economics ON (n:Economics) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT employmentstatus ON (n:EmploymentStatus) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT income ON (n:Income) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT commuting ON (n:Commuting) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT occupation ON (n:Occupation) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT housing ON (n:Housing) ASSERT n.id IS UNIQUE;\n",
      "CREATE CONSTRAINT demographics ON (n:Demographics) ASSERT n.id IS UNIQUE;\n",
      "\n",
      "\n",
      "// create full text search indices\n",
      "CALL db.index.fulltext.createNodeIndex('locations',['World', 'UNRegion', 'UNSubRegion', 'UNIntermediateRegion', 'Country', 'Admin1', 'Admin2', 'USRegion', 'USDivision', 'City', 'CruiseShip', 'PostalCode','Tract'],['name', 'placeName', 'iso', 'iso3', 'fips', 'geonameId', 'code']);\n",
      "CALL db.index.fulltext.createNodeIndex('bioentities',['ProteinName', 'Protein', 'Gene', 'Strain', 'Variant', 'Organism', 'Outbreak'],['name', 'scientificName', 'taxonomyId', 'accession', 'proId', 'genomeAccession', 'geneVariant', 'proteinVariant', 'variantType', 'variantConsequence']);\n",
      "CALL db.index.fulltext.createNodeIndex('geoids',['UNRegion', 'UNSubRegion', 'UNIntermediateRegion', 'Country', 'Admin1', 'Admin2', 'USRegion', 'USDivision', 'City', 'PostalCode','Tract'],['id','iso', 'iso3', 'fips', 'geonameId','code','name'], {analyzer: 'keyword'});         \n",
      "\n",
      "\n",
      "\n",
      "// list constraints and indices\n",
      "CALL db.constraints();\n",
      "CALL db.indexes();label, key, keys, unique, action\n",
      "\"City\", \"name\", [\"name\"], FALSE, \"DROPPED\"\n",
      "\"City\", \"location\", [\"location\"], FALSE, \"DROPPED\"\n",
      "\"City\", \"geonameId\", [\"geonameId\"], FALSE, \"DROPPED\"\n",
      "\"PostalCode\", \"name\", [\"name\"], FALSE, \"DROPPED\"\n",
      "\"PostalCode\", \"placeName\", [\"placeName\"], FALSE, \"DROPPED\"\n",
      "\"PostalCode\", \"location\", [\"location\"], FALSE, \"DROPPED\"\n",
      "\"Strain\", \"name\", [\"name\"], FALSE, \"DROPPED\"\n",
      "\"Gene\", \"genomeAccession\", [\"genomeAccession\"], FALSE, \"DROPPED\"\n",
      "\"Gene\", \"start\", [\"start\"], FALSE, \"DROPPED\"\n",
      "\"Gene\", \"end\", [\"end\"], FALSE, \"DROPPED\"\n",
      "\"ProteinName\", \"name\", [\"name\"], FALSE, \"DROPPED\"\n",
      "\"ProteinName\", \"accession\", [\"accession\"], FALSE, \"DROPPED\"\n",
      "\"Cases\", \"date\", [\"date\"], FALSE, \"DROPPED\"\n",
      "\"Cases\", \"source\", [\"source\"], FALSE, \"DROPPED\"\n",
      "\"Location\", \"name\", [\"name\"], FALSE, \"DROPPED\"\n",
      "\"Location\", \"location\", [\"location\"], FALSE, \"DROPPED\"\n",
      "\"Country\", \"name\", [\"name\"], FALSE, \"DROPPED\"\n",
      "\"Country\", \"geonameId\", [\"geonameId\"], FALSE, \"DROPPED\"\n",
      "\"Country\", \"location\", [\"location\"], FALSE, \"DROPPED\"\n",
      "\"Admin1\", \"name\", [\"name\"], FALSE, \"DROPPED\"\n",
      "\"Admin1\", \"fips\", [\"fips\"], FALSE, \"DROPPED\"\n",
      "\"Admin1\", \"parentId\", [\"parentId\"], FALSE, \"DROPPED\"\n",
      "\"Admin1\", \"geonameId\", [\"geonameId\"], FALSE, \"DROPPED\"\n",
      "\"Admin1\", \"location\", [\"location\"], FALSE, \"DROPPED\"\n",
      "\"Admin2\", \"fips\", [\"fips\"], FALSE, \"DROPPED\"\n",
      "\"Admin2\", \"stateFips\", [\"stateFips\"], FALSE, \"DROPPED\"\n",
      "\"Admin2\", \"geonameId\", [\"geonameId\"], FALSE, \"DROPPED\"\n",
      "\"Admin2\", \"name\", [\"name\"], FALSE, \"DROPPED\"\n",
      "\"Admin2\", \"location\", [\"location\"], FALSE, \"DROPPED\"\n",
      "\"PostalCode\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"Outbreak\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"Gene\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"Economics\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"Occupation\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"UNSubRegion\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"USRegion\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"Tract\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"Publication\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"Protein\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"EmploymentStatus\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"Location\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"UNIntermediateRegion\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"USDivision\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"CruiseShip\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"Strain\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"ProteinName\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"Income\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"Demographics\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"World\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"Country\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"Admin2\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"City\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"Organism\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"Variant\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"Cases\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"Commuting\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"Housing\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"UNRegion\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "\"Admin1\", \"id\", [\"id\"], TRUE, \"DROPPED\"\n",
      "name, description, details\n",
      "\"admin1\", \"CONSTRAINT ON ( admin1:Admin1 ) ASSERT (admin1.id) IS UNIQUE\", \"Constraint( id=106, name='admin1', type='UNIQUENESS', schema=(:Admin1 {id}), ownedIndex=105 )\"\n",
      "\"admin2\", \"CONSTRAINT ON ( admin2:Admin2 ) ASSERT (admin2.id) IS UNIQUE\", \"Constraint( id=122, name='admin2', type='UNIQUENESS', schema=(:Admin2 {id}), ownedIndex=121 )\"\n",
      "\"cases\", \"CONSTRAINT ON ( cases:Cases ) ASSERT (cases.id) IS UNIQUE\", \"Constraint( id=38, name='cases', type='UNIQUENESS', schema=(:Cases {id}), ownedIndex=37 )\"\n",
      "\"city\", \"CONSTRAINT ON ( city:City ) ASSERT (city.id) IS UNIQUE\", \"Constraint( id=2, name='city', type='UNIQUENESS', schema=(:City {id}), ownedIndex=1 )\"\n",
      "\"commuting\", \"CONSTRAINT ON ( commuting:Commuting ) ASSERT (commuting.id) IS UNIQUE\", \"Constraint( id=48, name='commuting', type='UNIQUENESS', schema=(:Commuting {id}), ownedIndex=47 )\"\n",
      "\"country\", \"CONSTRAINT ON ( country:Country ) ASSERT (country.id) IS UNIQUE\", \"Constraint( id=101, name='country', type='UNIQUENESS', schema=(:Country {id}), ownedIndex=100 )\"\n",
      "\"cruiseship\", \"CONSTRAINT ON ( cruiseship:CruiseShip ) ASSERT (cruiseship.id) IS UNIQUE\", \"Constraint( id=14, name='cruiseship', type='UNIQUENESS', schema=(:CruiseShip {id}), ownedIndex=13 )\"\n",
      "\"demographics\", \"CONSTRAINT ON ( demographics:Demographics ) ASSERT (demographics.id) IS UNIQUE\", \"Constraint( id=54, name='demographics', type='UNIQUENESS', schema=(:Demographics {id}), ownedIndex=53 )\"\n",
      "\"economics\", \"CONSTRAINT ON ( economics:Economics ) ASSERT (economics.id) IS UNIQUE\", \"Constraint( id=42, name='economics', type='UNIQUENESS', schema=(:Economics {id}), ownedIndex=41 )\"\n",
      "\"employmentstatus\", \"CONSTRAINT ON ( employmentstatus:EmploymentStatus ) ASSERT (employmentstatus.id) IS UNIQUE\", \"Constraint( id=44, name='employmentstatus', type='UNIQUENESS', schema=(:EmploymentStatus {id}), ownedIndex=43 )\"\n",
      "\"gene\", \"CONSTRAINT ON ( gene:Gene ) ASSERT (gene.id) IS UNIQUE\", \"Constraint( id=27, name='gene', type='UNIQUENESS', schema=(:Gene {id}), ownedIndex=26 )\"\n",
      "\"housing\", \"CONSTRAINT ON ( housing:Housing ) ASSERT (housing.id) IS UNIQUE\", \"Constraint( id=52, name='housing', type='UNIQUENESS', schema=(:Housing {id}), ownedIndex=51 )\"\n",
      "\"income\", \"CONSTRAINT ON ( income:Income ) ASSERT (income.id) IS UNIQUE\", \"Constraint( id=46, name='income', type='UNIQUENESS', schema=(:Income {id}), ownedIndex=45 )\"\n",
      "\"location\", \"CONSTRAINT ON ( location:Location ) ASSERT (location.id) IS UNIQUE\", \"Constraint( id=89, name='location', type='UNIQUENESS', schema=(:Location {id}), ownedIndex=88 )\"\n",
      "\"occupation\", \"CONSTRAINT ON ( occupation:Occupation ) ASSERT (occupation.id) IS UNIQUE\", \"Constraint( id=50, name='occupation', type='UNIQUENESS', schema=(:Occupation {id}), ownedIndex=49 )\"\n",
      "\"organism\", \"CONSTRAINT ON ( organism:Organism ) ASSERT (organism.id) IS UNIQUE\", \"Constraint( id=16, name='organism', type='UNIQUENESS', schema=(:Organism {id}), ownedIndex=15 )\"\n",
      "\"outbreak\", \"CONSTRAINT ON ( outbreak:Outbreak ) ASSERT (outbreak.id) IS UNIQUE\", \"Constraint( id=18, name='outbreak', type='UNIQUENESS', schema=(:Outbreak {id}), ownedIndex=17 )\"\n",
      "\"postalcode\", \"CONSTRAINT ON ( postalcode:PostalCode ) ASSERT (postalcode.id) IS UNIQUE\", \"Constraint( id=7, name='postalcode', type='UNIQUENESS', schema=(:PostalCode {id}), ownedIndex=6 )\"\n",
      "\"protein\", \"CONSTRAINT ON ( protein:Protein ) ASSERT (protein.id) IS UNIQUE\", \"Constraint( id=32, name='protein', type='UNIQUENESS', schema=(:Protein {id}), ownedIndex=31 )\"\n",
      "\"proteinname\", \"CONSTRAINT ON ( proteinname:ProteinName ) ASSERT (proteinname.id) IS UNIQUE\", \"Constraint( id=34, name='proteinname', type='UNIQUENESS', schema=(:ProteinName {id}), ownedIndex=33 )\"\n",
      "\"publication\", \"CONSTRAINT ON ( publication:Publication ) ASSERT (publication.id) IS UNIQUE\", \"Constraint( id=20, name='publication', type='UNIQUENESS', schema=(:Publication {id}), ownedIndex=19 )\"\n",
      "\"strain\", \"CONSTRAINT ON ( strain:Strain ) ASSERT (strain.id) IS UNIQUE\", \"Constraint( id=22, name='strain', type='UNIQUENESS', schema=(:Strain {id}), ownedIndex=21 )\"\n",
      "\"tract\", \"CONSTRAINT ON ( tract:Tract ) ASSERT (tract.id) IS UNIQUE\", \"Constraint( id=12, name='tract', type='UNIQUENESS', schema=(:Tract {id}), ownedIndex=11 )\"\n",
      "\"unintermediateregion\", \"CONSTRAINT ON ( unintermediateregion:UNIntermediateRegion ) ASSERT (unintermediateregion.id) IS UNIQUE\", \"Constraint( id=99, name='unintermediateregion', type='UNIQUENESS', schema=(:UNIntermediateRegion {id}), ownedIndex=98 )\"\n",
      "\"unregion\", \"CONSTRAINT ON ( unregion:UNRegion ) ASSERT (unregion.id) IS UNIQUE\", \"Constraint( id=95, name='unregion', type='UNIQUENESS', schema=(:UNRegion {id}), ownedIndex=94 )\"\n",
      "\"unsubregion\", \"CONSTRAINT ON ( unsubregion:UNSubRegion ) ASSERT (unsubregion.id) IS UNIQUE\", \"Constraint( id=97, name='unsubregion', type='UNIQUENESS', schema=(:UNSubRegion {id}), ownedIndex=96 )\"\n",
      "\"usdivision\", \"CONSTRAINT ON ( usdivision:USDivision ) ASSERT (usdivision.id) IS UNIQUE\", \"Constraint( id=120, name='usdivision', type='UNIQUENESS', schema=(:USDivision {id}), ownedIndex=119 )\"\n",
      "\"usregion\", \"CONSTRAINT ON ( usregion:USRegion ) ASSERT (usregion.id) IS UNIQUE\", \"Constraint( id=113, name='usregion', type='UNIQUENESS', schema=(:USRegion {id}), ownedIndex=112 )\"\n",
      "\"variant\", \"CONSTRAINT ON ( variant:Variant ) ASSERT (variant.id) IS UNIQUE\", \"Constraint( id=25, name='variant', type='UNIQUENESS', schema=(:Variant {id}), ownedIndex=24 )\"\n",
      "\"world\", \"CONSTRAINT ON ( world:World ) ASSERT (world.id) IS UNIQUE\", \"Constraint( id=93, name='world', type='UNIQUENESS', schema=(:World {id}), ownedIndex=92 )\"\n",
      "id, name, state, populationPercent, uniqueness, type, entityType, labelsOrTypes, properties, provider\n",
      "105, \"admin1\", \"ONLINE\", 100.0, \"UNIQUE\", \"BTREE\", \"NODE\", [\"Admin1\"], [\"id\"], \"native-btree-1.0\"\n",
      "108, \"admin1_f\", \"ONLINE\", 100.0, \"NONUNIQUE\", \"BTREE\", \"NODE\", [\"Admin1\"], [\"fips\"], \"native-btree-1.0\"\n",
      "110, \"admin1_g\", \"ONLINE\", 100.0, \"NONUNIQUE\", \"BTREE\", \"NODE\", [\"Admin1\"], [\"geonameId\"], \"native-btree-1.0\"\n",
      "111, \"admin1_l\", \"ONLINE\", 100.0, \"NONUNIQUE\", \"BTREE\", \"NODE\", [\"Admin1\"], [\"location\"], \"native-btree-1.0\"\n",
      "107, \"admin1_n\", \"ONLINE\", 100.0, \"NONUNIQUE\", \"BTREE\", \"NODE\", [\"Admin1\"], [\"name\"], \"native-btree-1.0\"\n",
      "109, \"admin1_p\", \"ONLINE\", 100.0, \"NONUNIQUE\", \"BTREE\", \"NODE\", [\"Admin1\"], [\"parentId\"], \"native-btree-1.0\"\n",
      "121, \"admin2\", \"ONLINE\", 100.0, \"UNIQUE\", \"BTREE\", \"NODE\", [\"Admin2\"], [\"id\"], \"native-btree-1.0\"\n",
      "123, \"admin2_f\", \"ONLINE\", 100.0, \"NONUNIQUE\", \"BTREE\", \"NODE\", [\"Admin2\"], [\"fips\"], \"native-btree-1.0\"\n",
      "125, \"admin2_g\", \"ONLINE\", 100.0, \"NONUNIQUE\", \"BTREE\", \"NODE\", [\"Admin2\"], [\"geonameId\"], \"native-btree-1.0\"\n",
      "127, \"admin2_l\", \"ONLINE\", 100.0, \"NONUNIQUE\", \"BTREE\", \"NODE\", [\"Admin2\"], [\"location\"], \"native-btree-1.0\"\n",
      "126, \"admin2_n\", \"ONLINE\", 100.0, \"NONUNIQUE\", \"BTREE\", \"NODE\", [\"Admin2\"], [\"name\"], \"native-btree-1.0\"\n",
      "124, \"admin2_s\", \"ONLINE\", 100.0, \"NONUNIQUE\", \"BTREE\", \"NODE\", [\"Admin2\"], [\"stateFips\"], \"native-btree-1.0\"\n",
      "56, \"bioentities\", \"ONLINE\", 100.0, \"NONUNIQUE\", \"FULLTEXT\", \"NODE\", [\"ProteinName\", \"Protein\", \"Gene\", \"Strain\", \"Variant\", \"Organism\", \"Outbreak\"], [\"name\", \"scientificName\", \"taxonomyId\", \"accession\", \"proId\", \"genomeAccession\", \"geneVariant\", \"proteinVariant\", \"variantType\", \"variantConsequence\"], \"fulltext-1.0\"\n",
      "37, \"cases\", \"ONLINE\", 100.0, \"UNIQUE\", \"BTREE\", \"NODE\", [\"Cases\"], [\"id\"], \"native-btree-1.0\"\n",
      "39, \"cases_d\", \"ONLINE\", 100.0, \"NONUNIQUE\", \"BTREE\", \"NODE\", [\"Cases\"], [\"date\"], \"native-btree-1.0\"\n",
      "40, \"cases_s\", \"ONLINE\", 100.0, \"NONUNIQUE\", \"BTREE\", \"NODE\", [\"Cases\"], [\"source\"], \"native-btree-1.0\"\n",
      "1, \"city\", \"ONLINE\", 100.0, \"UNIQUE\", \"BTREE\", \"NODE\", [\"City\"], [\"id\"], \"native-btree-1.0\"\n",
      "5, \"city_g\", \"ONLINE\", 100.0, \"NONUNIQUE\", \"BTREE\", \"NODE\", [\"City\"], [\"geonameId\"], \"native-btree-1.0\"\n",
      "4, \"city_l\", \"ONLINE\", 100.0, \"NONUNIQUE\", \"BTREE\", \"NODE\", [\"City\"], [\"location\"], \"native-btree-1.0\"\n",
      "3, \"city_n\", \"ONLINE\", 100.0, \"NONUNIQUE\", \"BTREE\", \"NODE\", [\"City\"], [\"name\"], \"native-btree-1.0\"\n",
      "47, \"commuting\", \"ONLINE\", 100.0, \"UNIQUE\", \"BTREE\", \"NODE\", [\"Commuting\"], [\"id\"], \"native-btree-1.0\"\n",
      "100, \"country\", \"ONLINE\", 100.0, \"UNIQUE\", \"BTREE\", \"NODE\", [\"Country\"], [\"id\"], \"native-btree-1.0\"\n",
      "103, \"country_g\", \"ONLINE\", 100.0, \"NONUNIQUE\", \"BTREE\", \"NODE\", [\"Country\"], [\"geonameId\"], \"native-btree-1.0\"\n",
      "104, \"country_l\", \"ONLINE\", 100.0, \"NONUNIQUE\", \"BTREE\", \"NODE\", [\"Country\"], [\"location\"], \"native-btree-1.0\"\n",
      "102, \"country_n\", \"ONLINE\", 100.0, \"NONUNIQUE\", \"BTREE\", \"NODE\", [\"Country\"], [\"name\"], \"native-btree-1.0\"\n",
      "13, \"cruiseship\", \"ONLINE\", 100.0, \"UNIQUE\", \"BTREE\", \"NODE\", [\"CruiseShip\"], [\"id\"], \"native-btree-1.0\"\n",
      "53, \"demographics\", \"ONLINE\", 100.0, \"UNIQUE\", \"BTREE\", \"NODE\", [\"Demographics\"], [\"id\"], \"native-btree-1.0\"\n",
      "41, \"economics\", \"ONLINE\", 100.0, \"UNIQUE\", \"BTREE\", \"NODE\", [\"Economics\"], [\"id\"], \"native-btree-1.0\"\n",
      "43, \"employmentstatus\", \"ONLINE\", 100.0, \"UNIQUE\", \"BTREE\", \"NODE\", [\"EmploymentStatus\"], [\"id\"], \"native-btree-1.0\"\n",
      "26, \"gene\", \"ONLINE\", 100.0, \"UNIQUE\", \"BTREE\", \"NODE\", [\"Gene\"], [\"id\"], \"native-btree-1.0\"\n",
      "28, \"gene_a\", \"ONLINE\", 100.0, \"NONUNIQUE\", \"BTREE\", \"NODE\", [\"Gene\"], [\"genomeAccession\"], \"native-btree-1.0\"\n",
      "30, \"gene_e\", \"ONLINE\", 100.0, \"NONUNIQUE\", \"BTREE\", \"NODE\", [\"Gene\"], [\"end\"], \"native-btree-1.0\"\n",
      "29, \"gene_s\", \"ONLINE\", 100.0, \"NONUNIQUE\", \"BTREE\", \"NODE\", [\"Gene\"], [\"start\"], \"native-btree-1.0\"\n",
      "57, \"geoids\", \"ONLINE\", 100.0, \"NONUNIQUE\", \"FULLTEXT\", \"NODE\", [\"UNRegion\", \"UNSubRegion\", \"UNIntermediateRegion\", \"Country\", \"Admin1\", \"Admin2\", \"USRegion\", \"USDivision\", \"City\", \"PostalCode\", \"Tract\"], [\"id\", \"iso\", \"iso3\", \"fips\", \"geonameId\", \"code\", \"name\"], \"fulltext-1.0\"\n",
      "51, \"housing\", \"ONLINE\", 100.0, \"UNIQUE\", \"BTREE\", \"NODE\", [\"Housing\"], [\"id\"], \"native-btree-1.0\"\n",
      "45, \"income\", \"ONLINE\", 100.0, \"UNIQUE\", \"BTREE\", \"NODE\", [\"Income\"], [\"id\"], \"native-btree-1.0\"\n",
      "88, \"location\", \"ONLINE\", 100.0, \"UNIQUE\", \"BTREE\", \"NODE\", [\"Location\"], [\"id\"], \"native-btree-1.0\"\n",
      "91, \"location_l\", \"ONLINE\", 100.0, \"NONUNIQUE\", \"BTREE\", \"NODE\", [\"Location\"], [\"location\"], \"native-btree-1.0\"\n",
      "90, \"location_n\", \"ONLINE\", 100.0, \"NONUNIQUE\", \"BTREE\", \"NODE\", [\"Location\"], [\"name\"], \"native-btree-1.0\"\n",
      "55, \"locations\", \"ONLINE\", 100.0, \"NONUNIQUE\", \"FULLTEXT\", \"NODE\", [\"World\", \"UNRegion\", \"UNSubRegion\", \"UNIntermediateRegion\", \"Country\", \"Admin1\", \"Admin2\", \"USRegion\", \"USDivision\", \"City\", \"CruiseShip\", \"PostalCode\", \"Tract\"], [\"name\", \"placeName\", \"iso\", \"iso3\", \"fips\", \"geonameId\", \"code\"], \"fulltext-1.0\"\n",
      "49, \"occupation\", \"ONLINE\", 100.0, \"UNIQUE\", \"BTREE\", \"NODE\", [\"Occupation\"], [\"id\"], \"native-btree-1.0\"\n",
      "15, \"organism\", \"ONLINE\", 100.0, \"UNIQUE\", \"BTREE\", \"NODE\", [\"Organism\"], [\"id\"], \"native-btree-1.0\"\n",
      "17, \"outbreak\", \"ONLINE\", 100.0, \"UNIQUE\", \"BTREE\", \"NODE\", [\"Outbreak\"], [\"id\"], \"native-btree-1.0\"\n",
      "6, \"postalcode\", \"ONLINE\", 100.0, \"UNIQUE\", \"BTREE\", \"NODE\", [\"PostalCode\"], [\"id\"], \"native-btree-1.0\"\n",
      "10, \"postalcode_l\", \"ONLINE\", 100.0, \"NONUNIQUE\", \"BTREE\", \"NODE\", [\"PostalCode\"], [\"location\"], \"native-btree-1.0\"\n",
      "8, \"postalcode_n\", \"ONLINE\", 100.0, \"NONUNIQUE\", \"BTREE\", \"NODE\", [\"PostalCode\"], [\"name\"], \"native-btree-1.0\"\n",
      "9, \"postalcode_p\", \"ONLINE\", 100.0, \"NONUNIQUE\", \"BTREE\", \"NODE\", [\"PostalCode\"], [\"placeName\"], \"native-btree-1.0\"\n",
      "31, \"protein\", \"ONLINE\", 100.0, \"UNIQUE\", \"BTREE\", \"NODE\", [\"Protein\"], [\"id\"], \"native-btree-1.0\"\n",
      "33, \"proteinname\", \"ONLINE\", 100.0, \"UNIQUE\", \"BTREE\", \"NODE\", [\"ProteinName\"], [\"id\"], \"native-btree-1.0\"\n",
      "36, \"proteinname_a\", \"ONLINE\", 100.0, \"NONUNIQUE\", \"BTREE\", \"NODE\", [\"ProteinName\"], [\"accession\"], \"native-btree-1.0\"\n",
      "35, \"proteinname_n\", \"ONLINE\", 100.0, \"NONUNIQUE\", \"BTREE\", \"NODE\", [\"ProteinName\"], [\"name\"], \"native-btree-1.0\"\n",
      "19, \"publication\", \"ONLINE\", 100.0, \"UNIQUE\", \"BTREE\", \"NODE\", [\"Publication\"], [\"id\"], \"native-btree-1.0\"\n",
      "21, \"strain\", \"ONLINE\", 100.0, \"UNIQUE\", \"BTREE\", \"NODE\", [\"Strain\"], [\"id\"], \"native-btree-1.0\"\n",
      "23, \"strain_n\", \"ONLINE\", 100.0, \"NONUNIQUE\", \"BTREE\", \"NODE\", [\"Strain\"], [\"name\"], \"native-btree-1.0\"\n",
      "11, \"tract\", \"ONLINE\", 100.0, \"UNIQUE\", \"BTREE\", \"NODE\", [\"Tract\"], [\"id\"], \"native-btree-1.0\"\n",
      "98, \"unintermediateregion\", \"ONLINE\", 100.0, \"UNIQUE\", \"BTREE\", \"NODE\", [\"UNIntermediateRegion\"], [\"id\"], \"native-btree-1.0\"\n",
      "94, \"unregion\", \"ONLINE\", 100.0, \"UNIQUE\", \"BTREE\", \"NODE\", [\"UNRegion\"], [\"id\"], \"native-btree-1.0\"\n",
      "96, \"unsubregion\", \"ONLINE\", 100.0, \"UNIQUE\", \"BTREE\", \"NODE\", [\"UNSubRegion\"], [\"id\"], \"native-btree-1.0\"\n",
      "119, \"usdivision\", \"ONLINE\", 100.0, \"UNIQUE\", \"BTREE\", \"NODE\", [\"USDivision\"], [\"id\"], \"native-btree-1.0\"\n",
      "112, \"usregion\", \"ONLINE\", 100.0, \"UNIQUE\", \"BTREE\", \"NODE\", [\"USRegion\"], [\"id\"], \"native-btree-1.0\"\n",
      "24, \"variant\", \"ONLINE\", 100.0, \"UNIQUE\", \"BTREE\", \"NODE\", [\"Variant\"], [\"id\"], \"native-btree-1.0\"\n",
      "92, \"world\", \"ONLINE\", 100.0, \"UNIQUE\", \"BTREE\", \"NODE\", [\"World\"], [\"id\"], \"native-btree-1.0\"\n",
      " \n",
      "----------------------------------------------\n",
      "Running 00b-Organism.cypher:\n",
      " \n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///Organism.csv' AS row \n",
      "WITH row WHERE row.type='Host'\n",
      "MERGE (h:Host{id: row.id})\n",
      "SET h.name = row.name, h.scientificName = row.scientificName\n",
      "RETURN count(h) as Host\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///Organism.csv' AS row \n",
      "WITH row WHERE row.type='Pathogen'\n",
      "MERGE (p:Pathogen{id: row.id})\n",
      "SET p.name = row.name, p.scientificName = row.scientificName\n",
      "RETURN count(p) as Pathogen\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///Organism.csv' AS row \n",
      "MERGE (o:Organism{id: row.id})\n",
      "SET o.name = row.name, o.scientificName = row.scientificName, o.type = row.type\n",
      "RETURN count(o) as Organism\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///Organism.csv' AS row \n",
      "WITH row WHERE row.type='Host'\n",
      "MATCH (h:Host{id: row.id})\n",
      "MATCH (o:Organism{id: row.id})\n",
      "MERGE (h)-[i:IS_A]->(o)\n",
      "RETURN count(i) as IS_A\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///Organism.csv' AS row \n",
      "WITH row WHERE row.type='Pathogen'\n",
      "MATCH (p:Pathogen{id: row.id})\n",
      "MATCH (o:Organism{id: row.id})\n",
      "MERGE (p)-[i:IS_A]->(o)\n",
      "RETURN count(i) as IS_A\n",
      ";\n",
      "\n",
      "Host\n",
      "11\n",
      "Pathogen\n",
      "3\n",
      "Organism\n",
      "14\n",
      "IS_A\n",
      "11\n",
      "IS_A\n",
      "3\n",
      " \n",
      "----------------------------------------------\n",
      "Running 00c-Outbreak.cypher:\n",
      " \n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///Outbreak.csv' AS row \n",
      "MERGE (o:Outbreak{id: row.id})\n",
      "SET o.name = row.id, o.startDate = row.startDate, o.pathogen = row.pathogen\n",
      "RETURN count(o) as Outbreak\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///Outbreak.csv' AS row \n",
      "MATCH (p:Pathogen{id: row.pathogen})\n",
      "MATCH (o:Outbreak{id: row.id})\n",
      "MERGE(p)-[c:CAUSES]->(o)\n",
      "RETURN count(c) as CAUSES\n",
      ";\n",
      "                    \n",
      "Outbreak\n",
      "3\n",
      "CAUSES\n",
      "3\n",
      " \n",
      "----------------------------------------------\n",
      "Running 00e-GeoNamesCountry.cypher:\n",
      " \n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00e-GeoNamesCountry.csv' AS row \n",
      "MERGE (c:Country:Location{id: row.id})\n",
      "SET c.name = row.name, c.iso = row.iso, c.iso3 = row.iso3, c.isoNumeric = row.isoNumeric, c.geonameId = row.geonameId, c.areaSqKm = toInteger(row.areaSqKm), c.population = toInteger(row.population),\n",
      "c.location = point({longitude: toFloat(row.longitude), latitude: toFloat(row.latitude)})\n",
      "RETURN count(c) as Country\n",
      ";\n",
      "Country\n",
      "252\n",
      " \n",
      "----------------------------------------------\n",
      "Running 00f-GeoNamesAdmin1.cypher:\n",
      " \n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00f-GeoNamesAdmin1.csv' AS row \n",
      "MERGE (a:Admin1:Location{id: row.id})\n",
      "SET a.name = row.name, a.code = row.code, a.country = row.parentId, a.geonameId = row.geonameId, a.population = toInteger(row.population), a.elevation = toInteger(row.elevation),\n",
      "a.location = point({longitude: toFloat(row.longitude), latitude: toFloat(row.latitude)})\n",
      "RETURN count(a) as Admin1\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00f-GeoNamesAdmin1.csv' AS row \n",
      "MATCH (a:Admin1{id: row.id})\n",
      "MATCH (ct:Country{id: row.parentId})\n",
      "MERGE (a)-[i:IN]->(ct)\n",
      "RETURN count(i) as IN\n",
      ";\n",
      "Admin1\n",
      "3933\n",
      "IN\n",
      "3919\n",
      " \n",
      "----------------------------------------------\n",
      "Running 00g-GeoNamesAdmin2.cypher:\n",
      " \n",
      "USING PERIODIC COMMIT 500\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00g-GeoNamesAdmin2.csv' AS row \n",
      "MERGE (a:Admin2:Location{id: row.id})\n",
      "SET a.name = row.name, a.parentId = row.parentId, a.geonameId = row.geonameId, a.population = toInteger(row.population), a.elevation = toInteger(row.elevation),\n",
      "a.location = point({longitude: toFloat(row.longitude), latitude: toFloat(row.latitude)})\n",
      "RETURN count(a) as Admin2\n",
      ";\n",
      "USING PERIODIC COMMIT 500\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00g-GeoNamesAdmin2.csv' AS row \n",
      "MATCH (a2:Admin2{id: row.id})\n",
      "MATCH (a1:Admin1{id: row.parentId})\n",
      "MERGE (a2)-[i:IN]->(a1)\n",
      "RETURN count(i) as IN\n",
      ";\n",
      "Admin2\n",
      "44786\n",
      "IN\n",
      "44766\n",
      " \n",
      "----------------------------------------------\n",
      "Running 00h-GeoNamesCity.cypher:\n",
      " \n",
      "USING PERIODIC COMMIT 500\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00h-GeoNamesCity.csv' AS row \n",
      "MERGE (c:City:Location{id: row.id})\n",
      "SET c.name = row.name, c.geonameId = row.geonameId, c.population = toInteger(row.population), c.elevation = toInteger(row.elevation),\n",
      "c.location = point({longitude: toFloat(row.longitude), latitude: toFloat(row.latitude)})\n",
      "RETURN count(c) as City\n",
      ";\n",
      "USING PERIODIC COMMIT 500\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00h-GeoNamesCity.csv' AS row \n",
      "MATCH (l:Location{id: row.parentId})\n",
      "MATCH (c:City{id: row.id})\n",
      "MERGE (c)-[i:IN]->(l)\n",
      "RETURN count(i) as IN\n",
      ";\n",
      "City\n",
      "137434\n",
      "IN\n",
      "133484\n",
      " \n",
      "----------------------------------------------\n",
      "Running 00i-USCensusRegionDivisionState2017.cypher:\n",
      " \n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00i-USCensus2017Region.csv' AS row \n",
      "MERGE (r:USRegion:Location{id: row.id})\n",
      "SET r.name = row.name\n",
      "RETURN count(r) as Region\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00i-USCensus2017Division.csv' AS row \n",
      "MERGE (d:USDivision:Location{id: row.id})\n",
      "SET d.name = row.name\n",
      "RETURN count(d) as Division\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00i-USCensus2017State.csv' AS row \n",
      "MATCH (a:Admin1{name: row.name, country: 'US'})\n",
      "SET a.fips = row.fips, a.division = row.division\n",
      "RETURN count(a) as FIPS\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00i-USCensus2017Region.csv' AS row \n",
      "MATCH (r:USRegion{id: row.id})\n",
      "MATCH (c:Country{id: row.parentId})\n",
      "MERGE (r)-[i:IN]->(c)\n",
      "RETURN count(i) as IN\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00i-USCensus2017Division.csv' AS row \n",
      "MATCH (d:USDivision{id: row.id})\n",
      "MATCH (r:USRegion{id: row.parentId})\n",
      "MERGE (d)-[i:IN]->(r)\n",
      "RETURN count(i) as IN\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00i-USCensus2017State.csv' AS row \n",
      "MATCH (a:Admin1{name: row.name, country: 'US'})\n",
      "MATCH (d:USDivision{id: row.parentId})\n",
      "MERGE (a)-[i:IN]->(d)\n",
      "RETURN count(i) as IN\n",
      ";\n",
      "\n",
      "Region\n",
      "4\n",
      "Division\n",
      "9\n",
      "FIPS\n",
      "51\n",
      "IN\n",
      "4\n",
      "IN\n",
      "9\n",
      "IN\n",
      "51\n",
      " \n",
      "----------------------------------------------\n",
      "Running 00j-USCensusCountyCity2017.cypher:\n",
      " \n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00j-USCensus2017County.csv' AS row \n",
      "MATCH (a:Admin2)-[:IN]->(a1:Admin1{fips: row.stateFips})\n",
      "WHERE a.id STARTS WITH 'US.' AND a.id ENDS WITH row.fips\n",
      "SET a.fips = row.fips, a.stateFips = row.stateFips\n",
      "RETURN count(a) as Admin2_Fips\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00j-USCensus2017City.csv' AS row \n",
      "MATCH (c:City{name: row.name})-[:IN]->(:Admin2)-[:IN]->(a1:Admin1{fips: row.stateFips})\n",
      "SET c.fips = row.fips, c.stateFips = row.stateFips\n",
      "RETURN count(c) as City_Fips\n",
      ";\n",
      "Admin2_Fips\n",
      "3142\n",
      "City_Fips\n",
      "8356\n",
      " \n",
      "----------------------------------------------\n",
      "Running 00k-UNRegion.cypher:\n",
      " \n",
      "MERGE (w:World:Location{id: \"m49:1\"})\n",
      "SET w.name = \"World\"\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00k-UNAll.csv' AS row\n",
      "MERGE (r:UNRegion:Location{id: row.UNRegionCode})\n",
      "SET r.name = row.UNRegion\n",
      "RETURN count(r) as UNRegion\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00k-UNAll.csv' AS row \n",
      "WITH row WHERE NOT row.UNSubRegion IS null\n",
      "MERGE (s:UNSubRegion:Location{id: row.UNSubRegionCode})\n",
      "SET s.name = row.UNSubRegion\n",
      "RETURN count(s) as UNSubRegion\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00k-UNAll.csv' AS row\n",
      "WITH row WHERE NOT row.UNIntermediateRegion IS null\n",
      "MERGE (n:UNIntermediateRegion:Location{id: row.UNIntermediateRegionCode})\n",
      "SET n.name = row.UNIntermediateRegion\n",
      "RETURN count(n) as UNIntermediateRegion\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00k-UNAll.csv' AS row \n",
      "MATCH (r:UNRegion{id: row.UNRegionCode})\n",
      "MATCH (w:World{id: \"m49:1\"})\n",
      "MERGE (r)-[i:IN]->(w)\n",
      "RETURN count(i) as IN\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00k-UNAll.csv' AS row\n",
      "WITH row WHERE NOT row.UNSubRegion IS null\n",
      "MATCH (s:UNSubRegion{id: row.UNSubRegionCode})\n",
      "MATCH (r:UNRegion{id: row.UNRegionCode})\n",
      "MERGE (s)-[i:IN]->(r)\n",
      "RETURN count(i) as IN\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00k-UNAll.csv' AS row \n",
      "WITH row WHERE NOT row.UNIntermediateRegion IS null\n",
      "MATCH (n:UNIntermediateRegion{id: row.UNIntermediateRegionCode})\n",
      "MATCH (s:UNSubRegion{id: row.UNSubRegionCode})\n",
      "MERGE (n)-[i:IN]->(s)\n",
      "RETURN count(i) as IN\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00k-UNRegion.csv' AS row \n",
      "MATCH (c:Country{iso3: row.iso3})\n",
      "MATCH (r:UNRegion{id: row.UNRegionCode})\n",
      "MERGE (c)-[i:IN]->(r)\n",
      "RETURN count(i) as IN\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00k-UNSubRegion.csv' AS row \n",
      "MATCH (c:Country{iso3: row.iso3})\n",
      "MATCH (s:UNSubRegion{id: row.UNSubRegionCode})\n",
      "MERGE (c)-[i:IN]->(s)\n",
      "RETURN count(i) as IN\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00k-UNIntermediateRegion.csv' AS row \n",
      "MATCH (c:Country{iso3: row.iso3})\n",
      "MATCH (n:UNIntermediateRegion{id: row.UNIntermediateRegionCode})\n",
      "MERGE(c)-[i:IN]->(n)\n",
      "RETURN count(i) as IN\n",
      ";\n",
      "                                        \n",
      "\n",
      "UNRegion\n",
      "255\n",
      "UNSubRegion\n",
      "254\n",
      "UNIntermediateRegion\n",
      "107\n",
      "IN\n",
      "255\n",
      "IN\n",
      "254\n",
      "IN\n",
      "107\n",
      "IN\n",
      "1\n",
      "IN\n",
      "146\n",
      "IN\n",
      "107\n",
      " \n",
      "----------------------------------------------\n",
      "Running 00m-USHUDCrosswalk.cypher:\n",
      " \n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00m-USHUDCrosswalkZipToCounty2020Q1.csv' AS row\n",
      "// adding zip to avoid conflicts with other location ids\n",
      "MERGE (p:PostalCode:Location{id: 'zip' + row.zip})\n",
      "SET p.name = row.zip\n",
      "RETURN count(p) as PostalCode\n",
      ";\n",
      "// Note, one Zip code can overlap with multiple counties (Admin2s), e.g. Zip 21771 -> 4 counties\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00m-USHUDCrosswalkZipToCounty2020Q1.csv' AS row\n",
      "MATCH (p:PostalCode{id: 'zip' + row.zip})\n",
      "MATCH (a:Admin2{fips: row.countyFips, stateFips: row.stateFips})\n",
      "MERGE (p)-[i:IN]->(a)\n",
      "// Adding these properties on the server takes too long (never completes?)\n",
      "// MERGE (p)-[i:IN{id: 'zip_to_admin2-' + row.zip + '-' + row.countyFips}]->(a)\n",
      "// SET i.resRatio = toFloat(row.resRatio), i.busRatio = toFloat(row.busRatio), i.othRatio = toFloat(row.othRatio), i.totRatio = toFloat(row.totRatio)\n",
      "RETURN count(i) as IN_ADMIN2\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00m-USHUDCrosswalkZipToTract2020Q1.csv' AS row\n",
      "// adding tract to avoid conflicts with other location ids\n",
      "MERGE (t:Tract:Location{id: 'tract' + row.tract})\n",
      "SET t.name = row.tract\n",
      "RETURN count(t) as Tract\n",
      ";\n",
      "// Note, one Zip code can overlap with multiple Census Tracts\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00m-USHUDCrosswalkZipToTract2020Q1.csv' AS row\n",
      "MATCH (p:PostalCode{id: 'zip' + row.zip})\n",
      "MATCH (t:Tract{id: 'tract' + row.tract})\n",
      "MERGE (t)-[i:IN]->(p)\n",
      "// Adding these properties on the server takes too long (never completes?)\n",
      "// MERGE (t)-[i:IN{id: 'zip_to_tract-' + row.zip + '-' + row.tract}]->(p)\n",
      "// Adding these properties on the server takes too long (never completes?)\n",
      "// SET i.resRatio = toFloat(row.resRatio), i.busRatio = toFloat(row.busRatio), i.othRatio = toFloat(row.othRatio), i.totRatio = toFloat(row.totRatio)\n",
      "RETURN count(i) as IN_TRACT\n",
      ";\n",
      "// Most tracts are defined in 00m-USHUDCrosswalkZipToTract2020Q1.csv, but not all tracts match the ACS 5-year dataset.\n",
      "// Here we add any missing tracts from the ACS 5-year dataset\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00m-USHUDCrosswalkTractToCounty.csv' AS row\n",
      "MERGE (t:Tract:Location{id: 'tract' + row.tract})\n",
      "SET t.name = row.tract\n",
      "RETURN count(t) as Tract\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00m-USHUDCrosswalkTractToCounty.csv' AS row\n",
      "MATCH (t:Tract{id: 'tract' + row.tract})\n",
      "MATCH (a:Admin2{fips: row.countyFips, stateFips: row.stateFips})\n",
      "MERGE (t)-[i:IN]->(a)\n",
      "RETURN count(i) as IN_Admin2\n",
      ";\n",
      "\n",
      "                         \n",
      "\n",
      "\n",
      "PostalCode\n",
      "54181\n",
      "IN_ADMIN2\n",
      "53823\n",
      "Tract\n",
      "172121\n",
      "IN_TRACT\n",
      "172121\n",
      "Tract\n",
      "73056\n",
      "IN_Admin2\n",
      "73056\n",
      " \n",
      "----------------------------------------------\n",
      "Running 00o-GeoNamesPostalCode.cypher:\n",
      " \n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00o-GeoNamesPostalCode.csv' AS row\n",
      "// adding zip to avoid conflicts with other location ids\n",
      "MERGE (p:PostalCode:Location{id: 'zip' + row.zip})\n",
      "SET p.name = row.zip, p.placeName = row.placeName, p.location = point({longitude: toFloat(row.longitude), latitude: toFloat(row.latitude), crs: 'WGS-84'})\n",
      "RETURN count(p) as PostalCode\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///00o-GeoNamesPostalCode.csv' AS row\n",
      "MATCH (p:PostalCode{id: 'zip' + row.zip})\n",
      "MATCH (a:Admin2{id: row.admin2_id})\n",
      "MERGE (p)-[i:IN]->(a)\n",
      "RETURN count(i) as IN_ADMIN2\n",
      ";PostalCode\n",
      "41469\n",
      "IN_ADMIN2\n",
      "40936\n",
      " \n",
      "----------------------------------------------\n",
      "Running 00x-NodeMetadata.cypher:\n",
      " \n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///NodeMetadata.csv' AS row \n",
      "MERGE (n:NodeMetadata{name: row.name})\n",
      "SET n.shortDescription = row.shortDescription, n.description = row.description, n.example = row.example, n.definitionSource = row.definitionSource, n.dataProviders = split(row.dataProviders,\";\")\n",
      "RETURN count(n) as NodeMetadata\n",
      ";\n",
      "NodeMetadata\n",
      "26\n",
      " \n",
      "----------------------------------------------\n",
      "Running 00y-DataProvider.cypher:\n",
      " \n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///DataProvider.csv' AS row \n",
      "MERGE (d:DataProvider{id: row.id})\n",
      "SET d.id = row.id, d.name = row.name, d.url = row.url, d.license = row.license\n",
      "RETURN count(d) as DataProvider\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///NodeMetadata.csv' AS row \n",
      "UNWIND split(row.dataProviders, ';') AS dp\n",
      "MATCH (d:DataProvider{id: dp})\n",
      "MATCH (n:NodeMetadata{name: row.name})\n",
      "MERGE (n)-[u:USES_DATA_FROM]->(d)\n",
      "RETURN count(u) as USES_DATA_FROM\n",
      ";DataProvider\n",
      "13\n",
      "USES_DATA_FROM\n",
      "47\n",
      " \n",
      "----------------------------------------------\n",
      "Running 01a-NCBIStrain.cypher:\n",
      " \n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01a-NCBIStrain.csv' AS row \n",
      "WITH row WHERE NOT row.id IS null\n",
      "MERGE (s:Strain{id: row.id})\n",
      "SET s.name = row.name, s.taxonomyId = row.taxonomy_id, s.collectionDate = date(row.collection_date),\n",
      "    s.hostTaxonomyId = row.host_taxonomy_id, s.sex = row.sex, s.age = toInteger(row.age), \n",
      "    s.isolationSource = row.isolation_source\n",
      "RETURN count(s) as Strain\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01a-NCBIStrain.csv' AS row \n",
      "WITH row WHERE NOT row.taxonomy_id IS null\n",
      "MATCH (p:Pathogen{id: row.taxonomy_id})\n",
      "MATCH (s:Strain{id: row.id})\n",
      "MERGE (p)-[h:HAS_STRAIN]->(s)\n",
      "RETURN count(h) as HAS_STRAIN\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01a-NCBIStrain.csv' AS row \n",
      "WITH row WHERE NOT row.host_taxonomy_id IS null\n",
      "MATCH (h:Host{id: row.host_taxonomy_id})\n",
      "MATCH (s:Strain{id: row.id})\n",
      "MERGE (h)-[c:CARRIES]->(s)\n",
      "RETURN count(c) as CARRIES\n",
      ";\n",
      "                \n",
      "Strain\n",
      "2\n",
      "HAS_STRAIN\n",
      "2\n",
      "CARRIES\n",
      "2\n",
      " \n",
      "----------------------------------------------\n",
      "Running 01b-Nextstrain.cypher:\n",
      " \n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01b-Nextstrain.csv' AS row \n",
      "WITH row WHERE NOT row.id IS null\n",
      "MERGE (s:Strain{id: row.id}) \n",
      "SET s.name = row.name, s.taxonomyId = row.taxonomyId, s.collectionDate = date(row.collectionDate),\n",
      "    s.hostTaxonomyId = row.hostTaxonomyId, s.sex = row.sex, s.age = toInteger(row.age), s.clade = row.clade,\n",
      "    s.exposureCountry = row.exposureCountry, s.exposureAdmin1 = row.exposureAdmin1\n",
      "RETURN count(s) as Strain\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01b-Nextstrain.csv' AS row \n",
      "WITH row WHERE NOT row.clade IS null\n",
      "MERGE (c:Clade{id: row.clade})\n",
      "RETURN count(c) as Clade\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01b-Nextstrain.csv' AS row \n",
      "WITH row WHERE NOT row.taxonomyId IS null\n",
      "MATCH (p:Pathogen{id: row.taxonomyId})\n",
      "MATCH (s:Strain{id: row.id})\n",
      "MERGE (p)-[h:HAS_STRAIN]->(s)\n",
      "RETURN count(h) as HAS_STRAIN\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01b-Nextstrain.csv' AS row \n",
      "WITH row WHERE NOT row.clade IS null\n",
      "MATCH (s:Strain{id: row.id})\n",
      "MATCH (c:Clade{id: row.clade})\n",
      "MERGE (s)-[h:HAS_CLADE]->(c)\n",
      "RETURN count(h) as HAS_CLADE\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01b-Nextstrain.csv' AS row \n",
      "WITH row WHERE NOT row.hostTaxonomyId IS null\n",
      "MATCH (h:Host{id: row.hostTaxonomyId})\n",
      "MATCH (s:Strain{id: row.id})\n",
      "MERGE (h)-[c:CARRIES]->(s)\n",
      "RETURN count(c) as CARRIES\n",
      ";\n",
      "Strain\n",
      "3409\n",
      "Clade\n",
      "3409\n",
      "HAS_STRAIN\n",
      "3409\n",
      "HAS_CLADE\n",
      "3409\n",
      "CARRIES\n",
      "3406\n",
      " \n",
      "----------------------------------------------\n",
      "Running 01c-NCBIRefSeq.cypher:\n",
      " \n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01c-NCBIRefSeq.csv' AS row \n",
      "//MERGE (g:Gene{id: row.geneAccession + '-' + row.geneStart + '-' + row.geneEnd})\n",
      "MERGE (g:Gene{id: row.genomeAccession + '-' + row.geneStart + '-' + row.geneEnd})\n",
      "SET g.name = row.geneName, g.accession = row.geneAccession, g.start = toInteger(row.geneStart), g.end = toInteger(row.geneEnd), g.genomeAccession = row.genomeAccession\n",
      "RETURN count(g) as Gene\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01c-NCBIRefSeq.csv' AS row \n",
      "MATCH (gn:Strain{id: row.genomeAccession})\n",
      "//MATCH (g:Gene{id: row.geneAccession + '-' + row.geneStart + '-' + row.geneEnd})\n",
      "MATCH (g:Gene{id: row.genomeAccession + '-' + row.geneStart + '-' + row.geneEnd})\n",
      "MERGE(gn)-[h:HAS]->(g)\n",
      "RETURN count(h) as Has\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01c-NCBIRefSeq.csv' AS row \n",
      "MERGE (p:Protein{id: row.id})\n",
      "SET p.name = row.proteinName, p.accession = row.proteinAccession, p.sequence = row.sequence, p.taxonomyId = row.taxonomyId\n",
      "RETURN count(p) as Protein\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01c-NCBIRefSeq.csv' AS row \n",
      "MERGE (p:ProteinName{id: row.proteinName + row.proteinAccession})\n",
      "SET p.name = row.proteinName, p.accession = row.proteinAccession\n",
      "RETURN count(p) as ProteinName\n",
      ";\n",
      "LOAD CSV WITH HEADERS FROM \"FILE:///01c-NCBIRefSeq.csv\" AS row\n",
      "MATCH (p:Protein{id: row.id})\n",
      "MATCH (pn:ProteinName{id: row.proteinName + row.proteinAccession})\n",
      "MERGE (p)-[n:NAMED_AS]->(pn)\n",
      "RETURN count(n) as NAMED_AS\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01c-NCBIRefSeq.csv' AS row \n",
      "//MATCH (g:Gene{id: row.geneAccession + '-' + row.geneStart + '-' + row.geneEnd})\n",
      "MATCH (g:Gene{id: row.genomeAccession + '-' + row.geneStart + '-' + row.geneEnd})\n",
      "MATCH (p:Protein{id: row.id})\n",
      "MERGE(g)-[e:ENCODES]->(p)\n",
      "RETURN count(e) as ENCODES\n",
      ";\n",
      "Gene\n",
      "48\n",
      "Has\n",
      "48\n",
      "Protein\n",
      "48\n",
      "ProteinName\n",
      "48\n",
      "NAMED_AS\n",
      "48\n",
      "ENCODES\n",
      "48\n",
      " \n",
      "----------------------------------------------\n",
      "Running 01d-CNCBStrain.cypher:\n",
      " \n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01d-CNCBStrain.csv' AS row \n",
      "MERGE (s:Strain{id: row.id}) \n",
      "SET s.name = row.name, s.alias = row.alias, s.taxonomyId = row.taxonomyId, s.collectionDate = date(row.collectionDate), s.hostTaxonomyId = row.hostTaxonomyId, s.location = row.location\n",
      "RETURN count(s) as Strain\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01d-CNCBStrain.csv' AS row\n",
      "MATCH (p:Pathogen{id: row.taxonomyId})\n",
      "MATCH (s:Strain{id: row.id})\n",
      "MERGE (p)-[h:HAS_STRAIN]->(s)\n",
      "RETURN count(h) as HAS_STRAIN\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01d-CNCBStrain.csv' AS row\n",
      "MATCH (h:Host{id: row.hostTaxonomyId})\n",
      "MATCH (s:Strain{id: row.id})\n",
      "MERGE (h)-[c:CARRIES]->(s)\n",
      "RETURN count(c) as CARRIES\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS\n",
      "FROM 'FILE:///01d-CNCBStrain.csv' AS row\n",
      "WITH row WHERE row.locationLevels='0'\n",
      "MATCH (c:Country{name: row.country})\n",
      "MATCH (s:Strain{id: row.id})\n",
      "MERGE (s)-[f:FOUND_IN]->(c)\n",
      "RETURN count(f) as FOUND_IN_COUNTRY\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS\n",
      "FROM 'FILE:///01d-CNCBStrain.csv' AS row\n",
      "WITH row WHERE row.locationLevels='1'\n",
      "MATCH (c:Country{name: row.country})<-[:IN*1..2]-(l1:Location{name: row.admin1})\n",
      "MATCH (s:Strain{id: row.id})\n",
      "MERGE (s)-[h:FOUND_IN]->(l1)\n",
      "RETURN count(h) as FOUND_IN_1\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS\n",
      "FROM 'FILE:///01d-CNCBStrain.csv' AS row\n",
      "WITH row WHERE row.locationLevels='2'\n",
      "MATCH (c:Country{name: row.country})<-[:IN*1..2]-(l1:Location{name: row.admin1})<-[:IN*1..2]-(l2:Location{name: row.admin2})\n",
      "MATCH (s:Strain{id: row.id})\n",
      "MERGE (s)-[h:FOUND_IN]->(l2)\n",
      "RETURN count(h) as FOUND_IN_2\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS\n",
      "FROM 'FILE:///01d-CNCBStrain.csv' AS row\n",
      "WITH row WHERE row.locationLevels='3'\n",
      "MATCH (:Country{name: row.country})<-[:IN]-(:Admin1{name: row.admin1})<-[:IN]-(:Admin2{name: row.admin2})<-[:IN]-(c:City{name: row.city})\n",
      "MATCH (s:Strain{id: row.id})\n",
      "MERGE (s)-[h:FOUND_IN]->(c)\n",
      "RETURN count(h) as FOUND_IN_3\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01d-CNCBVariant.csv' AS row\n",
      "MERGE (v:Variant{id: row.referenceGenome + ':' + row.start + '-' + row.end + '-' + row.ref + '-' + row.alt})\n",
      "SET v.name = row.geneVariant, v.geneVariant = row.geneVariant, v.proteinVariant = row.proteinVariant, v.variantType = row.variantType, v.variantConsequence = row.variantConsequence, \n",
      "v.start = toInteger(row.start), v.end = toInteger(row.end), v.ref = row.ref, v.alt = row.alt, \n",
      "v.taxonomyId = row.taxonomyId, v.referenceGenome = row.referenceGenome, v.proteinPosition = toInteger(row.proteinPosition)\n",
      "RETURN count(v) as Variant\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01d-CNCBVariant.csv' AS row\n",
      "MATCH (s:Strain{name: row.name})\n",
      "MATCH (v:Variant{id: row.referenceGenome + ':' + row.start + '-' + row.end + '-' + row.ref + '-' + row.alt})\n",
      "MERGE (s)-[h:HAS_VARIANT]->(v)\n",
      "RETURN count(h) as HAS_VARIANT\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01d-CNCBVariant.csv' AS row\n",
      "// Match GenBank sequences from first SARS-CoV-2 genome (NC_045512, MN908947)\n",
      "MATCH (g:Gene) WHERE toInteger(row.start) >= g.start AND toInteger(row.end) <= g.end \n",
      "                     AND (g.genomeAccession = 'ncbiprotein:NC_045512' OR g.genomeAccession = 'insdc:MN908947')\n",
      "MATCH (v:Variant{id: row.referenceGenome + ':' + row.start + '-' + row.end + '-' + row.ref + '-' + row.alt})\n",
      "MERGE (g)-[h:HAS_VARIANT]->(v)\n",
      "RETURN count(h) as HAS_VARIANT_GENE\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01d-CNCBVariant.csv' AS row\n",
      "MATCH (p:ProteinName{accession: row.proteinAccession})\n",
      "MATCH (v:Variant{id: row.referenceGenome + ':' + row.start + '-' + row.end + '-' + row.ref + '-' + row.alt})\n",
      "MERGE (p)-[h:HAS_VARIANT]->(v)\n",
      "RETURN count(h) as HAS_VARIANT_PROTEIN\n",
      ";\n",
      "\n",
      "                    \n",
      "\n",
      "Strain\n",
      "37354\n",
      "HAS_STRAIN\n",
      "37354\n",
      "CARRIES\n",
      "37336\n",
      "FOUND_IN_COUNTRY\n",
      "3386\n",
      "FOUND_IN_1\n",
      "21595\n",
      "FOUND_IN_2\n",
      "7622\n",
      "FOUND_IN_3\n",
      "1\n",
      "Variant\n",
      "47162\n",
      "HAS_VARIANT\n",
      "19031\n",
      "HAS_VARIANT_GENE\n",
      "127593\n",
      "HAS_VARIANT_PROTEIN\n",
      "40660\n",
      " \n",
      "----------------------------------------------\n",
      "Running 01e-ProteinProteinInteraction.cypher:\n",
      " \n",
      "LOAD CSV WITH HEADERS FROM \"FILE:///01e-ProteinProteinInteractionProtein.csv\" AS row\n",
      "MERGE (p:Protein{id: row.id})\n",
      "SET p.name = row.name, p.accession = row.accession, p.proId = row.proId, \n",
      "    p.sequence = row.sequence, p.start = toInteger(row.start), p.end = toInteger(row.end), p.fullLength = row.fullLength, \n",
      "    p.taxonomyId = row.taxonomyId\n",
      "RETURN count(p) as Protein\n",
      ";\n",
      "LOAD CSV WITH HEADERS FROM \"FILE:///01e-ProteinProteinInteractionProtein.csv\" AS row\n",
      "MERGE (p:ProteinName{id: coalesce(row.proteinName, '') +  coalesce(row.accession, '') + coalesce(row.proId, '')})\n",
      "SET p.name = row.name, p.accession = row.accession, p.proId = row.proId\n",
      "RETURN count(p) as ProteinName\n",
      ";\n",
      "LOAD CSV WITH HEADERS FROM \"FILE:///01e-ProteinProteinInteractionProtein.csv\" AS row\n",
      "MATCH (p1:Protein)\n",
      "MATCH (p2:Protein{id: row.id})\n",
      "WHERE p1.accession = row.accession AND p1.fullLength = 'True' AND p2.fullLength = 'False'\n",
      "MERGE (p1)-[c:CLEAVED_TO]->(p2)\n",
      "RETURN count(c) as CLEAVED_TO\n",
      ";\n",
      "LOAD CSV WITH HEADERS FROM \"FILE:///01e-ProteinProteinInteractionProtein.csv\" AS row\n",
      "MATCH (p:Protein{id: row.id})\n",
      "MATCH (pn:ProteinName{id: coalesce(row.proteinName, '') +  coalesce(row.accession, '') + coalesce(row.proId, '')})\n",
      "MERGE (p)-[n:NAMED_AS]->(pn)\n",
      "RETURN count(n) as NAMED_AS\n",
      ";                     \n",
      "LOAD CSV WITH HEADERS FROM \"FILE:///01e-ProteinProteinInteraction.csv\" AS row\n",
      "MATCH (pa:Protein{id: row.id_a})\n",
      "MATCH (pb:Protein{id: row.id_b})\n",
      "MERGE (pa)-[i:INTERACTS_WITH]->(pb)\n",
      "RETURN count(i) as INTERACTS_WITH\n",
      ";\n",
      "\n",
      "\n",
      "Protein\n",
      "2073\n",
      "ProteinName\n",
      "2073\n",
      "CLEAVED_TO\n",
      "713\n",
      "NAMED_AS\n",
      "2073\n",
      "INTERACTS_WITH\n",
      "1986\n",
      " \n",
      "----------------------------------------------\n",
      "Running 01h-PMC-Accession.cypher:\n",
      " \n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01h-PMC-Accession.csv' AS row\n",
      "WITH row WHERE NOT row.accession IS null\n",
      "MERGE (p:Publication{id: row.id})\n",
      "RETURN count(p) as Publication\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01h-PMC-Accession.csv' AS row\n",
      "WITH row WHERE NOT row.accession IS null\n",
      "MATCH (s:Strain{id: row.accession})\n",
      "MATCH (p:Publication{id: row.id})\n",
      "MERGE (p)-[m:MENTIONS]->(s)\n",
      "RETURN count(m) as Publication_Strain\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///01h-PMC-Accession.csv' AS row\n",
      "WITH row WHERE NOT row.accession IS null\n",
      "MATCH (n:ProteinName{accession: row.accession})\n",
      "MATCH (p:Publication{id: row.id})\n",
      "MERGE (p)-[m:MENTIONS]->(n)\n",
      "RETURN count(m) as Publication_ProteinName\n",
      ";Publication\n",
      "21780\n",
      "Publication_Strain\n",
      "789\n",
      "Publication_ProteinName\n",
      "38096\n",
      " \n",
      "----------------------------------------------\n",
      "Running 02a-JHUCases.cypher:\n",
      " \n",
      "USING PERIODIC COMMIT 1000\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///02a-JHUCases.csv' AS row \n",
      "MERGE (c:Cases{id: 'COVID-19-JHU' + row.date + '-' + row.stateFips + row.countyFips})\n",
      "SET c.name = 'COVID-19-' + row.date, c.date = date(row.date), c.cummulativeConfirmed = toInteger(row.cummulativeConfirmed), c.cummulativeDeaths = toInteger(row.cummulativeDeaths), c.source = 'JHU'\n",
      "RETURN count(c) as CASES\n",
      ";\n",
      "USING PERIODIC COMMIT 1000\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///02a-JHUCases.csv' AS row\n",
      "MATCH (c:Cases{id: 'COVID-19-JHU' + row.date + '-' + row.stateFips + row.countyFips})\n",
      "MATCH (a:Admin2{fips: row.countyFips, stateFips: row.stateFips})\n",
      "MERGE (c)-[r:REPORTED_IN]->(a)\n",
      "RETURN count(r) as REPORTED_IN\n",
      ";\n",
      "USING PERIODIC COMMIT 1000\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///02a-JHUCases.csv' AS row\n",
      "MATCH (c:Cases{id: 'COVID-19-JHU' + row.date + '-' + row.stateFips + row.countyFips})\n",
      "MATCH (o:Outbreak{id: 'COVID-19'})\n",
      "MERGE (c)-[r:RELATED_TO]->(o)\n",
      "RETURN count(r) as RELATED_TO\n",
      ";\n",
      "USING PERIODIC COMMIT 1000\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///02a-JHUCasesGlobalCountry.csv' AS row \n",
      "MERGE (c:Cases{id: 'COVID-19-JHU' + row.date + '-' + row.country})\n",
      "SET c.name = 'COVID-19-' + row.date, c.date = date(row.date), c.cummulativeConfirmed = toInteger(row.cummulativeConfirmed), c.cummulativeDeaths = toInteger(row.cummulativeDeaths), c.source = 'JHU'\n",
      "RETURN count(c) as CASES\n",
      ";\n",
      "USING PERIODIC COMMIT 1000\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///02a-JHUCasesGlobalCountry.csv' AS row\n",
      "MATCH (c:Cases{id: 'COVID-19-JHU' + row.date + '-' + row.country})\n",
      "MATCH (cn:Country{name: row.country})\n",
      "MERGE (c)-[r:REPORTED_IN]->(cn)\n",
      "RETURN count(r) as REPORTED_IN\n",
      ";\n",
      "USING PERIODIC COMMIT 1000\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///02a-JHUCasesGlobalCountry.csv' AS row\n",
      "MATCH (c:Cases{id: 'COVID-19-JHU' + row.date + '-' + row.country})\n",
      "MATCH (o:Outbreak{id: 'COVID-19'})\n",
      "MERGE (c)-[r:RELATED_TO]->(o)\n",
      "RETURN count(r) as RELATED_TO\n",
      ";\n",
      "USING PERIODIC COMMIT 1000\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///02a-JHUCasesGlobalAdmin1.csv' AS row \n",
      "MERGE (c:Cases{id: 'COVID-19-JHU' + row.date + '-' + row.country + row.admin1})\n",
      "SET c.name = 'COVID-19-' + row.date, c.date = date(row.date), c.cummulativeConfirmed = toInteger(row.cummulativeConfirmed), c.cummulativeDeaths = toInteger(row.cummulativeDeaths), c.source = 'JHU'\n",
      "RETURN count(c) as CASES\n",
      ";\n",
      "USING PERIODIC COMMIT 1000\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///02a-JHUCasesGlobalAdmin1.csv' AS row\n",
      "MATCH (c:Cases{id: 'COVID-19-JHU' + row.date + '-' + row.country + row.admin1})\n",
      "MATCH (a:Admin1{name: row.admin1})-[:IN]->(:Country{name: row.country})\n",
      "MERGE (c)-[r:REPORTED_IN]->(a)\n",
      "RETURN count(r) as REPORTED_IN\n",
      ";\n",
      "USING PERIODIC COMMIT 1000\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///02a-JHUCasesGlobalAdmin1.csv' AS row\n",
      "MATCH (c:Cases{id: 'COVID-19-JHU' + row.date + '-' + row.country + row.admin1})\n",
      "MATCH (o:Outbreak{id: 'COVID-19'})\n",
      "MERGE (c)-[r:RELATED_TO]->(o)\n",
      "RETURN count(r) as RELATED_TO\n",
      ";\n",
      "USING PERIODIC COMMIT 1000\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///02a-JHUCasesGlobalCruiseShip.csv' AS row \n",
      "MERGE (c:Cases{id: 'COVID-19-JHU' + row.date + '-' + row.cruiseship})\n",
      "SET c.name = 'COVID-19-' + row.date, c.date = date(row.date), c.cummulativeConfirmed = toInteger(row.cummulativeConfirmed), c.cummulativeDeaths = toInteger(row.cummulativeDeaths), c.source = 'JHU'\n",
      "RETURN count(c) as CASES\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///02a-JHUCasesGlobalCruiseShip.csv' AS row \n",
      "MERGE (cs:CruiseShip:Location{id: row.cruiseship})\n",
      "SET cs.name = row.cruiseship\n",
      "RETURN count(cs) as CRUISESHIP\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///02a-JHUCasesGlobalCruiseShip.csv' AS row \n",
      "MATCH (cs:CruiseShip:Location{id: row.cruiseship})\n",
      "MATCH (w:World{id: \"m49:1\"})\n",
      "MERGE (cs)-[i:IN]->(w)\n",
      "RETURN count(i) as IN\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///02a-JHUCasesGlobalCruiseShip.csv' AS row\n",
      "MATCH (c:Cases{id: 'COVID-19-JHU' + row.date + '-' +  row.cruiseship})\n",
      "MATCH (cs:CruiseShip{id: row.cruiseship})\n",
      "MERGE (c)-[r:REPORTED_IN]->(cs)\n",
      "RETURN count(r) as REPORTED_IN\n",
      ";\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///02a-JHUCasesGlobalCruiseShip.csv' AS row\n",
      "MATCH (c:Cases{id: 'COVID-19-JHU' + row.date + '-' + row.cruiseship})\n",
      "MATCH (o:Outbreak{id: 'COVID-19'})\n",
      "MERGE (c)-[r:RELATED_TO]->(o)\n",
      "RETURN count(r) as RELATED_TO\n",
      ";\n",
      " CASES\n",
      "360903\n",
      "REPORTED_IN\n",
      "350604\n",
      "RELATED_TO\n",
      "360903\n",
      "CASES\n",
      "26612\n",
      "REPORTED_IN\n",
      "26510\n",
      "RELATED_TO\n",
      "26612\n",
      "CASES\n",
      "8575\n",
      "REPORTED_IN\n",
      "8075\n",
      "RELATED_TO\n",
      "8575\n",
      "CASES\n",
      "499\n",
      "CRUISESHIP\n",
      "499\n",
      "IN\n",
      "499\n",
      "REPORTED_IN\n",
      "499\n",
      "RELATED_TO\n",
      "499\n",
      " \n",
      "----------------------------------------------\n",
      "Running 02c-SDHHSACases.cypher:\n",
      " \n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///02c-SDHHSACases.csv' AS row \n",
      "MERGE (c:Cases{id: 'COVID-19-SDHHSA' + row.date + '-' + row.zipCode})\n",
      "SET c.name = 'COVID-19-' + row.date, c.date = date(row.date), c.cummulativeConfirmed = toInteger(row.cummulativeConfirmed), c.source = 'SDHHSA'\n",
      "RETURN count(c) as CASES\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///02c-SDHHSACases.csv' AS row\n",
      "MATCH (c:Cases{id: 'COVID-19-SDHHSA' + row.date + '-' + row.zipCode})\n",
      "MATCH (p:PostalCode{id: 'zip' + row.zipCode})\n",
      "MERGE (c)-[r:REPORTED_IN]->(p)\n",
      "RETURN count(r) as REPORTED_IN\n",
      ";\n",
      "CASES\n",
      "10193\n",
      "REPORTED_IN\n",
      "10193\n",
      " \n",
      "----------------------------------------------\n",
      "Running 03a-USCensusDP03Employment.cypher:\n",
      " \n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP03EmploymentAdmin2.csv' AS row \n",
      "MERGE (e:Economics{id: 'ACS5-' + row.stateFips + '-' + row.countyFips})\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP03EmploymentAdmin2.csv' AS row\n",
      "MATCH (a:Admin2{fips: row.countyFips, stateFips: row.stateFips})\n",
      "MATCH (e:Economics{id: 'ACS5-' + row.stateFips + '-' + row.countyFips})\n",
      "MERGE (a)-[h:HAS_ECONOMICS]->(e)\n",
      "RETURN count(h) as HAS_ECONOMICS\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP03EmploymentAdmin2.csv' AS row \n",
      "MERGE (e:EmploymentStatus{id: 'ACS5-' + row.stateFips + '-' + row.countyFips})\n",
      "SET e.population16YearsAndOver = toInteger(row.population16YearsAndOver),\n",
      "    e.population16YearsAndOverInLaborForce = toInteger(row.population16YearsAndOverInLaborForce),\n",
      "    e.population16YearsAndOverInLaborForcePct = toFloat(row.population16YearsAndOverInLaborForcePct),\n",
      "    e.population16YearsAndOverInCivilianLaborForce = toInteger(row.population16YearsAndOverInCivilianLaborForce),\n",
      "    e.population16YearsAndOverInCivilianLaborForcePct = toFloat(row.population16YearsAndOverInCivilianLaborForcePct),\n",
      "    e.population16YearsAndOverInArmedForces = toInteger(row.population16YearsAndOverInArmedForces),\n",
      "    e.population16YearsAndOverInArmedForcesPct = toFloat(row.population16YearsAndOverInArmedForcesPct),\n",
      "    e.population16YearsAndOverNotInLaborForce = toInteger(row.population16YearsAndOverNotInLaborForce),\n",
      "    e.population16YearsAndOverNotInLaborForcPct = toFloat(row.population16YearsAndOverNotInLaborPct),                     e.stateFips = row.stateFips, e.countyFips = row.countyFips,\n",
      "    e.source = row.source, e.aggregationLevel = row.aggregationLevel\n",
      "RETURN count(e) as Employment\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP03EmploymentAdmin2.csv' AS row\n",
      "MATCH (e:Economics{id: 'ACS5-' + row.stateFips + '-' + row.countyFips})\n",
      "MATCH (es:EmploymentStatus{id: 'ACS5-' + row.stateFips + '-' + row.countyFips})\n",
      "MERGE (e)-[h:HAS_EMPLOYMENT_STATUS]->(es)\n",
      "RETURN count(h) as HAS_EMPLOYMENT_STATUS\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP03EmploymentZip.csv' AS row \n",
      "MERGE (e:EmploymentStatus{id: 'ACS5-' + row.postalCode})\n",
      "SET e.population16YearsAndOver = toInteger(row.population16YearsAndOver),\n",
      "    e.population16YearsAndOverInLaborForce = toInteger(row.population16YearsAndOverInLaborForce),\n",
      "    e.population16YearsAndOverInLaborForcePct = toFloat(row.population16YearsAndOverInLaborForcePct),\n",
      "    e.population16YearsAndOverInCivilianLaborForce = toInteger(row.population16YearsAndOverInCivilianLaborForce),\n",
      "    e.population16YearsAndOverInCivilianLaborForcePct = toFloat(row.population16YearsAndOverInCivilianLaborForcePct),\n",
      "    e.population16YearsAndOverInArmedForces = toInteger(row.population16YearsAndOverInArmedForces),\n",
      "    e.population16YearsAndOverInArmedForcesPct = toFloat(row.population16YearsAndOverInArmedForcesPct),\n",
      "    e.population16YearsAndOverNotInLaborForce = toInteger(row.population16YearsAndOverNotInLaborForce),\n",
      "    e.population16YearsAndOverNotInLaborForcPct = toFloat(row.population16YearsAndOverNotInLaborPct), \n",
      "    e.postalCode = row.postalCode,\n",
      "    e.source = row.source, e.aggregationLevel = row.aggregationLevel\n",
      "RETURN count(e) as EmploymentStatus\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP03EmploymentZip.csv' AS row\n",
      "MERGE (e:Economics{id: 'ACS5-' + row.postalCode})\n",
      "RETURN count(e) as Economics\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP03EmploymentZip.csv' AS row\n",
      "MATCH (p:PostalCode{id: 'zip' + row.postalCode})\n",
      "MATCH (e:Economics{id: 'ACS5-' + row.postalCode})\n",
      "MERGE (p)-[h:HAS_ECONOMICS]->(e)\n",
      "RETURN count(h) as HAS_ECONOMICS\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP03EmploymentZip.csv' AS row\n",
      "MATCH (e:Economics{id: 'ACS5-' + row.postalCode})\n",
      "MATCH (es:EmploymentStatus{id: 'ACS5-' + row.postalCode})\n",
      "MERGE (e)-[h:HAS_EMPLOYMENT_STATUS]->(es)\n",
      "RETURN count(h) as HAS_EMPLOYMENT_STATUS\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP03EmploymentTract.csv' AS row \n",
      "MERGE (e:EmploymentStatus{id: 'ACS5-' + row.tract})\n",
      "SET e.population16YearsAndOver = toInteger(row.population16YearsAndOver),\n",
      "    e.population16YearsAndOverInLaborForce = toInteger(row.population16YearsAndOverInLaborForce),\n",
      "    e.population16YearsAndOverInLaborForcePct = toFloat(row.population16YearsAndOverInLaborForcePct),\n",
      "    e.population16YearsAndOverInCivilianLaborForce = toInteger(row.population16YearsAndOverInCivilianLaborForce),\n",
      "    e.population16YearsAndOverInCivilianLaborForcePct = toFloat(row.population16YearsAndOverInCivilianLaborForcePct),\n",
      "    e.population16YearsAndOverInArmedForces = toInteger(row.population16YearsAndOverInArmedForces),\n",
      "    e.population16YearsAndOverInArmedForcesPct = toFloat(row.population16YearsAndOverInArmedForcesPct),\n",
      "    e.population16YearsAndOverNotInLaborForce = toInteger(row.population16YearsAndOverNotInLaborForce),\n",
      "    e.population16YearsAndOverNotInLaborForcPct = toFloat(row.population16YearsAndOverNotInLaborPct), \n",
      "    e.tract = row.tract,\n",
      "    e.source = row.source, e.aggregationLevel = row.aggregationLevel\n",
      "RETURN count(e) as EmploymentStatus\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP03EmploymentTract.csv' AS row\n",
      "MERGE (e:Economics{id: 'ACS5-' + row.tract})\n",
      "RETURN count(e) as Economics\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP03EmploymentTract.csv' AS row\n",
      "MATCH (t:Tract{id: 'tract' + row.tract})\n",
      "MATCH (e:Economics{id: 'ACS5-' + row.tract})\n",
      "MERGE (t)-[h:HAS_ECONOMICS]->(e)\n",
      "RETURN count(h) as HAS_ECONOMICS\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP03EmploymentTract.csv' AS row\n",
      "MATCH (e:Economics{id: 'ACS5-' + row.tract})\n",
      "MATCH (es:EmploymentStatus{id: 'ACS5-' + row.tract})\n",
      "MERGE (e)-[h:HAS_EMPLOYMENT_STATUS]->(es)\n",
      "RETURN count(h) as HAS_EMPLOYMENT_STATUS\n",
      ";HAS_ECONOMICS\n",
      "3142\n",
      "Employment\n",
      "3142\n",
      "HAS_EMPLOYMENT_STATUS\n",
      "3142\n",
      "EmploymentStatus\n",
      "33120\n",
      "Economics\n",
      "33120\n",
      "HAS_ECONOMICS\n",
      "33102\n",
      "HAS_EMPLOYMENT_STATUS\n",
      "33120\n",
      "EmploymentStatus\n",
      "73056\n",
      "Economics\n",
      "73056\n",
      "HAS_ECONOMICS\n",
      "73056\n",
      "HAS_EMPLOYMENT_STATUS\n",
      "73056\n",
      " \n",
      "----------------------------------------------\n",
      "Running 03a-USCensusDP03Income.cypher:\n",
      " \n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP03IncomeAdmin2.csv' AS row \n",
      "MERGE (i:Income{id: 'ACS5-' + row.stateFips + '-' + row.countyFips})\n",
      "SET i.totalHouseholds = toInteger(row.totalHouseholds),\n",
      "    i.householdIncomeLessThan10000USD = toInteger(row.householdIncomeLessThan10000USD),\n",
      "    i.householdIncomeLessThan10000USDPct = toFloat(row.householdIncomeLessThan10000USDPct),\n",
      "    i.householdIncome10000To14999USD = toInteger(row.householdIncome10000To14999USD),\n",
      "    i.householdIncome10000To14999USDPct = toFloat(row.householdIncome10000To14999USDPct),\n",
      "    i.householdIncome15000To24999USD = toInteger(row.householdIncome15000To24999USD),\n",
      "    i.householdIncome15000To24999USDPct = toFloat(row.householdIncome15000To24999USDPct),\n",
      "    i.householdIncome25000To34999USD = toInteger(row.householdIncome25000To34999USD),\n",
      "    i.householdIncome25000To34999USDPct = toFloat(row.householdIncome25000To34999USDPct),\n",
      "    i.householdIncome35000To49999USD = toInteger(row.householdIncome35000To49999USD),\n",
      "    i.householdIncome35000To49999USDPct = toFloat(row.householdIncome35000To49999USDPct),\n",
      "    i.householdIncome50000To74999USD = toInteger(row.householdIncome50000To74999USD),\n",
      "    i.householdIncome50000To74999USDPct = toFloat(row.householdIncome50000To74999USDPct),\n",
      "    i.householdIncome75000To99999USD = toInteger(row.householdIncome75000To99999USD),\n",
      "    i.householdIncome75000To99999USDPct = toFloat(row.householdIncome75000To99999USDPct),\n",
      "    i.householdIncome100000To149999USD = toInteger(row.householdIncome100000To149999USD),\n",
      "    i.householdIncome100000To149999USDPct = toFloat(row.householdIncome100000To149999USDPct),\n",
      "    i.householdIncome150000To199999USD = toInteger(row.householdIncome150000To199999USD),\n",
      "    i.householdIncome150000To199999USDPct = toFloat(row.householdIncome150000To199999USDPct),\n",
      "    i.householdIncomeMoreThan200000USD = toInteger(row.householdIncomeMoreThan200000USD),\n",
      "    i.householdIncomeMoreThan200000USDPct = toFloat(row.householdIncomeMoreThan200000USDPct),\n",
      "    i.medianHouseholdIncomeUSD = toInteger(row.medianHouseholdIncomeUSD),\n",
      "    i.meanHouseholdIncomeUSD = toInteger(row.meanHouseholdIncomeUSD),\n",
      "    i.stateFips = row.stateFips, i.countyFips = row.countyFips,\n",
      "    i.source = row.source, i.aggregationLevel = row.aggregationLevel\n",
      "RETURN count(i) as Income\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP03IncomeAdmin2.csv' AS row\n",
      "MATCH (e:Economics{id: 'ACS5-' + row.stateFips + '-' + row.countyFips})\n",
      "MATCH (i:Income{id: 'ACS5-' + row.stateFips + '-' + row.countyFips})\n",
      "MERGE (e)-[h:HAS_INCOME]->(i)\n",
      "RETURN count(h) as HAS_INCOME\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP03IncomeZip.csv' AS row \n",
      "MERGE (i:Income{id: 'ACS5-' + row.postalCode})\n",
      "SET i.totalHouseholds = toInteger(row.totalHouseholds),\n",
      "    i.householdIncomeLessThan10000USD = toInteger(row.householdIncomeLessThan10000USD),\n",
      "    i.householdIncomeLessThan10000USDPct = toFloat(row.householdIncomeLessThan10000USDPct),\n",
      "    i.householdIncome10000To14999USD = toInteger(row.householdIncome10000To14999USD),\n",
      "    i.householdIncome10000To14999USDPct = toFloat(row.householdIncome10000To14999USDPct),\n",
      "    i.householdIncome15000To24999USD = toInteger(row.householdIncome15000To24999USD),\n",
      "    i.householdIncome15000To24999USDPct = toFloat(row.householdIncome15000To24999USDPct),\n",
      "    i.householdIncome25000To34999USD = toInteger(row.householdIncome25000To34999USD),\n",
      "    i.householdIncome25000To34999USDPct = toFloat(row.householdIncome25000To34999USDPct),\n",
      "    i.householdIncome35000To49999USD = toInteger(row.householdIncome35000To49999USD),\n",
      "    i.householdIncome35000To49999USDPct = toFloat(row.householdIncome35000To49999USDPct),\n",
      "    i.householdIncome50000To74999USD = toInteger(row.householdIncome50000To74999USD),\n",
      "    i.householdIncome50000To74999USDPct = toFloat(row.householdIncome50000To74999USDPct),\n",
      "    i.householdIncome75000To99999USD = toInteger(row.householdIncome75000To99999USD),\n",
      "    i.householdIncome75000To99999USDPct = toFloat(row.householdIncome75000To99999USDPct),\n",
      "    i.householdIncome100000To149999USD = toInteger(row.householdIncome100000To149999USD),\n",
      "    i.householdIncome100000To149999USDPct = toFloat(row.householdIncome100000To149999USDPct),\n",
      "    i.householdIncome150000To199999USD = toInteger(row.householdIncome150000To199999USD),\n",
      "    i.householdIncome150000To199999USDPct = toFloat(row.householdIncome150000To199999USDPct),\n",
      "    i.householdIncomeMoreThan200000USD = toInteger(row.householdIncomeMoreThan200000USD),\n",
      "    i.householdIncomeMoreThan200000USDPct = toFloat(row.householdIncomeMoreThan200000USDPct),\n",
      "    i.medianHouseholdIncomeUSD = toInteger(row.medianHouseholdIncomeUSD),\n",
      "    i.postalCode = row.postalCode,\n",
      "    i.source = row.source, i.aggregationLevel = row.aggregationLevel\n",
      "RETURN count(i) as Income\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP03IncomeZip.csv' AS row\n",
      "MATCH (e:Economics{id: 'ACS5-' + row.postalCode})\n",
      "MATCH (i:Income{id: 'ACS5-' + row.postalCode})\n",
      "MERGE (e)-[h:HAS_INCOME]->(i)\n",
      "RETURN count(h) as HAS_INCOME\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP03IncomeTract.csv' AS row \n",
      "MERGE (i:Income{id: 'ACS5-' + row.tract})\n",
      "SET i.totalHouseholds = toInteger(row.totalHouseholds),\n",
      "    i.householdIncomeLessThan10000USD = toInteger(row.householdIncomeLessThan10000USD),\n",
      "    i.householdIncomeLessThan10000USDPct = toFloat(row.householdIncomeLessThan10000USDPct),\n",
      "    i.householdIncome10000To14999USD = toInteger(row.householdIncome10000To14999USD),\n",
      "    i.householdIncome10000To14999USDPct = toFloat(row.householdIncome10000To14999USDPct),\n",
      "    i.householdIncome15000To24999USD = toInteger(row.householdIncome15000To24999USD),\n",
      "    i.householdIncome15000To24999USDPct = toFloat(row.householdIncome15000To24999USDPct),\n",
      "    i.householdIncome25000To34999USD = toInteger(row.householdIncome25000To34999USD),\n",
      "    i.householdIncome25000To34999USDPct = toFloat(row.householdIncome25000To34999USDPct),\n",
      "    i.householdIncome35000To49999USD = toInteger(row.householdIncome35000To49999USD),\n",
      "    i.householdIncome35000To49999USDPct = toFloat(row.householdIncome35000To49999USDPct),\n",
      "    i.householdIncome50000To74999USD = toInteger(row.householdIncome50000To74999USD),\n",
      "    i.householdIncome50000To74999USDPct = toFloat(row.householdIncome50000To74999USDPct),\n",
      "    i.householdIncome75000To99999USD = toInteger(row.householdIncome75000To99999USD),\n",
      "    i.householdIncome75000To99999USDPct = toFloat(row.householdIncome75000To99999USDPct),\n",
      "    i.householdIncome100000To149999USD = toInteger(row.householdIncome100000To149999USD),\n",
      "    i.householdIncome100000To149999USDPct = toFloat(row.householdIncome100000To149999USDPct),\n",
      "    i.householdIncome150000To199999USD = toInteger(row.householdIncome150000To199999USD),\n",
      "    i.householdIncome150000To199999USDPct = toFloat(row.householdIncome150000To199999USDPct),\n",
      "    i.householdIncomeMoreThan200000USD = toInteger(row.householdIncomeMoreThan200000USD),\n",
      "    i.householdIncomeMoreThan200000USDPct = toFloat(row.householdIncomeMoreThan200000USDPct),\n",
      "    i.medianHouseholdIncomeUSD = toInteger(row.medianHouseholdIncomeUSD),\n",
      "    i.tract = row.tract,\n",
      "    i.source = row.source, i.aggregationLevel = row.aggregationLevel\n",
      "RETURN count(i) as Income\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP03IncomeTract.csv' AS row\n",
      "MATCH (e:Economics{id: 'ACS5-' + row.tract})\n",
      "MATCH (i:Income{id: 'ACS5-' + row.tract})\n",
      "MERGE (e)-[h:HAS_INCOME]->(i)\n",
      "RETURN count(h) as HAS_INCOME\n",
      ";Income\n",
      "3142\n",
      "HAS_INCOME\n",
      "3142\n",
      "Income\n",
      "33120\n",
      "HAS_INCOME\n",
      "33120\n",
      "Income\n",
      "73056\n",
      "HAS_INCOME\n",
      "73056\n",
      " \n",
      "----------------------------------------------\n",
      "Running 03a-USCensusDP03Commuting.cypher:\n",
      " \n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP03CommutingAdmin2.csv' AS row \n",
      "MERGE (c:Commuting{id: 'ACS5-' + row.stateFips + '-' + row.countyFips})\n",
      "SET c.workers16YearsAndOver = toInteger(row.workers16YearsAndOver),\n",
      "    c.droveAloneToWorkInCarTruckOrVan = toInteger(row.droveAloneToWorkInCarTruckOrVan),\n",
      "    c.droveAloneToWorkInCarTruckOrVanPct = toFloat(row.droveAloneToWorkInCarTruckOrVanPct),\n",
      "    c.carpooledToWorkInCarTruckOrVan = toInteger(row.carpooledToWorkInCarTruckOrVan),\n",
      "    c.carpooledToWorkInCarTruckOrVanPct = toFloat(row.carpooledToWorkInCarTruckOrVanPct),\n",
      "    c.publicTransportToWork = toInteger(row.publicTransportToWork),\n",
      "    c.publicTransportToWorkPct = toFloat(row.publicTransportToWorkPct),\n",
      "    c.walkedToWork = toInteger(row.walkedToWork),\n",
      "    c.walkedToWorkPct = toFloat(row.walkedToWorkPct),\n",
      "    c.otherMeansOfCommutingToWork = toInteger(row.otherMeansOfCommutingToWork),\n",
      "    c.otherMeansOfCommutingToWorkPct = toFloat(row.otherMeansOfCommutingToWorkPct),\n",
      "    c.workedAtHome = toInteger(row.workedAtHome),\n",
      "    c.workedAtHomePct = toFloat(row.workedAtHomePct),\n",
      "    c.meanTravelTimeToWorkMinutes = toInteger(row.meanTravelTimeToWorkMinutes),\n",
      "    c.stateFips = row.stateFips, c.countyFips = row.countyFips,\n",
      "    c.source = row.source, c.aggregationLevel = row.aggregationLevel\n",
      "RETURN count(c) as Commuting\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP03CommutingAdmin2.csv' AS row\n",
      "MATCH (e:Economics{id: 'ACS5-' + row.stateFips + '-' + row.countyFips})\n",
      "MATCH (c:Commuting{id: 'ACS5-' + row.stateFips + '-' + row.countyFips})\n",
      "MERGE (e)-[h:HAS_COMMUTING]->(c)\n",
      "RETURN count(h) as HAS_COMMUTING\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP03CommutingZip.csv' AS row \n",
      "MERGE (c:Commuting{id: 'ACS5-' + row.postalCode})\n",
      "SET c.workers16YearsAndOver = toInteger(row.workers16YearsAndOver),\n",
      "    c.droveAloneToWorkInCarTruckOrVan = toInteger(row.droveAloneToWorkInCarTruckOrVan),\n",
      "    c.droveAloneToWorkInCarTruckOrVanPct = toFloat(row.droveAloneToWorkInCarTruckOrVanPct),\n",
      "    c.carpooledToWorkInCarTruckOrVan = toInteger(row.carpooledToWorkInCarTruckOrVan),\n",
      "    c.carpooledToWorkInCarTruckOrVanPct = toFloat(row.carpooledToWorkInCarTruckOrVanPct),\n",
      "    c.publicTransportToWork = toInteger(row.publicTransportToWork),\n",
      "    c.publicTransportToWorkPct = toFloat(row.publicTransportToWorkPct),\n",
      "    c.walkedToWork = toInteger(row.walkedToWork),\n",
      "    c.walkedToWorkPct = toFloat(row.walkedToWorkPct),\n",
      "    c.otherMeansOfCommutingToWork = toInteger(row.otherMeansOfCommutingToWork),\n",
      "    c.otherMeansOfCommutingToWorkPct = toFloat(row.otherMeansOfCommutingToWorkPct),\n",
      "    c.workedAtHome = toInteger(row.workedAtHome),\n",
      "    c.workedAtHomePct = toFloat(row.workedAtHomePct),\n",
      "    c.meanTravelTimeToWorkMinutes = toInteger(row.meanTravelTimeToWorkMinutes),\n",
      "    c.postalCode = row.postalCode,\n",
      "    c.source = row.source, c.aggregationLevel = row.aggregationLevel\n",
      "RETURN count(c) as Commuting\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP03CommutingZip.csv' AS row\n",
      "MATCH (e:Economics{id: 'ACS5-' + row.postalCode})\n",
      "MATCH (c:Commuting{id: 'ACS5-' + row.postalCode})\n",
      "MERGE (e)-[h:HAS_COMMUTING]->(c)\n",
      "RETURN count(h) as HAS_COMMUTING\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP03CommutingTract.csv' AS row \n",
      "MERGE (c:Commuting{id: 'ACS5-' + row.tract})\n",
      "SET c.workers16YearsAndOver = toInteger(row.workers16YearsAndOver),\n",
      "    c.droveAloneToWorkInCarTruckOrVan = toInteger(row.droveAloneToWorkInCarTruckOrVan),\n",
      "    c.droveAloneToWorkInCarTruckOrVanPct = toFloat(row.droveAloneToWorkInCarTruckOrVanPct),\n",
      "    c.carpooledToWorkInCarTruckOrVan = toInteger(row.carpooledToWorkInCarTruckOrVan),\n",
      "    c.carpooledToWorkInCarTruckOrVanPct = toFloat(row.carpooledToWorkInCarTruckOrVanPct),\n",
      "    c.publicTransportToWork = toInteger(row.publicTransportToWork),\n",
      "    c.publicTransportToWorkPct = toFloat(row.publicTransportToWorkPct),\n",
      "    c.walkedToWork = toInteger(row.walkedToWork),\n",
      "    c.walkedToWorkPct = toFloat(row.walkedToWorkPct),\n",
      "    c.otherMeansOfCommutingToWork = toInteger(row.otherMeansOfCommutingToWork),\n",
      "    c.otherMeansOfCommutingToWorkPct = toFloat(row.otherMeansOfCommutingToWorkPct),\n",
      "    c.workedAtHome = toInteger(row.workedAtHome),\n",
      "    c.workedAtHomePct = toFloat(row.workedAtHomePct),\n",
      "    c.meanTravelTimeToWorkMinutes = toInteger(row.meanTravelTimeToWorkMinutes),\n",
      "    c.tract = row.tract,\n",
      "    c.source = row.source, c.aggregationLevel = row.aggregationLevel\n",
      "RETURN count(c) as Commuting\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP03CommutingTract.csv' AS row\n",
      "MATCH (e:Economics{id: 'ACS5-' + row.tract})\n",
      "MATCH (c:Commuting{id: 'ACS5-' + row.tract})\n",
      "MERGE (e)-[h:HAS_COMMUTING]->(c)\n",
      "RETURN count(h) as HAS_COMMUTING\n",
      ";Commuting\n",
      "3142\n",
      "HAS_COMMUTING\n",
      "3142\n",
      "Commuting\n",
      "33120\n",
      "HAS_COMMUTING\n",
      "33120\n",
      "Commuting\n",
      "73056\n",
      "HAS_COMMUTING\n",
      "73056\n",
      " \n",
      "----------------------------------------------\n",
      "Running 03a-USCensusDP03Occupation.cypher:\n",
      " \n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP03OccupationAdmin2.csv' AS row \n",
      "MERGE (o:Occupation{id: 'ACS5-' + row.stateFips + '-' + row.countyFips})\n",
      "SET o.civilianEmployedPopulation16YearsAndOver = toInteger(row.civilianEmployedPopulation16YearsAndOver),\n",
      "    o.managementBusinessScienceAndArtsOccupations = toInteger(row.managementBusinessScienceAndArtsOccupations),\n",
      "    o.managementBusinessScienceAndArtsOccupationsPct = toFloat(row.managementBusinessScienceAndArtsOccupationsPct),\n",
      "    o.serviceOccupations = toInteger(row.serviceOccupations),\n",
      "    o.serviceOccupationsPct = toFloat(row.serviceOccupationsPct),\n",
      "    o.salesAndOfficeOccupations = toInteger(row.salesAndOfficeOccupations),\n",
      "    o.salesAndOfficeOccupationsPct = toFloat(row.salesAndOfficeOccupationsPct),\n",
      "    o.naturalResourcesConstructionAndMaintenanceOccupations = toInteger(row.naturalResourcesConstructionAndMaintenanceOccupations),\n",
      "    o.naturalResourcesConstructionAndMaintenanceOccupationsPct = toFloat(row.naturalResourcesConstructionAndMaintenanceOccupationsPct),\n",
      "    o.productionTransportationAndMaterialMovingOccupations = toInteger(row.productionTransportationAndMaterialMovingOccupations),\n",
      "    o.productionTransportationAndMaterialMovingOccupationsPct = toFloat(row.productionTransportationAndMaterialMovingOccupationsPct),\n",
      "    o.stateFips = row.stateFips, o.countyFips = row.countyFips,\n",
      "    o.source = row.source, o.aggregationLevel = row.aggregationLevel\n",
      "RETURN count(o) as Occupation\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP03OccupationAdmin2.csv' AS row\n",
      "MATCH (e:Economics{id: 'ACS5-' + row.stateFips + '-' + row.countyFips})\n",
      "MATCH (o:Occupation{id: 'ACS5-' + row.stateFips + '-' + row.countyFips})\n",
      "MERGE (e)-[h:HAS_OCCUPATION]->(o)\n",
      "RETURN count(h) as HAS_OCCUPATION\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP03OccupationZip.csv' AS row \n",
      "MERGE (o:Occupation{id: 'ACS5-' + row.postalCode})\n",
      "SET o.civilianEmployedPopulation16YearsAndOver = toInteger(row.civilianEmployedPopulation16YearsAndOver),\n",
      "    o.managementBusinessScienceAndArtsOccupations = toInteger(row.managementBusinessScienceAndArtsOccupations),\n",
      "    o.managementBusinessScienceAndArtsOccupationsPct = toFloat(row.managementBusinessScienceAndArtsOccupationsPct),\n",
      "    o.serviceOccupations = toInteger(row.serviceOccupations),\n",
      "    o.serviceOccupationsPct = toFloat(row.serviceOccupationsPct),\n",
      "    o.salesAndOfficeOccupations = toInteger(row.salesAndOfficeOccupations),\n",
      "    o.salesAndOfficeOccupationsPct = toFloat(row.salesAndOfficeOccupationsPct),\n",
      "    o.naturalResourcesConstructionAndMaintenanceOccupations = toInteger(row.naturalResourcesConstructionAndMaintenanceOccupations),\n",
      "    o.naturalResourcesConstructionAndMaintenanceOccupationsPct = toFloat(row.naturalResourcesConstructionAndMaintenanceOccupationsPct),\n",
      "    o.productionTransportationAndMaterialMovingOccupations = toInteger(row.productionTransportationAndMaterialMovingOccupations),\n",
      "    o.productionTransportationAndMaterialMovingOccupationsPct = toFloat(row.productionTransportationAndMaterialMovingOccupationsPct),       o.postalCode = row.postalCode,\n",
      "    o.source = row.source, o.aggregationLevel = row.aggregationLevel\n",
      "RETURN count(o) as Occupation\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP03OccupationZip.csv' AS row\n",
      "MATCH (e:Economics{id: 'ACS5-' + row.postalCode})\n",
      "MATCH (o:Occupation{id: 'ACS5-' + row.postalCode})\n",
      "MERGE (e)-[h:HAS_OCCUPATION]->(o)\n",
      "RETURN count(h) as HAS_OCCUPATION\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP03OccupationTract.csv' AS row \n",
      "MERGE (o:Occupation{id: 'ACS5-' + row.tract})\n",
      "SET o.civilianEmployedPopulation16YearsAndOver = toInteger(row.civilianEmployedPopulation16YearsAndOver),\n",
      "    o.managementBusinessScienceAndArtsOccupations = toInteger(row.managementBusinessScienceAndArtsOccupations),\n",
      "    o.managementBusinessScienceAndArtsOccupationsPct = toFloat(row.managementBusinessScienceAndArtsOccupationsPct),\n",
      "    o.serviceOccupations = toInteger(row.serviceOccupations),\n",
      "    o.serviceOccupationsPct = toFloat(row.serviceOccupationsPct),\n",
      "    o.salesAndOfficeOccupations = toInteger(row.salesAndOfficeOccupations),\n",
      "    o.salesAndOfficeOccupationsPct = toFloat(row.salesAndOfficeOccupationsPct),\n",
      "    o.naturalResourcesConstructionAndMaintenanceOccupations = toInteger(row.naturalResourcesConstructionAndMaintenanceOccupations),\n",
      "    o.naturalResourcesConstructionAndMaintenanceOccupationsPct = toFloat(row.naturalResourcesConstructionAndMaintenanceOccupationsPct),\n",
      "    o.productionTransportationAndMaterialMovingOccupations = toInteger(row.productionTransportationAndMaterialMovingOccupations),\n",
      "    o.productionTransportationAndMaterialMovingOccupationsPct = toFloat(row.productionTransportationAndMaterialMovingOccupationsPct),\n",
      "    o.tract = row.tract,\n",
      "    o.source = row.source, o.aggregationLevel = row.aggregationLevel\n",
      "RETURN count(o) as Occupation\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP03OccupationTract.csv' AS row\n",
      "MATCH (e:Economics{id: 'ACS5-' + row.tract})\n",
      "MATCH (o:Occupation{id: 'ACS5-' + row.tract})\n",
      "MERGE (e)-[h:HAS_OCCUPATION]->(o)\n",
      "RETURN count(h) as HAS_OCCUPATION\n",
      ";Occupation\n",
      "3142\n",
      "HAS_OCCUPATION\n",
      "3142\n",
      "Occupation\n",
      "33120\n",
      "HAS_OCCUPATION\n",
      "33120\n",
      "Occupation\n",
      "73056\n",
      "HAS_OCCUPATION\n",
      "73056\n",
      " \n",
      "----------------------------------------------\n",
      "Running 03a-USCensusDP04.cypher:\n",
      " \n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP04Admin2.csv' AS row \n",
      "MERGE (h:Housing{id: 'ACS5-' + row.stateFips + '-' + row.countyFips})\n",
      "SET h.totalHousingUnits = toInteger(row.totalHousingUnits),\n",
      "    h.occupiedHousingUnits = toInteger(row.occupiedHousingUnits),\n",
      "    h.vacantHousingUnits = toInteger(row.vacantHousingUnits),\n",
      "    h.homeownerVacancyRate = toFloat(row.homeownerVacancyRate),\n",
      "    h.rentalVacancyRate = toFloat(row.rentalVacancyRate),\n",
      "    h.medianRoomsInHousingUnits = toFloat(row.medianRoomsInHousingUnits),\n",
      "    h.ownerOccupiedHousingUnits = toInteger(row.ownerOccupiedHousingUnits),\n",
      "    h.renterOccupiedHousingUnits = toInteger(row.renterOccupiedHousingUnits),\n",
      "    h.averageHouseholdSizeOfOwnerOccupiedUnit = toFloat(row.averageHouseholdSizeOfOwnerOccupiedUnit),\n",
      "    h.averageHouseholdSizeOfRenterOccupiedUnit = toFloat(row.averageHouseholdSizeOfRenterOccupiedUnit),\n",
      "    h.occupiedHousingUnitsWithVehicles = toInteger(row.occupiedHousingUnitsWithVehicles),\n",
      "    h.occupiedHousingUnitsNoVehicles = toInteger(row.occupiedHousingUnitsNoVehicles),\n",
      "    h.`occupantsPerRoom1.00orLess` = toInteger(row.`occupantsPerRoom1.00orLess`),\n",
      "    h.`occupantsPerRoom1.01to1.50` = toInteger(row.`occupantsPerRoom1.01to1.50`),\n",
      "    h.`occupantsPerRoom1.51orMore` = toInteger(row.`occupantsPerRoom1.51orMore`),\n",
      "    h.stateFips = row.stateFips, h.countyFips = row.countyFips,\n",
      "    h.source = row.source, h.aggregationLevel = row.aggregationLevel\n",
      "RETURN count(h) as Housing\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP04Admin2.csv' AS row\n",
      "MATCH (a:Admin2{fips: row.countyFips, stateFips: row.stateFips})\n",
      "MATCH (h:Housing{id: 'ACS5-' + row.stateFips + '-' + row.countyFips})\n",
      "MERGE (a)-[hh:HAS_HOUSING]->(h)\n",
      "RETURN count(hh) as HAS_HOUSING\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP04Zip.csv' AS row \n",
      "MERGE (h:Housing{id: 'ACS5-' + row.postalCode})\n",
      "SET h.totalHousingUnits = toInteger(row.totalHousingUnits),\n",
      "    h.occupiedHousingUnits = toInteger(row.occupiedHousingUnits),\n",
      "    h.vacantHousingUnits = toInteger(row.vacantHousingUnits),\n",
      "    h.homeownerVacancyRate = toFloat(row.homeownerVacancyRate),\n",
      "    h.rentalVacancyRate = toFloat(row.rentalVacancyRate),\n",
      "    h.medianRoomsInHousingUnits = toFloat(row.medianRoomsInHousingUnits),\n",
      "    h.ownerOccupiedHousingUnits = toInteger(row.ownerOccupiedHousingUnits),\n",
      "    h.renterOccupiedHousingUnits = toInteger(row.renterOccupiedHousingUnits),\n",
      "    h.averageHouseholdSizeOfOwnerOccupiedUnit = toFloat(row.averageHouseholdSizeOfOwnerOccupiedUnit),\n",
      "    h.averageHouseholdSizeOfRenterOccupiedUnit = toFloat(row.averageHouseholdSizeOfRenterOccupiedUnit),\n",
      "    h.occupiedHousingUnitsWithVehicles = toInteger(row.occupiedHousingUnitsWithVehicles),\n",
      "    h.occupiedHousingUnitsNoVehicles = toInteger(row.occupiedHousingUnitsNoVehicles),\n",
      "    h.`occupantsPerRoom1.00orLess` = toInteger(row.`occupantsPerRoom1.00orLess`),\n",
      "    h.`occupantsPerRoom1.01to1.50` = toInteger(row.`occupantsPerRoom1.01to1.50`),\n",
      "    h.`occupantsPerRoom1.51orMore` = toInteger(row.`occupantsPerRoom1.51orMore`),\n",
      "    h.postalCode = row.postalCode,\n",
      "    h.source = row.source, h.aggregationLevel = row.aggregationLevel\n",
      "RETURN count(h) as Housing\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP04Zip.csv' AS row\n",
      "MATCH (p:PostalCode{id: 'zip' + row.postalCode})\n",
      "MATCH (h:Housing{id: 'ACS5-' + row.postalCode})\n",
      "MERGE (p)-[hh:HAS_HOUSING]->(h)\n",
      "RETURN count(hh) as HAS_HOUSING\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP04Tract.csv' AS row \n",
      "MERGE (h:Housing{id: 'ACS5-' + row.tract})\n",
      "SET h.totalHousingUnits = toInteger(row.totalHousingUnits),\n",
      "    h.occupiedHousingUnits = toInteger(row.occupiedHousingUnits),\n",
      "    h.vacantHousingUnits = toInteger(row.vacantHousingUnits),\n",
      "    h.homeownerVacancyRate = toFloat(row.homeownerVacancyRate),\n",
      "    h.rentalVacancyRate = toFloat(row.rentalVacancyRate),\n",
      "    h.medianRoomsInHousingUnits = toFloat(row.medianRoomsInHousingUnits),\n",
      "    h.ownerOccupiedHousingUnits = toInteger(row.ownerOccupiedHousingUnits),\n",
      "    h.renterOccupiedHousingUnits = toInteger(row.renterOccupiedHousingUnits),\n",
      "    h.averageHouseholdSizeOfOwnerOccupiedUnit = toFloat(row.averageHouseholdSizeOfOwnerOccupiedUnit),\n",
      "    h.averageHouseholdSizeOfRenterOccupiedUnit = toFloat(row.averageHouseholdSizeOfRenterOccupiedUnit),\n",
      "    h.occupiedHousingUnitsWithVehicles = toInteger(row.occupiedHousingUnitsWithVehicles),\n",
      "    h.occupiedHousingUnitsNoVehicles = toInteger(row.occupiedHousingUnitsNoVehicles),\n",
      "    h.`occupantsPerRoom1.00orLess` = toInteger(row.`occupantsPerRoom1.00orLess`),\n",
      "    h.`occupantsPerRoom1.01to1.50` = toInteger(row.`occupantsPerRoom1.01to1.50`),\n",
      "    h.`occupantsPerRoom1.51orMore` = toInteger(row.`occupantsPerRoom1.51orMore`),\n",
      "    h.tract = row.tract,\n",
      "    h.source = row.source, h.aggregationLevel = row.aggregationLevel\n",
      "RETURN count(h) as Housing\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP04Tract.csv' AS row\n",
      "MATCH (t:Tract{id: 'tract' + row.tract})\n",
      "MATCH (h:Housing{id: 'ACS5-' + row.tract})\n",
      "MERGE (t)-[hh:HAS_HOUSING]->(h)\n",
      "RETURN count(hh) as HAS_HOUSING\n",
      ";Housing\n",
      "3142\n",
      "HAS_HOUSING\n",
      "3142\n",
      "Housing\n",
      "33120\n",
      "HAS_HOUSING\n",
      "33102\n",
      "Housing\n",
      "73056\n",
      "HAS_HOUSING\n",
      "73056\n",
      " \n",
      "----------------------------------------------\n",
      "Running 03a-USCensusDP05.cypher:\n",
      " \n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP05Admin2.csv' AS row \n",
      "MERGE (d:Demographics{id: 'ACS5-' + row.stateFips + '-' + row.countyFips})\n",
      "SET d.name = d.id, d.totalPopulation = toInteger(row.totalPopulation), \n",
      "    d.male = toInteger(row.male), d.female = toInteger(row.female),\n",
      "    d.age0_4 = toInteger(row.age0_4), d.age5_9 = toInteger(row.age5_9), d.age10_14 = toInteger(row.age10_14),\n",
      "    d.age15_19 = toInteger(row.age15_19), d.age20_24 = toInteger(row.age20_24), \n",
      "    d.age25_34 = toInteger(row.age25_34), d.age35_44 = toInteger(row.age35_44), \n",
      "    d.age45_54 = toInteger(row.age45_54), d.age55_59 = toInteger(row.age55_59), \n",
      "    d.age60_64 = toInteger(row.age60_64), d.age65_74 = toInteger(row.age65_74), \n",
      "    d.age75_84 = toInteger(row.age75_84), d.age85_ = toInteger(row.age85_),\n",
      "    d.white = toInteger(row.white), d.blackOrAfricanAmerican = toInteger(row.blackOrAfricanAmerican), \n",
      "    d.americanIndianAndAlaskaNative = toInteger(row.americanIndianAndAlaskaNative), \n",
      "    d.asian = toInteger(row.asian), \n",
      "    d.nativeHawaiianAndOtherPacificIslander = toInteger(row.nativeHawaiianAndOtherPacificIslander),\n",
      "    d.otherRace = toInteger(row.otherRace), d.twoOrMoreRaces = toInteger(row.twoOrMoreRaces),\n",
      "    d.hispanicOrLatino = toInteger(row.hispanicOrLatino), \n",
      "    d.notHispanicOrLatino = toInteger(row.notHispanicOrLatino),\n",
      "    d.stateFips = row.stateFips, d.countyFips = row.countyFips,\n",
      "    d.source = row.source, d.aggregationLevel = row.aggregationLevel\n",
      "RETURN count(d) as Demographics\n",
      ";\n",
      "// Special case for Puerto Rico: Counties become Admin1 divisions\n",
      "//USING PERIODIC COMMIT\n",
      "//LOAD CSV WITH HEADERS \n",
      "//FROM 'FILE:///03a-USCensusDP05Admin2.csv' AS row\n",
      "//WITH row WHERE row.stateFips = '72'\n",
      "//MATCH (a:Admin1{code: row.countyFips, country: 'PR'})\n",
      "//MATCH (d:Demographics{id: 'ACS5-' + row.stateFips + '-' + row.countyFips})\n",
      "//MERGE (a)-[h:HAS_DEMOGRAPHICS]->(d)\n",
      "//RETURN count(h) as HAS_DEMOGRAPHICS\n",
      "//;\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP05Admin2.csv' AS row\n",
      "MATCH (a:Admin2{fips: row.countyFips, stateFips: row.stateFips})\n",
      "MATCH (d:Demographics{id: 'ACS5-' + row.stateFips + '-' + row.countyFips})\n",
      "MERGE (a)-[h:HAS_DEMOGRAPHICS]->(d)\n",
      "RETURN count(h) as HAS_DEMOGRAPHICS\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP05Zip.csv' AS row \n",
      "MERGE (d:Demographics{id: 'ACS5-' + row.postalCode})\n",
      "SET d.name = d.id, d.totalPopulation = toInteger(row.totalPopulation), \n",
      "    d.male = toInteger(row.male), d.female = toInteger(row.female),\n",
      "    d.age0_4 = toInteger(row.age0_4), d.age5_9 = toInteger(row.age5_9), d.age10_14 = toInteger(row.age10_14),\n",
      "    d.age15_19 = toInteger(row.age15_19), d.age20_24 = toInteger(row.age20_24), \n",
      "    d.age25_34 = toInteger(row.age25_34), d.age35_44 = toInteger(row.age35_44), \n",
      "    d.age45_54 = toInteger(row.age45_54), d.age55_59 = toInteger(row.age55_59), \n",
      "    d.age60_64 = toInteger(row.age60_64), d.age65_74 = toInteger(row.age65_74), \n",
      "    d.age75_84 = toInteger(row.age75_84), d.age85_ = toInteger(row.age85_),\n",
      "    d.white = toInteger(row.white), d.blackOrAfricanAmerican = toInteger(row.blackOrAfricanAmerican), \n",
      "    d.americanIndianAndAlaskaNative = toInteger(row.americanIndianAndAlaskaNative),\n",
      "    d.asian = toInteger(row.asian), \n",
      "    d.nativeHawaiianAndOtherPacificIslander = toInteger(row.nativeHawaiianAndOtherPacificIslander),\n",
      "    d.otherRace = toInteger(row.otherRace), d.twoOrMoreRaces = toInteger(row.twoOrMoreRaces),\n",
      "    d.hispanicOrLatino = toInteger(row.hispanicOrLatino), \n",
      "    d.notHispanicOrLatino = toInteger(row.notHispanicOrLatino),\n",
      "    d.postalCode = row.postalCode,\n",
      "    d.source = row.source, d.aggregationLevel = row.aggregationLevel\n",
      "RETURN count(d) as Demographics\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP05Zip.csv' AS row\n",
      "MATCH (p:PostalCode{id: 'zip' + row.postalCode})\n",
      "MATCH (d:Demographics{id: 'ACS5-' + row.postalCode})\n",
      "MERGE (p)-[h:HAS_DEMOGRAPHICS]->(d)\n",
      "RETURN count(h) as HAS_DEMOGRAPHICS\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP05Tract.csv' AS row \n",
      "MERGE (d:Demographics{id: 'ACS5-' + row.tract})\n",
      "SET d.name = d.id, d.totalPopulation = toInteger(row.totalPopulation), \n",
      "    d.male = toInteger(row.male), d.female = toInteger(row.female),\n",
      "    d.age0_4 = toInteger(row.age0_4), d.age5_9 = toInteger(row.age5_9), d.age10_14 = toInteger(row.age10_14),\n",
      "    d.age15_19 = toInteger(row.age15_19), d.age20_24 = toInteger(row.age20_24), \n",
      "    d.age25_34 = toInteger(row.age25_34), d.age35_44 = toInteger(row.age35_44), \n",
      "    d.age45_54 = toInteger(row.age45_54), d.age55_59 = toInteger(row.age55_59), \n",
      "    d.age60_64 = toInteger(row.age60_64), d.age65_74 = toInteger(row.age65_74), \n",
      "    d.age75_84 = toInteger(row.age75_84), d.age85_ = toInteger(row.age85_),\n",
      "    d.white = toInteger(row.white), \n",
      "    d.blackOrAfricanAmerican = toInteger(row.blackOrAfricanAmerican), \n",
      "    d.americanIndianAndAlaskaNative = toInteger(row.americanIndianAndAlaskaNative), \n",
      "    d.asian = toInteger(row.asian), \n",
      "    d.nativeHawaiianAndOtherPacificIslander = toInteger(row.nativeHawaiianAndOtherPacificIslander),\n",
      "    d.otherRace = toInteger(row.otherRace), d.twoOrMoreRaces = toInteger(row.twoOrMoreRaces),\n",
      "    d.hispanicOrLatino = toInteger(row.hispanicOrLatino), \n",
      "    d.notHispanicOrLatino = toInteger(row.notHispanicOrLatino),\n",
      "    d.tract = row.tract,\n",
      "    d.source = row.source, d.aggregationLevel = row.aggregationLevel\n",
      "RETURN count(d) as Demographics\n",
      ";\n",
      "USING PERIODIC COMMIT\n",
      "LOAD CSV WITH HEADERS \n",
      "FROM 'FILE:///03a-USCensusDP05Tract.csv' AS row\n",
      "MATCH (t:Tract{id: 'tract' + row.tract})\n",
      "MATCH (d:Demographics{id: 'ACS5-' + row.tract})\n",
      "MERGE (t)-[h:HAS_DEMOGRAPHICS]->(d)\n",
      "RETURN count(h) as HAS_DEMOGRAPHICS\n",
      ";Demographics\n",
      "3142\n",
      "HAS_DEMOGRAPHICS\n",
      "3142\n",
      "Demographics\n",
      "33120\n",
      "HAS_DEMOGRAPHICS\n",
      "33102\n",
      "Demographics\n",
      "73056\n",
      "HAS_DEMOGRAPHICS\n",
      "73056\n"
     ]
    }
   ],
   "source": [
    "# TODO create a batch script for Windows\n",
    "!../../scripts/run_cyphers.sh -init"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "time: 578.1658120155334\n"
     ]
    }
   ],
   "source": [
    "end = time.time()\n",
    "print('time:', end-start)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Make sure to shutdown Neo4j!"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Stopping Neo4j........ stopped\n"
     ]
    }
   ],
   "source": [
    "!\"$NEO4J_HOME\"/bin/neo4j stop"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
